{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/images samp/Pitches/Adjuster Meeting Outcome Script.pdf",
  "name": "Adjuster Meeting Outcome Script.pdf",
  "type": "pdf",
  "size": 228803,
  "relativePath": "images samp/Pitches/Adjuster Meeting Outcome Script.pdf",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:52.143Z",
  "extractedText": "INTEGRITY\n \nQUALITY\n \nSIMPLICITY\n \n  \n \n  \nAdjuster Meeting Outcomes \nGeneral Notes \n• The adjuster is always going to go back to the homeowner before they leave (if they are home), \nexplain to them what they found and the next steps.  \n• Always join the adjuster for this conversation to make sure everything is being accurately relayed \nto the homeowner  \n• If you are not there, it is an opportunity for the adjuster to blame you if they aren’t approving the \nclaim  \n• It is also a great opportunity to back up the adjuster on anything they are trying to explain to the \nhomeowner  \n• Adjusters really appreciate this  \n• Have to remember that these guys aren’t sales people and may not be the best at handling \nhomeowners/ explaining the process. \n \nApproved \n• Reminders \no Two most important things to prep the homeowner on when you know they are getting an \napproval. \no Supplement process (This gives us value moving forward) \no Mortgage Company  \n• Script \no “Congrats ________ “!  \no Reiterate what the adjuster told them they are approving \no “As you know they are still going to try and mitigate their loss by writing a low estimate. It’s \nno big deal, it happens every time” \no “We will supplement their estimate and add on specific line items that they should be \nincluding. A lot of times they leave off Virginia building code items like ice and water shield \nand certain flashings that we are required by law to install with your new roof”  \no “This process can take a couple weeks so it is very important that as soon as you get your \nestimate, you upload it to your portal and/or email it to me” \no “Like _______ , said your mortgage company will likely be on the check. Every mortgage \ncompany is different. Some will tell you to stop by the closest branch and they will sign it no \nproblem. Some will need a bunch of different documents from us” \no “I would give them a call as soon as you can to let them know what’s going on and see what \nthey are going to need. Let me know what they need from us, usually it’s a waiver of lien, our \nW-9 and a copy of our license” \no “Do you have any questions at all?” \no “Okay great! Congrats again and I will be on the lookout for that estimate! \n \n\n \n \nINTEGRITY\n \nQUALITY\n \nSIMPLICITY\n \nDenied: Reinspection  \n• Reminders \no Only push the homeowner for a reinspection if you feel strongly about the storm damage \no Ensure you have enough photos documented so that insurance will grant the reinspection \no Follow up with h/o until payment received - move to reinspection once received (or \nsupport will have already done this) \no Support will create damage report, order EV, write Est \no Those items with a reinspection request template will be sent to homeowner who can then \nsend to insurance \n• Script \no  “So unfortunately, ________ is not approving the roof/siding. We could not agree on any \nof the damage. He is trying to say that all of the damage I found is normal wear and tear”.  \no Shaking of the head and bewildered facial expressions are great \no “This happens every now and then, when the adjuster is completely unreasonable and \nhard to work with...Now there's two options we can take at this point. We can simply \nforget about the claim and set up a time to sit down and provide you a quote for replacing \n(roofs/siding/gutters/etc.) because you should really get them replaced regardless due to \ntheir condition, or we can try this again by requesting a reinspection - it's actually a pretty \ncommon process with this insurance company and most of our customers have better luck \nthe second time around.\" \no Probably ask, ok, what's the process with reinspection then? \no \"Great question. So you, as the policyholder, will have to contact your claims department \nrequesting a reinspection with a DIFFERENT adjuster. Typically they request photos and \nan estimate from your contractor before agreeing to a reinspection. So we will put \ntogether a detailed estimate which includes all the damaged items I found broken down \nby line item with accompanying photos. We’ll   then send that over to you in an email \nwhich will also include instructions on how to request a reinspection with (insurance). \nOnce the reinspection is granted, the process is the same as before. You'll be contacted by \nthe adjuster and you can schedule that meeting directly in your portal or simply give me a \ncall!\"  \n \n \n \n \n \n \n \n \n \n \n\n \n \nINTEGRITY\n \nQUALITY\n \nSIMPLICITY\n \nDenied: Retail \n• Reminders \no You should be pushing to set up a retail meeting if the damage is not great (relative to \nwhich insurance we are dealing with) or the homeowner is not all the way on board with \nthe reinspection process.  (This stage is predicated on the fact that we should only be \nsigning up homes that NEED a new roof/siding/etc., i.e. older homes with old exteriors) \no Take photos to build the case for retail \no Once scheduled, move them to Retail; upload all photos \n• Script \no  “So unfortunately, ________ is not approving the roof/siding. We could not agree on any \nof the damage. He is trying to say that all of the damage I found is normal wear and tear.”  \no “It sounds like (Insurance Company) is really digging their heels in on this one. I would \ntell you we needed to fight this but I don’t want to waste your time”  \no “I do think your roof needs attention before you start getting leaks and have other \nproblems. I’d love to sit down with you to give you an estimate on how we could address \nthese items” \n Rehash the damage you sold them on during the initial inspection (granule loss \nmost importantly) and show them any new photos to build greater need and \nurgency for project \no “And because you’re an existing customer and have gone this far in the process with us, \nwhen we sit down to go over everything, you’ll automatically receive $1,000 (if roof and \nsiding: $2000) off the quote” \no “So let me pull up my calendar and we can figure out a time that works” \no Schedule appt – or they can schedule using the portal \no “Ok great, so I’ll see you on ___ at ___. In the meantime, you can log back into your \ncustomer portal to use the virtual home remodeler tool so you can check out various \ncolors/styles. Give me a call if you have any questions, take care!” \no If they aren’t interested \n “Ok, no worries, I totally understand – it’s a large project to consider when \ninsurance isn’t footing the bill. The discount remains active for 60 days, so if you \nchange your mind or hit it big on bitcoin, don’t hesitate to reach back out to me.” \n \n \n \n \n \n \n \n \n \n\n \n \nINTEGRITY\n \nQUALITY\n \nSIMPLICITY\n \nDecision Pending  \n• Reminders \no 90% of the time you will know whether the roof/siding is being approved. Sometimes \nand usually when it’s a 3rd party adjuster, they say all they do is file a report and that \nthey have no idea whether it will be approved or not. \no Ensure you have enough photos in case of denial \no Discuss situation with homeowner \no Once notified of status, move job accordingly and notify support \n• Script \no “Like _________ said, he will be submitting his report to your insurance company. Then \nthe desk adjuster will review everything and make the ultimate decision” \no You can let them know which way you believe it is leaning, if you feel you need to prep \nthem on next step of denial or next step of approval  \no “You should receive the estimate within 5-7 days. If you don’t, you should definitely \nreach out to the adjuster. Once you get any communication from your insurance company \nplease let me know and upload to your portal” \no “We will review that and I will give you a call to let you know how we will proceed from \nthere!” Please don’t hesitate to give me a call with any questions!”",
  "textLength": 7699,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}