{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Adjuster and Ladder Assist Information/Adjuster_Inspector Information.xlsx",
  "name": "Adjuster_Inspector Information.xlsx",
  "type": "xlsx",
  "size": 34591,
  "relativePath": "Adjuster and Ladder Assist Information/Adjuster_Inspector Information.xlsx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:57:36.277Z",
  "extractedText": "=== Sheet: Sheet1 ===\nName\tInsurance/Inspection Company\tInspector or Adjuster?\tHover required? (Y/N)\tMark roof prior? (Y/N)\tNotes on Adjuster/Inspector\n\nChristian Ballester\tUSAA/Progressive/Liberty\tAdjuster\tY\tY\tAlways looking to buy. Appreciates when the roof/siding/exterior is already marked up. Get Hover ESX file so he can write estimate easily\nBadou Hadidane\tUSAA\tAdjuster\tN\tN\tTerrible. Try to get HO to call to get this claim reassigned instead. Spends 10 minutes on the roof and gets off not looking to buy. Most of the time will deny it and you will need to get the reinspection. Will only buy if there's lots of signs. Wants Hover report, but it wont change his decision if you give it to him or not. Might be a waste of time and money giving him the Hover report. Do not supplement his approvals \nVicki Henry\tHomesite (Afics)\tAdjuster\tY\tY\tVery easy to work with. Will use a ladder assist but buys most of the time if the roof is marked up well and damage makes sense. Get Hover ESX for her\nMatt Schneider\tTravelers\tAdjuster\tN\tY\tNice guy and willing to buy. Will use a ladder assist but very reasonable\nJared Hutto\tUSAA\tAdjuster\tY\tY\tMarks hail and claims he's buying but desk adjusters can deny his reports. Make sure you take pictures of all his markings after the meeting\nGarrett miller\tUSAA\tInspector\tY\tY\tWill take photos of anything you mark. Super friendly. Remind him to write number of hail and wind hits\nAshley\tUSAA \tInspecter\t\tY\tHas someone else go on the roof. Take photos of everything. She's impartial and sends photos to desk adjuster. \nMicheal Cinzano\tTraveler\tAdjuster\tN\tY\tBuyer, likes dad jokes, usually has a ladder assist but likes to get up on the roof.\nBrandon \tSeekNow\tInspector\tY\tY\tBlack GMC, awesome sumo stance little giant. Used to be a contractor, loves me and Patrick. Great with Wind \nFrank\tState Farm\tAdjuster\tN\tY\tWants to buy everything. Make sure you point out gutters, ds, screens and wraps. Also will give O&P if any interior \nNick\tHancock Claims -\tInspector \tN\tY\tTry's to help buy everything \nIsiah\tSeeknow \tInspector \tN\tY\tGood adjuster \nRodney Hart\tUSAA\tIA\nBryant Turberville \tSeekNow\tInspector \tN\tY\tBryant was a very personable guy. He was a contractor for 15 years before. Good guy to make conversation with. He definitely is the boy will help out and put together a great report \nHunter White \tLiberty Mutual\tAdjuster\tN\tN (Didn't Ask) \tGreat communicator, sick day of the AM but approved the roof based on a good photo report.\nTim Clark\tTravelers\tStaff Adjuster\tN\tY\tCool guy will buy if you give him good enough damage. I sent the photo report a few days before and he went off of a lot of my own photos. \nSam\tRe build \nBrandon \tSeekNow\tInspector\tY\tYes\tSuper cool dude. Here in town from Texas.his dad owns a sports fishing business in Costa Rica. He was cool about me chalking everything up but because I had already sent it to the adjuster he had to do his own test squares. None the less marked 15+ hail each test square in probably 30 seconds each. This dude is cool AF seems quiet at first but being up sports fishing and he will be your best friend\nJerson \tGlobal Risk Solutions\tInspector \tN\tN\tHe will buy if the damage is legit. Big ford truck and super chill. \nRobert Jacob's \tSeekNow\tInspector \tN\tY\tThis dude is the boy definitely have everything chalked up in advance. He said that he absolutely loved that he will take his time and is very personable will converse with you.\nLeo\tPatriot claims\tInspector\tN\tY\tHad this guy for three AMs in a row between two days. Allstate. I chalked the six quadrants on front rear slope and he does 5 by 5s on the smaller slopes. He was completely cool as shit just make sure that the test squares are done properly and make it clean. Two of the 3 approved after ITEL\nRobert jones\tUsaa\tInspector\tY\tY\tHad him twice. First roof barely had any damage and it got approved. Second roof had more damages and he allowed me to take the pictures on the steep slope roof for him.\nAiden Payne\tUsaa\tInspector\tY\tY\tSeems like a good guy from Texas. Said he was going to recommend that there is hail. Younger and helped me with my ladder. Took minimum photos and made it so I had to submit a rebuttal email!\nMeredith Hawkins\tTravelers\tStaff Adjuster\tY\tY\tSuper chill, she prefers you mark everything up a day before and take your photo report. Will send you a link to complete her Hover report while you are at it. Will 100% buy 3-tabs. Will use your photos, she will request you air drop them to her at inspection. Uses a drone during inspection. \nNathan Casada\tPatriot Claims\tInspector\tN\tY\tLikes to have markings prior to inspection. Takes his time, will photograph all markings. Cool guy, he is still a server back in Texas, at Texas Road House when he is in slow season with roofs. Likes small talk. \nMichael keating\tUSAA\tIA\tY\tY\tSuper cool guy from Texas handles Missouri usually definitely thorough but was super appreciative for chalking up in advance. He was a re inspection IA that ended up getting approved the two final slopes that were denied \nJeremy\tSeekNow\tInspector \tN\tN\tIf you get this guy reschedule immediately he is not out to help contractors he is highly against us \nAxel\tSeekNow\tInspector \tN\tN\tIf you get this guy reschedule immediately he is not out to help contractors he is highly against us \nDan\tSeekNow\tInspector \tN\tN\tIf you get this guy reschedule immediately he is not out to help contractors he is highly against us \nTrevor Franklin's\tSafeco\tAdj\tY\tN\tAmazing experience, ESX helps. He sent out a seek now rep. Buyer\nRyan Richardson\tCumberland\tIA\tN\tY\tGreat guy. He's buying if you have damage. Need collateral! \nRay Quinn\tUSAA\tIA\tY\tY\tTry to request different adjuster. He on some BS. He told me that because there was no spatter present and says that it lasts for 18 months after hail he couldn't put that it was hail from the storm we claimed. Although he appreciated chalking everything up. I ended up getting the approval for both roof and siding with a re inspection. This dude didn't look out\nDaniel \tUSAA (Portillo Inspections)\tIA\tY\tY\tThis guy was definitely the boy. Traveling adjuster from Texas. Spanish guy. Said all his inspections get approved. He found even additional damage then I found and I found a lot. Very easy going. Loves that it's chalked up in advance. Will need HOVER. You definitely want this guy \nTommy C\tSeekNow\tLadder assist\tN\tN\tBe on the lookout for Tommy C from Seeknow. Pretends to be your guy and says he’s going to get the roof approved only for him to say no damage in his report. Been fighting a claim he was assigned too for months now. \nJERSON \tGlobal Risk Solutions \tIA / Ladder Assit\tY\tN\tWhen you get this guy only mark small dots next to the hail hits on shingles DO NOT PUT TEST SQUARE PRIOR. Shoot the shit and develop a relationship with him and he will get you some wins absolutely forsure. He's cool AF used to be a contractor for three years himself drives grey F150 Ladder Rack \nBrian Fredrik\tTravelers \tStaffer\tY\tY\tYoung blonde guy long hair from Sweden but no accent. Super effin cool easy going professional. More like one of the buys forsure. Roof and siding claim rear elevation smashed with hail. He covered all\nMATT SCHNEIDER \tTravelers\tDesk  adjuster\tN\tN\tThis guy is super cool. Loves outdoors, Make sure you know where all of the damages so you can point it out to him. He usually wants to buy. He's local and lives in Leesburg. Elevations of the house once he saw that and roof. He was super grateful for chalking it all up before hand definitely neatly chalk everything if you know this guy is coming \nBrandon Black Chevy\tSeekNow\tInspector \tN\tY\tDrives a black Chevy truck. Brown hair to his shoulders brown mustache wears hat backwards. Pretty cool Guy takes his time. Although I had everything chalked up he still did some chalking of his self. Overall pretty cool dude we shot the shit for the most part\nTiara Boykin\tTravelers \tStaff Adjuster\tN\tY\tWorks a lot of claims in Loundoun County. Had a pretty tough Seek now guy but still bought it for hail. Have a lot more success with travelers adjusters in Loundoun as opposed to fairfax county. Would recommend marking roof up prior.\nBJ\tREBUILD\tInspector/LadderAssist\tN\tY\tDude was pretty cool actually small white dude facial hair. Was genuinely a nice guy and only took pics of the best looking stuff so he was trying to look out forsure\nChris O.\tRebuild \tInspector/LadderAssist\tN\tN\tCool white guy. If there's collateral it's easier for him to look for hail on the shingles that he will agree with. He did his own test squares and chalked hail in all. He definitely was looking out. This dude is the boy for rebuild forsure \nJesse\tRebuild\tInspector/LadderAssist\tN\tN\tThis guy is complete garbage. If there is a way to change this vendor to someone else. Do it. He's standoffish doesn't want to talk says he's not there to be your friend. Definitely switch this guy. My photo report got the roof bought not rebuilds. \nGreg\tRebuild \tInspector/LadderAssist\tN\tN\tVery standoffish doesn't want to talk. Army vet. Isn't there to help you he takes terrible photos simply hovers his phone over the damage and doesn't truly try to take a good photo. \nClayton Buttle\tUSAA\tIA\tY\tN\tSuper chill laid back guy from SC likes to talk about his kids. Very family oriented. He doesn't drink anything sugary so don't bring gatorade if you meet him. Will buy everything you show him so be sure to bring your light. Give him a little bit of room to do his own thing. He'll mark everything himself so you don't need to chalk anything unless he asks. It also really helps him if you let him use your ladder since he's really quick and likes to be efficient. He said not to mark the roof prior either. Been an IA for 10 years and has known Oliver since 2018/2019\nPA Paul Vaccaro\tHANCOCK\tLadder Assist \tN\tN\tOlder late 40s white guy had a lisp really into wrestling. Really cool guy very Conversive. He acknowledged my chalk marks took photos. All in all real good AM drives dark blue Chevy Silverado \nClay\tPATRIOT CLAIMS\tLadder Assist\tN\tYes\tThis dude is absolutely the boy he literally said \"soft spot in heaven for contractors that chalk day before.\" This was Allstate though so the test squares have to be done the right way 6 quadrants. He will look out for you with a solid report if the damage is good\nLuke\tUSAA ALLCAT\tIA\tY\tY\tThis guy is super cool longish blond hair. He was very thorough and taught me about Z flashing. He literally smiled so big when he saw the gutter hail damage. He did a very thorough inspection and documented every lick of damage. Clearly trying to buy. Get him the hover he will love that and he agreed with all my test square markings and even found more 15+ hail every test square every elevation. This dude is the fkn goat just make sure you filed a claim with good damage.\nDustin Jones\tHomesite\tAdjuster\tN\tY\tSuper nice guy. Middle aged very well. First in the insurance industry told me a lot of insurance companies are moving to wind and hail. Deductibles. He actually hopped up on the roof with the ladder assist and I inspect some damages, and then made decision on the spot for full replacement\nKyle\tProgressive \tField Adjuster\tN\tY\tReally friendly and personable. We had a great conversation about how there should be any bad blood between contractors and adjusters. Helped me out big time getting the roof approved and letting the HO know about her separate wind/hail deductible she didn't know she had. \nTerrence \tHancock \tLadder assist\tN\tY\tSuper cool guy. Is always down to help the contractor out as best as he can but he will not agree with what obviously is not hail damage. If you show him good damage he will write that report in our favor and if there isn't good damage don't get mad at him for not agreeing with it. He is definitely the boy \nWalter morales\tSeek now\tInspector\tN\tY\tVery cool. Allows us to point out damages. He documents everything and seems to be on our side. Very informative to new guys. He's the man\nRobert Sullivan \tUSAA\tIA\tY\tY\tHe said he's been doing this stuff his entire life. Wasn't the best first experience with him. Cedar shake hail claim. The HO lives overseas and was adamant about trying although the damage wasn't great. This guy was a little blown about no great hail damage. Ultimately he is there to buy so if you got good damage then you're in for a good one. If you don't got good enough damage then let this guy know up front the minute you meet him he will respect you more for it\nBrandon Loa\tSeekNow\tLadder Assist\tN\tY\tSuper cool dude drives an F150. Long brown hair and beard. He definitely is the boy. Conversed with me and took pics of the majority of my damages. It was a ten pitch roof though and his pads were shot so he wasn't really scaling it the best but none the less it was a good experience with him. I even left him a good review via the text I got after we were finished. \nEric \tSeekNow\tLadder Assist \tN\tY\tSuper cool guy. Glasses bearded, stocky dude. He genuinely is out to help you and will take any pics that you need. He kind of reminds me of the super cool uncle. This dude is one of the boys forsure \nMalik (Marouane)\tSeekNow\tLadder Assist \tN\tN\tHad him with USAA. He saw me and the adjuster shooting the shit as he arrived which I feel eased him down some and made him comfortable. He was super cool we talked about fishing and his kids and he told me as we were going up the roof he was going to give me the roof before even looking at all the test squares! At the end he said he's calling all hail absolutely the fkn boy :) Anthony with USAA that was there immediately told the Ho There was another to give her a full roof replacement of a two year old shingle sheesh!!\nBen\tStatefarm\tTraveling IA \tN\tY\tInitially, we had to reschedule the adjuster meeting. He was super cool about that. He was a little bit late today he called to apologizing showed up. Didn'But did answer any questions. I asked he's a pretty detailed guy probably been doing this for a long time because State Farm called him asking for help all the way from Florida. I really don't know how it all went, but he definitely chalked up storm damage and didn't say whether he agreed or not, but he measured a lot of stuff I would say guys not a bad adjuster at all\nErik \tHancock\tInspector\tN\tY\tThis guys the boy. Will help you chalk stuff up and give you the best chance of approval. Has neck tats and just chatted about soccer the whole time. \nMichael Vi\tLiberty Mutual \tAdjuster \tN \tY\tSeems like a solid dude. Approved my wind and hail claim out in Ashburn but damage has to be legit. Not the type of guy to buy for the sake of buying\nSylias (Sigh-les) York\tUSAA ALLCAT\tTraveling IA from Idaho\tY\tY\tIf you have Sylias (Sigh-Las) York with USAA ALLCAT, he loves when you chalk up all the metals beforehand and is looking to buy anything and everything! You can also mark shingles only with a dot next to it and then he can mark it himself after to do the test square. He’s coming from Idaho with a rodeo championship belt and is gonna be here for two more weeks. Also have the Hover esx report request beforehand so you can email it to him when he gets there. I’ll put this in the adjuster notes too\nFatima \tLiberty\tDesk adjuster \tY\tN\tWell she was adamant about still inspecting the elevations and exterior while it was raining since she was already there. Ofcourse the hail hits looked distorted and not really as visible and then when I tried to wipe the water away she told me don't wipe it -_- like tf? How are you going to see it then? Then she pulled the ehh I'm seeing a pattern here that's not looking consistent with hail and then I was like are you serious? This is definitely hail and if you were to see the roof metals you wouldn't be doubting this and if it wasn't raining you wouldn't be doubting this. She was pretty difficult but none the less I'm not worried I know there's fire hail damage there and my photo report is great so just gotta get her when it's dry and show her some quality stuff and I'm sure she will buy. She will try to pull the whole \"wind driven\" thing with hail and you tell her NO hail is not always wind driven and does coke straight down and can most absolutely affect four sides of elevation metals. Don't let her outsmart you because she really is clearly just dumb and probably shouldn't be out inspecting for storm damage. Have a bad ass photo report and you will go far with her \nStran\tUSAA\tIA Texas Boy!\tY\tY\tDude is out here from Texas literally to buy any and everything you definitely want this guy!!\nWarner\tSeek now\tIA\tN\tY\tPretty criminal, talked down on our ownership because we are not taught how to vandalize. Plus is he is pushing for the buy negative is it's not honest. May need to redo phot report if done prior to adjuster meeting due to new \"damages\"\nJohn \tHancock \tLadder assist \tN\tY\tThis dude is absolutely the boy as long as you give him some good collateral and your test squares look really good and you're not marking any hail on shingles that have fibers inside he will agree and help you win that shit every time we see each other and a hug and a big what's up my boy! This dude is super cool you want him for sure just don't show him bullshit\nJacob Nixon\tSeekNow\tLadder assist\tN\tY\tSwoll SeekNow dude. Helped me get a cedar approved for $80k he definitely will take his time. Pretty cool guy. He will shoot the shit with you too\nCody Stevenson \tUSAA \tTRAVELING IA\tY\tY\tHES BUYING YOU WANT HIM \nNick ?\tSeeknow\tLadder Assist\tN\tN\tChalked wood, from Texas, made the inspection as short as possible. I showed him damage to the gutter and he did not acknowledge it in his report. Not mean but unprofessional. Did not want to talk to me at all. He started getting an attitude while I asked questions.\nBilly Murphy\tSeeknow \tLadder assist \tN\tN\tGuy was a contractor prior to Seeknow. Really cool dude, very detailed. \nPatrick (Reed)\tSeeknow\tLadder assist\tN\tN\tI've had him twice, makes own squares lets you mark inside them. Do not mark without him being in roof/without permission. Easy to work with. Got along with him well.\nWilliam \tPatriot claims \tLadder assist \tN\tY\tBeen doing this a while. He’s easy going though and somewhat talkative. I got two approvals with him. Sent him photos he added to his file that we forgot to take pics of and he did so. He will lookout. If it’s Allstate let him do the test squares just mark the hail once done. He’s good\nJeremy Polluck\tSeekNow \tLadder Assist\tN\tY\tBlack guy dreads absolutely the boy \nGarrett\tHancock\tInsepctor\tN\tY\tVery laid back, allows you to mark up the roof prior to him getting there. Very easy to get along with as long as you allow him to do whatever he needs to do while he is up on the roof. Been in the industry for 7 years. \nAndrew wells \tSeeknow \tInspector \tY\tY\tDudes pretty swoll super cool guy definitely went out of his way to give the best report as in report the shingles as in very bad condition not reparable and the rest squares we did he made sure his had the most this guy is got but make sure you're showing him some good storm damage because he knows his shit \nZach brown \tHancock \tInspector \tY\tY\tBob Ross Fro. Dude is super cool and soft spoken. Definitely looked out and took photos of everything o needed him to he is definitely the boy \nFarenholt \tUSAA\tIA\tY\tY\tShow him good damage and he will most certainly buy \nJames pope\tStatefarm\tIA\tN\tN\tThis man is absolutely terrible he will deny everything you say is hail he's super tough and a know it all big time \nMauricio\tUSAA\tIA Alacrity\tY\tN\tYou absolutely want this you one of the coolest IAs yet 👊\nPat Ryan \t\t\t\t\tTHIS GUY IS THE MAN!\nThomas Garber\tSeekNow\tLadder Assist\tN\tN\tThis dude is an absolute DBag definitely reschedule and request to chance reps if you get him. \nHaylee Maklary\n310-710-9062\tErie\tIA\tY\tY\tYou want to work with her she is great. Very talkative. Be flexible with her on your calendar because you want her to do it and not anyone else. Will mark up hail for you \"as long as it looks pretty\" in her photos. You can mark the roof prior, but just ask for her permission first to see what she wants to do. She also took an iTel sample 3-tab on the spot to make sure it was disco. She wants XMS file and PDF for Hover. NOT ESX. Send email to hayleemaklary@yahoo.com.\nJesse Simpson\tStatefarm\t\t\t\tABSOLUTELY RESCHEDULE IMMEDIATELY\nPriscilla Portillo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=== Sheet: RVA office Adjusters info  ===\nName\tInsurance/Inspection Company\tInspector or Adjuster?\tHover required?\tPhone Number\tNotes on Adjuster/Inspector\nAlec\tSeek Now\tInspector\t\t\tformer contractor, seems cool and straightforward but not sure if he's going to help you get it bought \nRyan \tHomesite\tBoth \t\t804-813-9974\tcool guy who said he's here to help the homeowner, will buy with good damage, played college baseball at randolph macon\nJean Paul Ruz / JP\tUSAA\tBoth \tyes\t210-430-8431\nHarrison Thrasher\tUSAA\tBoth \tyes\t443-510-6612\nDavid Keith Snow\tErie\tAdjuster\t\t\tbeen doing this for 30 years, plays the nice guy but also kind of a smartass/know it all\nJeb Melton\tStatefarm\tBoth \t\t\tget a new adjuster immediately - denies all hail damage to shingles but agrees to metal damage and collateral \nMicah\tSeek Now\tInspector\t\t\tdoesnt mark any damage, doesnt seem to like contractors, he's like a robot both times Ive had him\nDavid Beck\tGrange\tInspector\tyes\t540-717-5248\tCool old guy - 10 year military vet 30 year firefighter career. Unless the roof is smalll/flat he won't get on it. He'll give you his camera to take pictures of everythig you chalk up. Hoping he's a buyer \nJerrick\tStatefarm\nBryan Portinari\tHancock\tinspector\tyes\t503-516-2149\tchill - interviewed for a job with RoofER but didn't take it\nWill Selvage\tHancock\tinspector\t\t301-609-1520\treal cool dude - helps look for damage - only been doing this for a few weeks\nShakul\tHancock\tinspector\t\t571-412-9407\thas his own contracting company\nAndrew\tSeek Now\t\t\t\ttotal bro - helps look for damage if it makes sense. he wants to get it bought for the home owner\nBrian Patterson\tHippo / Progressive\tIA\t\t\twants to help you buy it, esecially if there's good damage. good guy, easy to talk to \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=== Sheet: Copy of Sheet1 ===\nAdjuster/Inspector Name\tInsurance/Inspection Company\tInspector or Adjuster?\tHover required? (Y/N)\tMark roof prior? (Y/N)\tNotes on Adjuster/Inspector\n\nChristian Ballester\tUSAA/Progressive/Liberty\tAdjuster\tY\tY\tAlways looking to buy. Appreciates when the roof/siding/exterior is already marked up. Get Hover ESX file so he can write estimate easily\nBadou Hadidane\tUSAA\tAdjuster\tN\tY\tReally good now he is an IA, he is looking to buy provide a HOVER for every USAA IA. Do not supplement his approvals \nVicki Henry\tHomesite (Afics)\tAdjuster\tY\tY\tVery easy to work with. Will use a ladder assist but buys most of the time if the roof is marked up well and damage makes sense. Get Hover ESX for her\nMatt Schneider\tTravelers\tAdjuster\tN\tY\tNice guy and willing to buy. Will use a ladder assist but very reasonable\nJared Hutto\tUSAA\tAdjuster\tY\tY\tMarks hail and claims he's buying but desk adjusters can deny his reports. Make sure you take pictures of all his markings after the meeting\nGarrett miller\tUSAA\tInspector\tY\tY\tWill take photos of anything you mark. Super friendly. Remind him to write number of hail and wind hits\nAshley\tUSAA \tInspecter\t\tY\tHas someone else go on the roof. Take photos of everything. She's impartial and sends photos to desk adjuster. \nMicheal Cinzano\tTraveler\tAdjuster\tN\tY\tBuyer, likes dad jokes, usually has a ladder assist but likes to get up on the roof.\nBrandon \tSeekNow\tInspector\tY\tY\tBlack GMC, awesome sumo stance little giant. Used to be a contractor, loves me and Patrick. Great with Wind \nFrank\tState Farm\tAdjuster\tN\tY\tWants to buy everything. Make sure you point out gutters, ds, screens and wraps. Also will give O&P if any interior \nNick\tHancock Claims -\tInspector \tN\tY\tTry's to help buy everything \nIsiah\tSeeknow \tInspector \tN\tY\tGood adjuster \nRodney Hart\tUSAA\tIA\nBryant Turberville \tSeekNow\tInspector \tN\tY\tBryant was a very personable guy. He was a contractor for 15 years before. Good guy to make conversation with. He definitely is the boy will help out and put together a great report \nHunter White \tLiberty Mutual\tAdjuster\tN\tN (Didn't Ask) \tGreat communicator, sick day of the AM but approved the roof based on a good photo report.\nTim Clark\tTravelers\tStaff Adjuster\tN\tY\tCool guy will buy if you give him good enough damage. I sent the photo report a few days before and he went off of a lot of my own photos. \nSam\tRe build \nBrandon \tSeekNow\tInspector\tY\tYes\tSuper cool dude. Here in town from Texas.his dad owns a sports fishing business in Costa Rica. He was cool about me chalking everything up but because I had already sent it to the adjuster he had to do his own test squares. None the less marked 15+ hail each test square in probably 30 seconds each. This dude is cool AF seems quiet at first but being up sports fishing and he will be your best friend\nJerson \tGlobal Risk Solutions\tInspector \tN\tN\tHe will buy if the damage is legit. Big ford truck and super chill. \nRobert Jacob's \tSeekNow\tInspector \tN\tY\tThis dude is the boy definitely have everything chalked up in advance. He said that he absolutely loved that he will take his time and is very personable will converse with you.\nLeo\tPatriot claims\tInspector\tN\tY\tHad this guy for three AMs in a row between two days. Allstate. I chalked the six quadrants on front rear slope and he does 5 by 5s on the smaller slopes. He was completely cool as shit just make sure that the test squares are done properly and make it clean. Two of the 3 approved after ITEL\nRobert jones\tUsaa\tInspector\tY\tY\tHad him twice. First roof barely had any damage and it got approved. Second roof had more damages and he allowed me to take the pictures on the steep slope roof for him.\nAiden Payne\tUsaa\tInspector\tY\tY\tSeems like a good guy from Texas. Said he was going to recommend that there is hail. Younger and helped me with my ladder. Took minimum photos and made it so I had to submit a rebuttal email!\nMeredith Hawkins\tTravelers\tStaff Adjuster\tY\tY\tSuper chill, she prefers you mark everything up a day before and take your photo report. Will send you a link to complete her Hover report while you are at it. Will 100% buy 3-tabs. Will use your photos, she will request you air drop them to her at inspection. Uses a drone during inspection. \nNathan Casada\tPatriot Claims\tInspector\tN\tY\tLikes to have markings prior to inspection. Takes his time, will photograph all markings. Cool guy, he is still a server back in Texas, at Texas Road House when he is in slow season with roofs. Likes small talk. \nMichael keating\tUSAA\tIA\tY\tY\tSuper cool guy from Texas handles Missouri usually definitely thorough but was super appreciative for chalking up in advance. He was a re inspection IA that ended up getting approved the two final slopes that were denied \nJeremy \tSeekNow\tInspector \tN\tN\tIf you get this guy reschedule immediately he is not out to help contractors he is highly against us \nAxel\tSeekNow\tInspector \tN\tN\tIf you get this guy reschedule immediately he is not out to help contractors he is highly against us \nDan\tSeekNow\tInspector \tN\tN\tIf you get this guy reschedule immediately he is not out to help contractors he is highly against us \nRay Quinn\tUsaa\tIA\tN\tY\tGood guy from Texas. Approved the roof and hinted that it was covered after the inspection. Very knowledgeable \nTrevor Franklin's\tSafeco\tAdj\tN\tN\tAmazing experience, ESX helps. He sent out a seek now rep. Buyer\nRyan Richardson\tCumberland\tIA\tN\tY\tGreat guy. He's buying if you have damage. Need collateral! \nRay Quinn\tUSAA\tIA\tY\tY\tTry to request different adjuster. He on some BS. He told me that because there was no spatter present and says that it lasts for 18 months after hail he couldn't put that it was hail from the storm we claimed. Although he appreciated chalking everything up. I ended up getting the approval for both roof and siding with a re inspection. This dude didn't look out\nDaniel \tUSAA (Portillo Inspections)\tIA\tY\tY\tThis guy was definitely the boy. Traveling adjuster from Texas. Spanish guy. Said all his inspections get approved. He found even additional damage then I found and I found a lot. Very easy going. Loves that it's chalked up in advance. Will need HOVER. You definitely want this guy \nTommy C\tSeekNow\tLadder assist\tN\tN\tBe on the lookout for Tommy C from Seeknow. Pretends to be your guy and says he’s going to get the roof approved only for him to say no damage in his report. Been fighting a claim he was assigned too for months now. \nJERSON \tGlobal Risk Solutions \tIA / Ladder Assit\tY\tN\tWhen you get this guy only mark small dots next to the hail hits on shingles DO NOT PUT TEST SQUARE PRIOR. Shoot the shit and develop a relationship with him and he will get you some wins absolutely forsure. He's cool AF used to be a contractor for three years himself drives grey F150 Ladder Rack \nBrian Fredrik\tTravelers \tStaffer\tY\tY\tYoung blonde guy long hair from Sweden but no accent. Super effin cool easy going professional. More like one of the buys forsure. Roof and siding claim rear elevation smashed with hail. He covered all\nMATT SCHNEIDER \tTravelers\tDesk  adjuster\tN\tN\tThis guy is super cool. Loves outdoors, Make sure you know where all of the damages so you can point it out to him. He usually wants to buy. He's local and lives in Leesburg. Elevations of the house once he saw that and roof. He was super grateful for chalking it all up before hand definitely neatly chalk everything if you know this guy is coming \nBrandon Black Chevy\tSeekNow\tInspector \tN\tY\tDrives a black Chevy truck. Brown hair to his shoulders brown mustache wears hat backwards. Pretty cool Guy takes his time. Although I had everything chalked up he still did some chalking of his self. Overall pretty cool dude we shot the shit for the most part\nTiara Boykin\tTravelers \tStaff Adjuster\tN\tY\tWorks a lot of claims in Loundoun County. Had a pretty tough Seek now guy but still bought it for hail. Have a lot more success with travelers adjusters in Loundoun as opposed to fairfax county. Would recommend marking roof up prior.\nBJ\tREBUILD\tInspector/LadderAssist\tN\tY\tDude was pretty cool actually small white dude facial hair. Was genuinely a nice guy and only took pics of the best looking stuff so he was trying to look out forsure\nChris O.\tRebuild \tInspector/LadderAssist\tN\tN\tCool white guy. If there's collateral it's easier for him to look for hail on the shingles that he will agree with. He did his own test squares and chalked hail in all. He definitely was looking out. This dude is the boy for rebuild forsure \nJesse\tRebuild\tInspector/LadderAssist\tN\tN\tThis guy is complete garbage. If there is a way to change this vendor to someone else. Do it. He's standoffish doesn't want to talk says he's not there to be your friend. Definitely switch this guy. My photo report got the roof bought not rebuilds. \nGreg\tRebuild \tInspector/LadderAssist\tN\tN\tVery standoffish doesn't want to talk. Army vet. Isn't there to help you he takes terrible photos simply hovers his phone over the damage and doesn't truly try to take a good photo. \nClayton Buttle\tUSAA\tIA\tY\tN\tSuper chill laid back guy from SC likes to talk about his kids. Very family oriented. He doesn't drink anything sugary so don't bring gatorade if you meet him. Will buy everything you show him so be sure to bring your light. Give him a little bit of room to do his own thing. He'll mark everything himself so you don't need to chalk anything unless he asks. It also really helps him if you let him use your ladder since he's really quick and likes to be efficient. He said not to mark the roof prior either. Been an IA for 10 years and has known Oliver since 2018/2019\nPA Paul Vaccaro\tHANCOCK\tLadder Assist \tN\tN\tOlder late 40s white guy had a lisp really into wrestling. Really cool guy very Conversive. He acknowledged my chalk marks took photos. All in all real good AM drives dark blue Chevy Silverado \nClay\tPATRIOT CLAIMS\tLadder Assist\tN\tYes\tThis dude is absolutely the boy he literally said \"soft spot in heaven for contractors that chalk day before.\" This was Allstate though so the test squares have to be done the right way 6 quadrants. He will look out for you with a solid report if the damage is good\nLuke\tUSAA ALLCAT\tIA\tY\tY\tThis guy is super cool longish blond hair. He was very thorough and taught me about Z flashing. He literally smiled so big when he saw the gutter hail damage. He did a very thorough inspection and documented every lick of damage. Clearly trying to buy. Get him the hover he will love that and he agreed with all my test square markings and even found more 15+ hail every test square every elevation. This dude is the fkn goat just make sure you filed a claim with good damage.\nDustin Jones\tHomesite\tAdjuster\tN\tY\tSuper nice guy. Middle aged very well. First in the insurance industry told me a lot of insurance companies are moving to wind and hail. Deductibles. He actually hopped up on the roof with the ladder assist and I inspect some damages, and then made decision on the spot for full replacement\nKyle\tProgressive \tField Adjuster\tN\tY\tReally friendly and personable. We had a great conversation about how there should be any bad blood between contractors and adjusters. Helped me out big time getting the roof approved and letting the HO know about her separate wind/hail deductible she didn't know she had. \nTerrence \tHancock \tLadder assist\tN\tY\tSuper cool guy. Is always down to help the contractor out as best as he can but he will not agree with what obviously is not hail damage. If you show him good damage he will write that report in our favor and if there isn't good damage don't get mad at him for not agreeing with it. He is definitely the boy \nWalter morales\tSeek now\tInspector\tN\tY\tVery cool. Allows us to point out damages. He documents everything and seems to be on our side. Very informative to new guys. He's the man\nRobert Sullivan \tUSAA\tIA\tY\tY\tHe said he's been doing this stuff his entire life. Wasn't the best first experience with him. Cedar shake hail claim. The HO lives overseas and was adamant about trying although the damage wasn't great. This guy was a little blown about no great hail damage. Ultimately he is there to buy so if you got good damage then you're in for a good one. If you don't got good enough damage then let this guy know up front the minute you meet him he will respect you more for it\nBrandon Loa\tSeekNow\tLadder Assist\tN\tY\tSuper cool dude drives an F150. Long brown hair and beard. He definitely is the boy. Conversed with me and took pics of the majority of my damages. It was a ten pitch roof though and his pads were shot so he wasn't really scaling it the best but none the less it was a good experience with him. I even left him a good review via the text I got after we were finished. \nEric \tSeekNow\tLadder Assist \tN\tY\tSuper cool guy. Glasses bearded, stocky dude. He genuinely is out to help you and will take any pics that you need. He kind of reminds me of the super cool uncle. This dude is one of the boys forsure \nMalik (Marouane)\tSeekNow\tLadder Assist \tN\tN\tChange and reschedule immediately if you have this guy. Drives big dark red pickup truck. Takes terrible photos, doesn't really want to talk to you, doesn't help mark anything and will just put CC for chalk. Gives attitude when you try to show him damage. Lied about doing this for 14 years. He's just money hungry so he wants to get out as soon as he can and doesn't give a f about helping with the inspection.",
  "textLength": 37346,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}