{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Sales Scripts /Contingency and Claim Authorization Script.docx",
  "name": "Contingency and Claim Authorization Script.docx",
  "type": "docx",
  "size": 237832,
  "relativePath": "Sales Scripts /Contingency and Claim Authorization Script.docx",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:00.241Z",
  "extractedText": "  \n\n\n\n\n\n \n\n\n\nContingency & Claim Authorization\n\nAfter the claim: “Okay, perfect! Like they said, an adjuster will be reaching out to you in the next 24 to 48 hours to schedule the inspection. The absolute most important part of this process is that I am at this inspection. Insurance companies don’t want to pay out. They are trying to mitigate their losses after storms. I am there as your representation to make sure you get a fair shake. \n\n\n\nTurn the iPad so you and the homeowner can see. \n\n\n\n\n\n“This basic/simple agreement backs you as the homeowner by guaranteeing you that your only cost will be your deductible if we get you fully approved. If it is a partial approval or denial, first we will fight and jump through the necessary hoops to turn that into a full approval; but if we are not able to get you fully approved, this contract is null and void and you do not owe us a penny.”\n\n\n\n“What’s in it for us, is we just want to get to do the work. This agreement commits you to using us if we hold up our end of the bargain and achieve a full-approval.”\n\n\n\nYou sign\n\n\n\nThey sign\n\n\n\n“This next form is our Claim Authorization form.  Very simple, it allows us to communicate with your insurance company.  I’ll be here for the inspection and  we will also communicate with them through email and phone calls so you don’t have to be a middle-man.  Of course, I’ll always keep you looped in with our communication by CCing you in all emails and updating you on any conversations we have.\n\n\n\nThey sign\n\n\n\nPress Submit enter password “roofer” if it asks.\n\n\n\n“Alright, we are all set! Again, the most important part of this process is that I am here when the insurance company comes out.  Ideally you can have them call me to schedule that directly. If they call me, great! But, regardless, please get the adjuster’s information (name, email, phone number) and send that over to me so that I can communicate with them before the inspection. If they insist on scheduling with you, go ahead and pencil in a time and avoid these times and days [provide your schedule]\n\n\n\nAnswer any questions that the HO may have\n\n\n\n“Thank you, sir/ma’am, looking forward to seeing you on the day of inspection, you have my contact information on my card if you need anything else.\n\n\n\n",
  "textLength": 2266,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}