{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Email Templates/Danny_s Repair Attempt Video Template.docx",
  "name": "Danny_s Repair Attempt Video Template.docx",
  "type": "docx",
  "size": 8413,
  "relativePath": "Email Templates/Danny_s Repair Attempt Video Template.docx",
  "category": "email_templates",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:24.008Z",
  "extractedText": "Use this template to Send to the Adjuster/Insurance when sending in your Repair Attempt Videos\n\n\n\n\n\nPLEASE REVIEW AND MAKE EDITS TO MAKE SURE THIS EMAIL FITS YOUR SPECIFIC SITUATION BEFORE YOU SEND IT \n\n\n\nPLEASE ATTACH CLAIM AUTHORIZATION AND MAKE SURE TO INCLUDE CLAIM # IN SUBJECT LINE\n\nEDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL INSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER.  EVERYTHING IN THE BRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\n\n\n\n\n\nTo whom it may concern,\n\n\n\nPlease see the attached video link and photo report of the attempted repair for the claim number [#_____]. As can be clearly seen in the video and pictures, the homeowner's roof sustained additional damage during the attempted repairs. This confirms a failed brittle test for the shingles, indicating irreparability.\n\n\n\nWith this fact established, your estimate as it currently stands would not actually fix the damages, but would in fact further compromise the integrity of the roof as a whole. Therefore I have gone ahead and attached an estimate below that accurately reflects the full scope of work necessary to make our mutual client whole again. \n\n\n\nYouTube Link:  \n\n\n\n↓[USE THIS PARAGRAPH ONLY IF YOU HAVE BEFORE AND AFTER PICTURES]↓\n\n\n\nI also ask that you take note of the before and after pictures of the attempted repair. Due to the brittleness of the roof in general, during the repair the two rows of shingles above the one we were attempting to replace sustained unavoidable mechanical creasing. These photos clearly demonstrate the brittleness of this roof, and moving forward with further patch repairs will inevitably do further damage to surrounding shingles.\n\n\n\n1. These can be seen in the updated photo report under the \"Brittle Test\" section, and best shown in Photos:(___)\n\n\n\nOR\n\n\n\n2. Please find these photos attached below.\n\n\n\n\n\nI kindly ask that you review these findings and revise your estimate/scope of work accordingly, so we can begin to move forward with the necessary full [Roof AND/OR Siding] replacement to restore our mutual client's property to pre-storm condition.\n\nIf we can provide any additional information, please don't hesitate to reach out.\n\nThank you for your time and for working with us to assist [HOMEOWNER’S NAME] in restoring their property effectively after the loss they have experienced.\n\n\n\n[YOUR SIGNATURE]\n\n\n\n",
  "textLength": 2369,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}