{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Licenses, Certifications, & General Liability Ins/Form W-9 (Rev. March 2024) (1).pdf",
  "name": "Form W-9 (Rev. March 2024) (1).pdf",
  "type": "pdf",
  "size": 86709,
  "relativePath": "Licenses, Certifications, & General Liability Ins/Form W-9 (Rev. March 2024) (1).pdf",
  "category": "certifications",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:59:36.553Z",
  "extractedText": "Form  W-9\n(Rev. March 2024)\nRequest for Taxpayer \nIdentification Number and Certification\nDepartment of the Treasury  \nInternal Revenue Service \nGo to www.irs.gov/FormW9 for instructions and the latest information.\nGive form to the  \nrequester. Do not \nsend to the IRS.\nBefore you begin. For guidance related to the purpose of Form W-9, see Purpose of Form, below.\nPrint or type. \nSee\n \nSpecific Instructions\n \non page 3.\n1    Name of entity/individual. An entry is required. (For a sole proprietor or disregarded entity, enter the owner’s name on line 1, and enter the business/disregarded \nentity’s name on line 2.)\n2    Business name/disregarded entity name, if different from above.\n3a  Check the appropriate box for federal tax classification of the entity/individual whose name is entered on line 1. Check \nonly one of the following seven boxes. \nIndividual/sole proprietorC corporationS corporationPartnershipTrust/estate\nLLC. Enter the tax classification (C = C corporation, S = S corporation, P = Partnership) ....\nNote: Check the “LLC” box above and, in the entry space, enter the appropriate code (C, S, or P) for the tax \nclassification of the LLC, unless it is a disregarded entity. A disregarded entity should instead check the appropriate \nbox for the tax classification of its owner.\nOther (see instructions) \n3b If on line 3a you checked “Partnership” or “Trust/estate,” or checked “LLC” and entered “P” as its tax classification, \nand you are providing this form to a  partnership, trust, or estate in which you have an ownership interest, check \nthis box if you have any foreign partners, owners, or beneficiaries. See instructions .........\n4  Exemptions (codes apply only to \ncertain entities, not individuals; \nsee instructions on page 3):\nExempt payee code (if any)\nExemption from Foreign Account Tax \nCompliance Act (FATCA) reporting \n code (if any)\n(Applies to accounts maintained \noutside the United States.)\n5    Address (number, street, and apt. or suite no.). See instructions.\n6    City, state, and ZIP code\nRequester’s name and address (optional)\n7    List account number(s) here (optional)\nPart ITaxpayer Identification Number (TIN)\nEnter your TIN in the appropriate box. The TIN provided must match the name given on line 1 to avoid \nbackup withholding. For individuals, this is generally your social security number (SSN). However, for a \nresident alien, sole proprietor, or disregarded entity, see the instructions for Part I, later. For other \nentities, it is your employer identification number (EIN). If you do not have a number, see How to get a \nTIN, later.\nNote: If the account is in more than one name, see the instructions for line 1. See also What Name and \nNumber To Give the Requester for guidelines on whose number to enter.\nSocial security number\n––\nor\nEmployer identification number \n–\nPart IICertification\nUnder penalties of perjury, I certify that:\n1. The number shown on this form is my correct taxpayer identification number (or I am waiting for a number to be issued to me); and\n2. I am not subject to backup withholding because (a) I am exempt from backup withholding, or (b) I have not been notified by the Internal Revenue \nService (IRS) that I am subject to backup withholding as a result of a failure to report all interest or dividends, or (c) the IRS has notified me that I am \nno longer subject to backup withholding; and\n3. I am a U.S. citizen or other U.S. person (defined below); and\n4. The FATCA code(s) entered on this form (if any) indicating that I am exempt from FATCA reporting is correct.\nCertification instructions. You must cross out item 2 above if you have been notified by the IRS that you are currently subject to backup withholding \nbecause you have failed to report all interest and dividends on your tax return. For real estate transactions, item 2 does not apply. For mortgage interest paid, \nacquisition or abandonment of secured property, cancellation of debt, contributions to an individual retirement arrangement (IRA), and, generally, payments \nother than interest and dividends, you are not required to sign the certification, but you must provide your correct TIN. See the instructions for Part II, later.\nSign \nHere\nSignature of \nU.S. personDate\nGeneral Instructions\nSection references are to the Internal Revenue Code unless otherwise \nnoted.\nFuture developments. For the latest information about developments \nrelated to Form W-9 and its instructions, such as legislation enacted \nafter they were published, go to www.irs.gov/FormW9.\nWhat’s New\nLine 3a has been modified to clarify how a disregarded entity completes \nthis line. An LLC that is a disregarded entity should check the \nappropriate box for the tax classification of its owner. Otherwise, it \nshould check the “LLC” box and enter its appropriate tax classification.\nNew line 3b has been added to this form. A flow-through entity is \nrequired to complete this line to indicate that it has direct or indirect \nforeign partners, owners, or beneficiaries when it provides the Form W-9 \nto another flow-through entity in which it has an ownership interest. This \nchange is intended to provide a flow-through entity with information \nregarding the status of its indirect foreign partners, owners, or \nbeneficiaries, so that it can satisfy any applicable reporting \nrequirements. For example, a partnership that has any indirect foreign \npartners may be required to complete Schedules K-2 and K-3. See the \nPartnership Instructions for Schedules K-2 and K-3 (Form 1065).\nPurpose of Form\nAn individual or entity (Form W-9 requester) who is required to file an \ninformation return with the IRS is giving you this form because they\nCat. No. 10231X\nForm W-9 (Rev. 3-2024)\nThe Roof Docs, LLC\nRoof-ER\n4\nS\n8100 Boone Blvd, Suite 400\nVienna, VA 22182\n832005914\n11/13/24\nFord Barsi, GM, RoofER\n\nForm W-9 (Rev. 3-2024)\nPage 2 \nmust obtain your correct taxpayer identification number (TIN), which \nmay be your social security number (SSN), individual taxpayer \nidentification number (ITIN), adoption taxpayer identification number \n(ATIN), or employer identification number (EIN), to report on an \ninformation return the amount paid to you, or other amount reportable \non an information return. Examples of information returns include, but \nare not limited to, the following.\n• Form 1099-INT (interest earned or paid).\n• Form 1099-DIV (dividends, including those from stocks or mutual \nfunds).\n• Form 1099-MISC (various types of income, prizes, awards, or gross \nproceeds).\n• Form 1099-NEC (nonemployee compensation).\n• Form 1099-B (stock or mutual fund sales and certain other \ntransactions by brokers).\n• Form 1099-S (proceeds from real estate transactions).\n• Form 1099-K (merchant card and third-party network transactions).\n• Form 1098 (home mortgage interest), 1098-E (student loan interest), \nand 1098-T (tuition).\n• Form 1099-C (canceled debt).\n• Form 1099-A (acquisition or abandonment of secured property).\nUse Form W-9 only if you are a U.S. person (including a resident \nalien), to provide your correct TIN. \nCaution: If you don’t return Form W-9 to the requester with a TIN, you \nmight be subject to backup withholding. See What is backup \nwithholding, later.\nBy signing the filled-out form, you: \n1. Certify that the TIN you are giving is correct (or you are waiting for a \nnumber to be issued);\n2. Certify that you are not subject to backup withholding; or\n3. Claim exemption from backup withholding if you are a U.S. exempt \npayee; and\n4. Certify to your non-foreign status for purposes of withholding under \nchapter 3 or 4 of the Code (if applicable); and\n5. Certify that FATCA code(s) entered on this form (if any) indicating \nthat you are exempt from the FATCA reporting is correct. See What Is \nFATCA Reporting, later, for further information.\nNote: If you are a U.S. person and a requester gives you a form other \nthan Form W-9 to request your TIN, you must use the requester’s form if \nit is substantially similar to this Form W-9.\nDefinition of a U.S. person. For federal tax purposes, you are \nconsidered a U.S. person if you are:\n• An individual who is a U.S. citizen or U.S. resident alien;\n• A partnership, corporation, company, or association created or \norganized in the United States or under the laws of the United States;\n• An estate (other than a foreign estate); or\n• A domestic trust (as defined in Regulations section 301.7701-7).\nEstablishing U.S. status for purposes of chapter 3 and chapter 4 \nwithholding. Payments made to foreign persons, including certain \ndistributions, allocations of income, or transfers of sales proceeds, may \nbe subject to withholding under chapter 3 or chapter 4 of the Code \n(sections 1441–1474). Under those rules, if a Form W-9 or other \ncertification of non-foreign status has not been received, a withholding \nagent, transferee, or partnership (payor) generally applies presumption \nrules that may require the payor to withhold applicable tax from the \nrecipient, owner, transferor, or partner (payee). See Pub. 515, \nWithholding of Tax on Nonresident Aliens and Foreign Entities.\nThe following persons must provide Form W-9 to the payor for \npurposes of establishing its non-foreign status.\n• In the case of a disregarded entity with a U.S. owner, the U.S. owner \nof the disregarded entity and not the disregarded entity.\n• In the case of a grantor trust with a U.S. grantor or other U.S. owner, \ngenerally, the U.S. grantor or other U.S. owner of the grantor trust and \nnot the grantor trust.\n• In the case of a U.S. trust (other than a grantor trust), the U.S. trust \nand not the beneficiaries of the trust.\nSee Pub. 515 for more information on providing a Form W-9 or a \ncertification of non-foreign status to avoid withholding.\nForeign person. If you are a foreign person or the U.S. branch of a \nforeign bank that has elected to be treated as a U.S. person (under \nRegulations section 1.1441-1(b)(2)(iv) or other applicable section for \nchapter 3 or 4 purposes), do not use Form W-9. Instead, use the \nappropriate Form W-8 or Form 8233 (see Pub. 515). If you are a \nqualified foreign pension fund under Regulations section 1.897(l)-1(d), or \na partnership that is wholly owned by qualified foreign pension funds, \nthat is treated as a non-foreign person for purposes of section 1445 \nwithholding, do not use Form W-9. Instead, use Form W-8EXP (or other \ncertification of non-foreign status).\nNonresident alien who becomes a resident alien. Generally, only a \nnonresident alien individual may use the terms of a tax treaty to reduce \nor eliminate U.S. tax on certain types of income. However, most tax \ntreaties contain a provision known as a saving clause. Exceptions \nspecified in the saving clause may permit an exemption from tax to \ncontinue for certain types of income even after the payee has otherwise \nbecome a U.S. resident alien for tax purposes.\nIf you are a U.S. resident alien who is relying on an exception \ncontained in the saving clause of a tax treaty to claim an exemption \nfrom U.S. tax on certain types of income, you must attach a statement \nto Form W-9 that specifies the following five items.\n1. The treaty country. Generally, this must be the same treaty under \nwhich you claimed exemption from tax as a nonresident alien.\n2. The treaty article addressing the income.\n3. The article number (or location) in the tax treaty that contains the \nsaving clause and its exceptions.\n4. The type and amount of income that qualifies for the exemption \nfrom tax.\n5. Sufficient facts to justify the exemption from tax under the terms of \nthe treaty article.\nExample. Article 20 of the U.S.-China income tax treaty allows an \nexemption from tax for scholarship income received by a Chinese \nstudent temporarily present in the United States. Under U.S. law, this \nstudent will become a resident alien for tax purposes if their stay in the \nUnited States exceeds 5 calendar years. However, paragraph 2 of the \nfirst Protocol to the U.S.-China treaty (dated April 30, 1984) allows the \nprovisions of Article 20 to continue to apply even after the Chinese \nstudent becomes a resident alien of the United States. A Chinese \nstudent who qualifies for this exception (under paragraph 2 of the first \nProtocol) and is relying on this exception to claim an exemption from tax \non their scholarship or fellowship income would attach to Form W-9 a \nstatement that includes the information described above to support that \nexemption.\nIf you are a nonresident alien or a foreign entity, give the requester the \nappropriate completed Form W-8 or Form 8233.\nBackup Withholding\nWhat is backup withholding? Persons making certain payments to you \nmust under certain conditions withhold and pay to the IRS 24% of such \npayments. This is called “backup withholding.” Payments that may be \nsubject to backup withholding include, but are not limited to, interest, \ntax-exempt interest, dividends, broker and barter exchange \ntransactions, rents, royalties, nonemployee pay, payments made in \nsettlement of payment card and third-party network transactions, and \ncertain payments from fishing boat operators. Real estate transactions \nare not subject to backup withholding.\nYou will not be subject to backup withholding on payments you receive \nif you give the requester your correct TIN, make the proper certifications, \nand report all your taxable interest and dividends on your tax return.\nPayments you receive will be subject to backup withholding if: \n1. You do not furnish your TIN to the requester;\n2. You do not certify your TIN when required (see the instructions for \nPart II for details);\n3. The IRS tells the requester that you furnished an incorrect TIN;\n4. The IRS tells you that you are subject to backup withholding \nbecause you did not report all your interest and dividends on your tax \nreturn (for reportable interest and dividends only); or\n5. You do not certify to the requester that you are not subject to \nbackup withholding, as described in item 4 under “By signing the filled-\nout form” above (for reportable interest and dividend accounts opened \nafter 1983 only).\n\nForm W-9 (Rev. 3-2024)\nPage 3 \nCertain payees and payments are exempt from backup withholding. \nSee Exempt payee code, later, and the separate Instructions for the \nRequester of Form W-9 for more information.\nSee also Establishing U.S. status for purposes of chapter 3 and \nchapter 4 withholding, earlier.\nWhat Is FATCA Reporting?\nThe Foreign Account Tax Compliance Act (FATCA) requires a \nparticipating foreign financial institution to report all U.S. account \nholders that are specified U.S. persons. Certain payees are exempt from \nFATCA reporting. See Exemption from FATCA reporting code, later, and \nthe Instructions for the Requester of Form W-9 for more information.\nUpdating Your Information\nYou must provide updated information to any person to whom you \nclaimed to be an exempt payee if you are no longer an exempt payee \nand anticipate receiving reportable payments in the future from this \nperson. For example, you may need to provide updated information if \nyou are a C corporation that elects to be an S corporation, or if you are \nno longer tax exempt. In addition, you must furnish a new Form W-9 if \nthe name or TIN changes for the account, for example, if the grantor of a \ngrantor trust dies.\nPenalties\nFailure to furnish TIN. If you fail to furnish your correct TIN to a \nrequester, you are subject to a penalty of $50 for each such failure \nunless your failure is due to reasonable cause and not to willful neglect.\nCivil penalty for false information with respect to withholding. If you \nmake a false statement with no reasonable basis that results in no \nbackup withholding, you are subject to a $500 penalty.\nCriminal penalty for falsifying information. Willfully falsifying \ncertifications or affirmations may subject you to criminal penalties \nincluding fines and/or imprisonment.\nMisuse of TINs. If the requester discloses or uses TINs in violation of \nfederal law, the requester may be subject to civil and criminal penalties.\nSpecific Instructions\nLine 1\nYou must enter one of the following on this line; do not leave this line \nblank. The name should match the name on your tax return.\nIf this Form W-9 is for a joint account (other than an account \nmaintained by a foreign financial institution (FFI)), list first, and then \ncircle, the name of the person or entity whose number you entered in \nPart I of Form W-9. If you are providing Form W-9 to an FFI to document \na joint account, each holder of the account that is a U.S. person must \nprovide a Form W-9.\n• Individual. Generally, enter the name shown on your tax return. If you \nhave changed your last name without informing the Social Security \nAdministration (SSA) of the name change, enter your first name, the last \nname as shown on your social security card, and your new last name.  \nNote for ITIN applicant: Enter your individual name as it was entered \non your Form W-7 application, line 1a. This should also be the same as \nthe name you entered on the Form 1040 you filed with your application.\n• Sole proprietor. Enter your individual name as shown on your Form \n1040 on line 1. Enter your business, trade, or “doing business as” (DBA) \nname on line 2.\n• Partnership, C corporation, S corporation, or LLC, other than a \ndisregarded entity. Enter the entity’s name as shown on the entity’s tax \nreturn on line 1 and any business, trade, or DBA name on line 2.\n• Other entities. Enter your name as shown on required U.S. federal tax \ndocuments on line 1. This name should match the name shown on the \ncharter or other legal document creating the entity. Enter any business, \ntrade, or DBA name on line 2.\n• Disregarded entity. In general, a business entity that has a single \nowner, including an LLC, and is not a corporation, is disregarded as an \nentity separate from its owner (a disregarded entity). See Regulations \nsection 301.7701-2(c)(2). A disregarded entity should check the \nappropriate box for the tax classification of its owner. Enter the owner’s \nname on line 1. The name of the owner entered on line 1 should never \nbe a disregarded entity. The name on line 1 should be the name shown \non the income tax return on which the income should be reported. For\nexample, if a foreign LLC that is treated as a disregarded entity for U.S. \nfederal tax purposes has a single owner that is a U.S. person, the U.S. \nowner’s name is required to be provided on line 1. If the direct owner of \nthe entity is also a disregarded entity, enter the first owner that is not \ndisregarded for federal tax purposes. Enter the disregarded entity’s \nname on line 2. If the owner of the disregarded entity is a foreign person, \nthe owner must complete an appropriate Form W-8 instead of a Form \nW-9.  This is the case even if the foreign person has a U.S. TIN. \nLine 2\nIf you have a business name, trade name, DBA name, or disregarded \nentity name, enter it on line 2.\nLine 3a\nCheck the appropriate box on line 3a for the U.S. federal tax \nclassification of the person whose name is entered on line 1. Check only \none box on line 3a.\nIF the entity/individual on line 1 \nis a(n) . . .\nTHEN check the box for . . .\n•  CorporationCorporation.\n•  Individual or \n•  Sole proprietorship\nIndividual/sole proprietor.\n•  LLC classified as a partnership \nfor U.S. federal tax purposes or \n•  LLC that has filed Form 8832 or \n2553 electing to be taxed as a \ncorporation\nLimited liability company and \nenter the appropriate tax \nclassification:  \nP = Partnership, \nC = C corporation, or \nS = S corporation.\n•  PartnershipPartnership.\n•  Trust/estateTrust/estate.\nLine 3b\nCheck this box if you are a partnership (including an LLC classified as a \npartnership for U.S. federal tax purposes), trust, or estate that has any \nforeign partners, owners, or beneficiaries, and you are providing this \nform to a partnership, trust, or estate, in which you have an ownership \ninterest. You must check the box on line 3b if you receive a Form W-8 \n(or documentary evidence) from any partner, owner, or beneficiary \nestablishing foreign status or if you receive a Form W-9 from any \npartner, owner, or beneficiary that has checked the box on line 3b.\nNote: A partnership that provides a Form W-9 and checks box 3b may \nbe required to complete Schedules K-2 and K-3 (Form 1065). For more \ninformation, see the Partnership Instructions for Schedules K-2 and K-3 \n(Form 1065).\nIf you are required to complete line 3b but fail to do so, you may not \nreceive the information necessary to file a correct information return with \nthe IRS or furnish a correct payee statement to your partners or \nbeneficiaries. See, for example, sections 6698, 6722, and 6724 for \npenalties that may apply.\nLine 4 Exemptions\nIf you are exempt from backup withholding and/or FATCA reporting, \nenter in the appropriate space on line 4 any code(s) that may apply to \nyou.\nExempt payee code.\n•  Generally, individuals (including sole proprietors) are not exempt from \nbackup withholding.\n•  Except as provided below, corporations are exempt from backup \nwithholding for certain payments, including interest and dividends.\n•  Corporations are not exempt from backup withholding for payments \nmade in settlement of payment card or third-party network transactions.\n•  Corporations are not exempt from backup withholding with respect to \nattorneys’ fees or gross proceeds paid to attorneys, and corporations \nthat provide medical or health care services are not exempt with respect \nto payments reportable on Form 1099-MISC.\nThe following codes identify payees that are exempt from backup \nwithholding. Enter the appropriate code in the space on line 4.\n1—An organization exempt from tax under section 501(a), any IRA, or \na custodial account under section 403(b)(7) if the account satisfies the \nrequirements of section 401(f)(2).\n\nForm W-9 (Rev. 3-2024)\nPage 4 \n2—The United States or any of its agencies or instrumentalities.\n3—A state, the District of Columbia, a U.S. commonwealth or territory, \nor any of their political subdivisions or instrumentalities.\n4—A foreign government or any of its political subdivisions, agencies, \nor instrumentalities.\n5—A corporation.\n6—A dealer in securities or commodities required to register in the \nUnited States, the District of Columbia, or a U.S. commonwealth or \nterritory.\n7—A futures commission merchant registered with the Commodity \nFutures Trading Commission.\n8—A real estate investment trust.\n9—An entity registered at all times during the tax year under the \nInvestment Company Act of 1940.\n10—A common trust fund operated by a bank under section 584(a).\n11—A financial institution as defined under section 581.\n12—A middleman known in the investment community as a nominee or \ncustodian.\n13—A trust exempt from tax under section 664 or described in section \n4947.\nThe following chart shows types of payments that may be exempt \nfrom backup withholding. The chart applies to the exempt payees listed \nabove, 1 through 13.\nIF the payment is for . . .THEN the payment is exempt \nfor . . .\n•  Interest and dividend paymentsAll exempt payees except \nfor 7.\n•  Broker transactionsExempt payees 1 through 4 and 6 \nthrough 11 and all C corporations. \nS corporations must not enter an \nexempt payee code because they \nare exempt only for sales of \nnoncovered securities acquired \nprior to 2012.\n•  Barter exchange transactions \nand patronage dividends\nExempt payees 1 through 4.\n•  Payments over $600 required to \nbe reported and direct sales over \n$5,000\n1\nGenerally, exempt payees \n1 through 5.\n2\n•  Payments made in settlement of \npayment card or third-party \nnetwork transactions\nExempt payees 1 through 4.\n1\n See Form 1099-MISC, Miscellaneous Information, and its instructions.\n2\n However, the following payments made to a corporation and  \nreportable on Form 1099-MISC are not exempt from backup \nwithholding: medical and health care payments, attorneys’ fees, gross \nproceeds paid to an attorney reportable under section 6045(f), and \npayments for services paid by a federal executive agency.\nExemption from FATCA reporting code. The following codes identify \npayees that are exempt from reporting under FATCA. These codes \napply to persons submitting this form for accounts maintained outside \nof the United States by certain foreign financial institutions. Therefore, if \nyou are only submitting this form for an account you hold in the United \nStates, you may leave this field blank. Consult with the person \nrequesting this form if you are uncertain if the financial institution is \nsubject to these requirements. A requester may indicate that a code is \nnot required by providing you with a Form W-9 with “Not Applicable” (or \nany similar indication) entered on the line for a FATCA exemption code.\nA—An organization exempt from tax under section 501(a) or any \nindividual retirement plan as defined in section 7701(a)(37).\nB—The United States or any of its agencies or instrumentalities.\nC—A state, the District of Columbia, a U.S. commonwealth or \nterritory, or any of their political subdivisions or instrumentalities.\nD—A corporation the stock of which is regularly traded on one or \nmore established securities markets, as described in Regulations \nsection 1.1472-1(c)(1)(i).\nE—A corporation that is a member of the same expanded affiliated \ngroup as a corporation described in Regulations section 1.1472-1(c)(1)(i).\nF—A dealer in securities, commodities, or derivative financial \ninstruments (including notional principal contracts, futures, forwards, \nand options) that is registered as such under the laws of the United \nStates or any state.\nG—A real estate investment trust.\nH—A regulated investment company as defined in section 851 or an \nentity registered at all times during the tax year under the Investment \nCompany Act of 1940.\nI—A common trust fund as defined in section 584(a).\nJ—A bank as defined in section 581.\nK—A broker.\nL—A trust exempt from tax under section 664 or described in section \n4947(a)(1).\nM—A tax-exempt trust under a section 403(b) plan or section 457(g) \nplan.\nNote: You may wish to consult with the financial institution requesting \nthis form to determine whether the FATCA code and/or exempt payee \ncode should be completed.\nLine 5\nEnter your address (number, street, and apartment or suite number). \nThis is where the requester of this Form W-9 will mail your information \nreturns. If this address differs from the one the requester already has on \nfile, enter “NEW” at the top. If a new address is provided, there is still a \nchance the old address will be used until the payor changes your \naddress in their records.\nLine 6\nEnter your city, state, and ZIP code.\nPart I. Taxpayer Identification Number (TIN)\nEnter your TIN in the appropriate box. If you are a resident alien and \nyou do not have, and are not eligible to get, an SSN, your TIN is your \nIRS ITIN. Enter it in the entry space for the Social security number. If you \ndo not have an ITIN, see How to get a TIN below.\nIf you are a sole proprietor and you have an EIN, you may enter either \nyour SSN or EIN. \nIf you are a single-member LLC that is disregarded as an entity \nseparate from its owner, enter the owner’s SSN (or EIN, if the owner has \none). If the LLC is classified as a corporation or partnership, enter the \nentity’s EIN.\nNote: See What Name and Number To Give the Requester, later, for \nfurther clarification of name and TIN combinations.\nHow to get a TIN. If you do not have a TIN, apply for one immediately. \nTo apply for an SSN, get Form SS-5, Application for a Social Security \nCard, from your local SSA office or get this form online at \nwww.SSA.gov. You may also get this form by calling 800-772-1213. Use \nForm W-7, Application for IRS Individual Taxpayer Identification \nNumber, to apply for an ITIN, or Form SS-4, Application for Employer \nIdentification Number, to apply for an EIN. You can apply for an EIN \nonline by accessing the IRS website at www.irs.gov/EIN. Go to \nwww.irs.gov/Forms to view, download, or print Form W-7 and/or Form \nSS-4. Or, you can go to www.irs.gov/OrderForms to place an order and \nhave Form W-7 and/or Form SS-4 mailed to you within 15 business \ndays.\nIf you are asked to complete Form W-9 but do not have a TIN, apply \nfor a TIN and enter “Applied For” in the space for the TIN, sign and date \nthe form, and give it to the requester. For interest and dividend \npayments, and certain payments made with respect to readily tradable \ninstruments, you will generally have 60 days to get a TIN and give it to \nthe requester before you are subject to backup withholding on \npayments. The 60-day rule does not apply to other types of payments. \nYou will be subject to backup withholding on all such payments until \nyou provide your TIN to the requester.\nNote: Entering “Applied For” means that you have already applied for a \nTIN or that you intend to apply for one soon. See also Establishing U.S. \nstatus for purposes of chapter 3 and chapter 4 withholding, earlier, for \nwhen you may instead be subject to withholding under chapter 3 or 4 of \nthe Code.\nCaution: A disregarded U.S. entity that has a foreign owner must use \nthe appropriate Form W-8.\n\nForm W-9 (Rev. 3-2024)\nPage 5 \nPart II. Certification\nTo establish to the withholding agent that you are a U.S. person, or \nresident alien, sign Form W-9. You may be requested to sign by the \nwithholding agent even if item 1, 4, or 5 below indicates otherwise.\nFor a joint account, only the person whose TIN is shown in Part I \nshould sign (when required). In the case of a disregarded entity, the \nperson identified on line 1 must sign. Exempt payees, see Exempt payee \ncode, earlier.\nSignature requirements. Complete the certification as indicated in \nitems 1 through 5 below.\n1. Interest, dividend, and barter exchange accounts opened \nbefore 1984 and broker accounts considered active during 1983. \nYou must give your correct TIN, but you do not have to sign the \ncertification.\n2. Interest, dividend, broker, and barter exchange accounts \nopened after 1983 and broker accounts considered inactive during \n1983. You must sign the certification or backup withholding will apply. If \nyou are subject to backup withholding and you are merely providing \nyour correct TIN to the requester, you must cross out item 2 in the \ncertification before signing the form.\n3. Real estate transactions. You must sign the certification. You may \ncross out item 2 of the certification.\n4. Other payments. You must give your correct TIN, but you do not \nhave to sign the certification unless you have been notified that you \nhave previously given an incorrect TIN. “Other payments” include \npayments made in the course of the requester’s trade or business for \nrents, royalties, goods (other than bills for merchandise), medical and \nhealth care services (including payments to corporations), payments to \na nonemployee for services, payments made in settlement of payment \ncard and third-party network transactions, payments to certain fishing \nboat crew members and fishermen, and gross proceeds paid to \nattorneys (including payments to corporations).  \n5. Mortgage interest paid by you, acquisition or abandonment of \nsecured property, cancellation of debt, qualified tuition program \npayments (under section 529), ABLE accounts (under section 529A), \nIRA, Coverdell ESA, Archer MSA or HSA contributions or \ndistributions, and pension distributions. You must give your correct \nTIN, but you do not have to sign the certification.\nWhat Name and Number To Give the Requester\nFor this type of account:Give name and SSN of:\n1. IndividualThe individual\n2. Two or more individuals (joint account) \nother than an account maintained by \nan FFI\nThe actual owner of the account or, \nif combined funds, the first individual \non the account\n1\n3. Two or more U.S. persons \n    (joint account maintained by an FFI)\nEach holder of the account \n4. Custodial account of a minor \n(Uniform Gift to Minors Act)\nThe minor\n2\n5. a. The usual revocable savings trust \n(grantor is also trustee)\nThe grantor-trustee\n1\nb. So-called trust account that is not  \na legal or valid trust under state law\nThe actual owner\n1\n6. Sole proprietorship or disregarded \nentity owned by an individual\nThe owner\n3\n7. Grantor trust filing under Optional \nFiling Method 1 (see Regulations \nsection 1.671-4(b)(2)(i)(A))**\nThe grantor*\nFor this type of account:Give name and EIN of:\n8. Disregarded entity not owned by an \nindividual\nThe owner\n9. A valid trust, estate, or pension trust\nLegal entity\n4\n10. Corporation or LLC electing corporate \nstatus on Form 8832 or Form 2553\nThe corporation\n11. Association, club, religious, charitable, \neducational, or other tax-exempt \norganization\nThe organization\n12. Partnership or multi-member LLC\nThe partnership\n13. A broker or registered nominee\nThe broker or nominee\n14. Account with the Department of \nAgriculture in the name of a public \nentity (such as a state or local \ngovernment, school district, or prison) \nthat receives agricultural program \npayments\nThe public entity\n15. Grantor trust filing Form 1041 or \nunder the Optional Filing Method 2, \nrequiring Form 1099 (see Regulations \nsection 1.671-4(b)(2)(i)(B))**\nThe trust\n1\n List first and circle the name of the person whose number you furnish.  \nIf only one person on a joint account has an SSN, that person’s number \nmust be furnished.\n2\n Circle the minor’s name and furnish the minor’s SSN.\n3\n You must show your individual name on line 1, and enter your business \nor DBA name, if any, on line 2. You may use either your SSN or EIN (if \nyou have one), but the IRS encourages you to use your SSN.\n4\n List first and circle the name of the trust, estate, or pension trust. (Do  \nnot furnish the TIN of the personal representative or trustee unless the \nlegal entity itself is not designated in the account title.) \n*\n Note: The grantor must also provide a Form W-9 to the trustee of the \ntrust.\n** For more information on optional filing methods for grantor trusts, see \nthe Instructions for Form 1041.\nNote: If no name is circled when more than one name is listed, the \nnumber will be considered to be that of the first name listed.\nSecure Your Tax Records From Identity Theft\nIdentity theft occurs when someone uses your personal information, \nsuch as your name, SSN, or other identifying information, without your \npermission to commit fraud or other crimes. An identity thief may use \nyour SSN to get a job or may file a tax return using your SSN to receive \na refund.\nTo reduce your risk:\n• Protect your SSN,\n• Ensure your employer is protecting your SSN, and\n• Be careful when choosing a tax return preparer.\nIf your tax records are affected by identity theft and you receive a \nnotice from the IRS, respond right away to the name and phone number \nprinted on the IRS notice or letter.\nIf your tax records are not currently affected by identity theft but you \nthink you are at risk due to a lost or stolen purse or wallet, questionable \ncredit card activity, or a questionable credit report, contact the IRS \nIdentity Theft Hotline at 800-908-4490 or submit Form 14039.\nFor more information, see Pub. 5027, Identity Theft Information for \nTaxpayers.\n\nForm W-9 (Rev. 3-2024)\nPage 6 \nVictims of identity theft who are experiencing economic harm or a \nsystemic problem, or are seeking help in resolving tax problems that \nhave not been resolved through normal channels, may be eligible for \nTaxpayer Advocate Service (TAS) assistance. You can reach TAS by \ncalling the TAS toll-free case intake line at 877-777-4778 or TTY/TDD \n800-829-4059.\nProtect yourself from suspicious emails or phishing schemes.  \nPhishing is the creation and use of email and websites designed to \nmimic legitimate business emails and websites. The most common act \nis sending an email to a user falsely claiming to be an established \nlegitimate enterprise in an attempt to scam the user into surrendering \nprivate information that will be used for identity theft.\nThe IRS does not initiate contacts with taxpayers via emails. Also, the \nIRS does not request personal detailed information through email or ask \ntaxpayers for the PIN numbers, passwords, or similar secret access \ninformation for their credit card, bank, or other financial accounts.\nIf you receive an unsolicited email claiming to be from the IRS, \nforward this message to phishing@irs.gov. You may also report misuse \nof the IRS name, logo, or other IRS property to the Treasury Inspector \nGeneral for Tax Administration (TIGTA) at 800-366-4484. You can \nforward suspicious emails to the Federal Trade Commission at \nspam@uce.gov or report them at www.ftc.gov/complaint. You can \ncontact the FTC at www.ftc.gov/idtheft or 877-IDTHEFT (877-438-4338). \nIf you have been the victim of identity theft, see www.IdentityTheft.gov \nand Pub. 5027.\nGo to www.irs.gov/IdentityTheft to learn more about identity theft and \nhow to reduce your risk.\nPrivacy Act Notice\nSection 6109 of the Internal Revenue Code requires you to provide your \ncorrect TIN to persons (including federal agencies) who are required to \nfile information returns with the IRS to report interest, dividends, or \ncertain other income paid to you; mortgage interest you paid; the \nacquisition or abandonment of secured property; the cancellation of \ndebt; or contributions you made to an IRA, Archer MSA, or HSA. The \nperson collecting this form uses the information on the form to file \ninformation returns with the IRS, reporting the above information. \nRoutine uses of this information include giving it to the Department of \nJustice for civil and criminal litigation and to cities, states, the District of \nColumbia, and U.S. commonwealths and territories for use in \nadministering their laws. The information may also be disclosed to other \ncountries under a treaty, to federal and state agencies to enforce civil \nand criminal laws, or to federal law enforcement and intelligence \nagencies to combat terrorism. You must provide your TIN whether or not \nyou are required to file a tax return. Under section 3406, payors must \ngenerally withhold a percentage of taxable interest, dividends, and \ncertain other payments to a payee who does not give a TIN to the payor. \nCertain penalties may also apply for providing false or fraudulent \ninformation.",
  "textLength": 38294,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}