{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Sales Scripts /Full Approval Estimate Phone Call.docx",
  "name": "Full Approval Estimate Phone Call.docx",
  "type": "docx",
  "size": 8337,
  "relativePath": "Sales Scripts /Full Approval Estimate Phone Call.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:01.248Z",
  "extractedText": "Full Approval Estimate Phone Call\n\n\n\n\n\nThis is the call you will make to your HO as soon as you receive the estimate\n\n\n\n\n\n“Hello sir/ma’am! It’s [YOUR NAME] with Roof ER. Congratulations, I am glad we were able to ensure that your insurance company fully approved your roof/siding/gutters/etc replacement!\n\n\n\n“So the next steps are, as I mentioned last time we met:\n\n“One of our Project Coordinators will be reaching out to you to schedule a Project Meeting to go over your full scope of work.\n\n“Based on the estimate, your insurance company will be sending you [ACV AMOUNT] shortly.  This will be used as your down payment.  With that, we can start all of your work! When they send you that check, just hold on to it until your meeting with our Project Coordinator who will help with all the next steps.\n\n“Our estimating team will also be sending in supplements to the insurance company based on items they may have missed. This includes Code Items such as IWS and Drip Edge. And don’t worry! Even if for some reason they do not approve these amounts, we will still do all the necessary work and never charge you for it.  As we talked about earlier, your only cost out of this will be your deductible once we finish all the work.\n\n“Upon completion of the installation, we will review and inspect all of our work to ensure it is to your satisfaction.  Then we will send in a completion form once you sign off on the complete project.  That’s when the insurance company will release the remaining funds minus your deductible.  So your final payment will only be those funds plus your deductible.\n\n“Any questions so far, sir/ma’am?”\n\n\n\nAnswer any questions\n\n\n\n“Great! Again, I am glad that we were able to make this happen for you, now you get to experience the quality that Roof ER always delivers, at only the cost of your deductible after your whole project is complete!” Potentially mention additional work that they may want to add.\n\n\n\nAnswer any additional questions or engage in any conversation the HO starts.\n\n\n\n“Also, if you know anyone else that I can help, have them reach out to me! You have my card - they can call, text, or email me and I can inspect their property to see if they have the same qualifying damage and I can walk them through the same process I have walked you through!\n\n\n\nEngage in any conversation that this starts\n\n“Awesome!\n\nIf you haven’t already put up a yard sign: “Would you mind if I put up a yard sign next time I’m in your area? This will definitely help other companies already know that you’re working with someone and hopefully eliminate anyone else from knocking your door asking about your roof/siding.”\n\n“Look out for the communication from one of our Project Coordinators so you can get that Project Meeting scheduled to go over all the next steps and your full scope of work.  Congratulations again and have a great day!”\n\n",
  "textLength": 2870,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}