{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Insurance Argument Resources/GAF Storm Damage Guidelines .pdf",
  "name": "GAF Storm Damage Guidelines .pdf",
  "type": "pdf",
  "size": 340645,
  "relativePath": "Insurance Argument Resources/GAF Storm Damage Guidelines .pdf",
  "category": "pushback_strategies",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:59:05.859Z",
  "extractedText": "Residentia\nl\n \n \n                                                                                                              \n \n \n \nWhat Are Some Causes For \n“Storm Damage” To \nShingles? \nDamage to shingles caused by extraordinary weather conditions such as hurricanes, hail, tornadoes, lightning, \nwinds higher than warranted, or cold-weather related damages such as ice-damming.                                \nDoes The GAF Shingle \nLimited Warranty Cover \nThis Type Of Damage? \nExtraordinary weather related damages as described above are specifically excluded from coverage*.  This \ndamage may be immediately noticeable, or can be latent damage in which case evidence of any damage may \nnot be immediately apparent.  This latent damage caused by severe weather or flying debris may cause the \nshingles to deteriorate prematurely. \n \n*Some GAF shingles are warranted to withstand winds up to 130 mph following when using GAF \nWeatherBlocker™ or Pro-Start™ starter strips and 6 (or more) nails. \nWhat Are Some Examples \nOf Latent Damage That I \nCould Expect To See? \nLatent damage may take on many forms such as: \n Granule loss at points of impact of debris or caused by stresses the shingles endure \n Cracks in the granule-asphalt surfacing – especially if high winds blew the shingles back \n Exposed fiberglass mat – which may or may not be immediately visible \n Loosening of the self-seal integrity creating the potential for future shingle blow-off \nWhat If I have Granule Loss \nConcerns? \nLoss of mineral granules as an immediate or gradual consequence of storm damage exposes the asphalt \ncoating directly to the environment.  This granule loss may result in the accelerated aging and the premature \ndeterioration of the shingles.   \n \nAny shingle failures caused by storm damage, immediate or as a result of latent damage, is beyond the scope \nof the GAF Shingle Limited Warranty, and is not be the responsibility of GAF.   \n \nNote: Granule loss is NOT just cosmetic damage and “sugaring,” the process of adding loose granules to \ndamaged shingle with asphalt cement, is not a permanent repair. \nIs There Anything Else To \nBe Aware Of? \n“Blue Tarped Roofs”:  As immediately effective as tarping a damaged roof is to protect the building, securing \nthe tarp by nailing through the shingles damages the shingles.  Shingles that were nailed through must be \nreplaced; caulking these nail holes is not a permanent repair and creates a maintenance item that is not a \n“material defect” covered by a manufacturer’s warranty. \nCan Several Individual \nShingles Be Replaced Or \nShould The Entire Roof Be \nReplaced? \nWhile individual damaged shingles on a roof can be replaced, it generally is not recommended if there are \nmore than 2 or 3 damaged shingles on a roof or a plane (section) of the roof because the process of replacing \nindividual shingles requires breaking the self-seal of the surrounding shingles, removing their nails, and \nbending them to remove the damaged shingles and then re-fastening them ... all of which can damage the \nshingles if not done properly.  In addition, the color of new shingles inserted will not match the color of the \nshingles that have weathered for even a few years.   \n \nFor long term performance as well as aesthetic reasons, complete replacement is recommended for roofs \nthat have a significant number of shingles that need to be replaced due to storm damage.  An additional \nbenefit to complete replacement is the ability of the roofing professional to check for latent damage – \nsomething that is difficult to do if just a few shingles are replaced. If the damage is confined to one plane of \nthe roof, replacement of the just the damaged roof plane may be possible. \nWhere Can I Get More \nInformation? \nGAF Technical Services can assist you... with these and other questions you may have regarding your new roof \ninstallation.  GAF Technical Services can be contacted at 800-ROOF-411 (800-766-3411).  Also, the GAF \nwebsite is a great resource for just about any question you may have or for additional information you may \nrequire.  Please visit:  www.gaf.com.  \n \n \nTo: GAF Residential Sales, GAF Contractors, GAF Field Services \nFrom: Technical Services Department \nDate: 05/27/2011 \nSubject: Replacement Of Storm Damaged Shingles \n \nT\nT\nT\nE\nE\nE\nC\nC\nC\nH\nH\nH\nN\nN\nN\nI\nI\nI\nC\nC\nC\nA\nA\nA\nL\nL\nL\n \n \n \nA\nA\nA\nD\nD\nD\nV\nV\nV\nI\nI\nI\nS\nS\nS\nO\nO\nO\nR\nR\nR\nY\nY\nY\n \n \n \nB\nB\nB\nU\nU\nU\nL\nL\nL\nL\nL\nL\nE\nE\nE\nT\nT\nT\nI\nI\nI\nN\nN\nN\n \n \n \n \n \nNo: TAB-R 2011-126",
  "textLength": 4483,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}