{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Customer Resources(Products, Warranties, etc.)/GAF Standard Warranty.pdf",
  "name": "GAF Standard Warranty.pdf",
  "type": "pdf",
  "size": 286533,
  "relativePath": "Customer Resources(Products, Warranties, etc.)/GAF Standard Warranty.pdf",
  "category": "warranties",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:02.753Z",
  "extractedText": "Congratulations! Thank you for purchasing asphaltic shingles and/or accessories from GAF, North America’s largest roofing manufacturer — your best choice. While many factors  \ncan affect how long your shingles and accessories will last, this GAF Shingle & Accessory Limited Warranty covers your asphaltic shingles and accessories, including GAF Ridge Cap \nShingles, GAF Starter Strip Shingles, GAF Leak Barrier Products, GAF Roof Deck Protection Products, and GAF Cobra\n®\n Ventilation Products (the \"GAF Products\"), in the unlikely event  \nthat they contain a manufacturing defect. It provides great coverage that is “non-prorated” during the crucial up-front period of your ownership (the \"Smart Choice\n®\n Protection Period\") \nwith continued coverage for extended periods of time afterwards. Note: This limited warranty does not cover low-slope membranes or Master Flow\n®\n Ventilation Products. Please go to \ngaf.com for a copy of the limited warranties covering these products.\nHow Long Your Warranty Lasts\nGAF Shingles\nManufacturing Defect CoverageWind Warranty CoverageAlgae Warranty Coverage\nLimited \nWarranty Term\nSmart Choice\n®\n \nProtection Period**\nLimited \nWarranty Term\nWind Speed Coverage \n(mph / km/h)\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection Period**\nTimberline\n®\n UHDZ\n™\nLifetime\n†\n10 Years15 Ye a r s\nWith Special \nInstallation***: 130/209\nWithout Special \nInstallation***: 110/175\nStainGuard Plus PRO\n™\n: \n30 Years\nStainGuard Plus PRO\n™\n: \n10 Years\nAll Other GAF Lifetime\n†\n  \nRoofing Shingles\nLifetime\n†\n10 Years15 Ye a r s\nWith Special \nInstallation***: 130/209\nWithout Special \nInstallation***: 110/175\nStainGuard Plus\n™\n:  \n25 Years\nStainGuard\n®\n:  \n10 Years\nStainGuard Plus\n™\n: \n10 Years\nStainGuard\n®\n:  \n1 Year\nMarquis WeatherMax\n®\n30 Years5 Years5 Years8 0 / 13 0No coverageNo coverage\nRoyal Sovereign\n®\n25 Years5 Years5 Years60/96\nStainGuard\n®\n:  \n10 Years\nStainGuard\n®\n:  \n1 Year\nGAF Accessories\n*\nManufacturing Defect Coverage\nWind Warranty CoverageAlgae Warranty Coverage\nLimited \nWarranty Term\nSmart Choice\n®\n \nProtection Period**\nIf you install less than 3 GAF \nAccessories* and Lifetime\n†\n Shingles\n40 Years5 Years\nCoverage only available for “GAF Ridge \nCap Shingles” (see below)\nNo coverage for other GAF Accessories*\nCoverage only available for “GAF Ridge \nCap Shingles and Starter Strip Shingles”  \n(see below)\nNo coverage for other GAF Accessories*\nIf you do not install Shingles that \ncarry a Lifetime\n†\n Limited Warranty\n25 Years5 Years\nGAF Ridge Cap Shingles\n*\nManufacturing Defect Coverage\nWind Warranty CoverageAlgae Warranty Coverage\nLimited \nWarranty Term\nWind Speed Coverage \n(mph / km/h)\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection Period**\nTimberTex\n®\n, Ridglass\n®\n, and \nTimberCrest\n®\nSee “GAF Accessories*” section above15 Ye a r s\nWith Special \nInstallation***: 130/209\nWithout Special \nInstallation***: 110/175\nStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus\n™\n:  \n10 Years\nSeal-A-Ridge\n® \n, Seal-A-Ridge\n®\nAS\nSee “GAF Accessories*” section above5 Years9 0 / 14 4\nStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus\n™\n:  \n10 Years\nZ\n®\nRidge\nSee “GAF Accessories*” section above\n5 Years\nWith Special \nInstallation***: 90/144\nWithout Special \nInstallation***: 70/112\nStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus\n™\n:  \n10 Years\nGAF Starter Strip Shingles\nManufacturing Defect Coverage\nWind Warranty CoverageAlgae Warranty Coverage\nLimited \nWarranty Term\nWind Speed Coverage \n(mph / km/h)\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection Period**\nStarterMatch\n®\nSee “GAF Accessories*” section above\nNo coverageNo coverage\nStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus\n™\n: \n10 Years\n      †  Definition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred during the Smart Choice\n®\n Protection Period], own the property where the shingles are \ninstalled. The Lifetime\n†\n warranty is applicable only to shingles installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, governmental entity, religious entity, \ncondominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years.\n      *   GAF Accessories covered under this limited warranty include: GAF Ridge Cap Shingles, GAF Starter Strip Shingles, GAF Leak Barrier Products, GAF Roof Deck Protection Products, and GAF Cobra\n®\n Ventilation Products. If you install 3 or \nmore GAF Accessories and shingles that carry a Lifetime\n†\n Limited Warranty, you are eligible for enhanced coverage on your qualifying GAF Accessory Products. Please refer to the GAF Roofing System Limited Warranty, available on gaf.com, for \ncomplete coverage and restrictions. \n    **    Smart Choice\n®\n Protection Period: refers to the crucial period of time following installation of the GAF Products during which the coverage provided for in this limited warranty is non-prorated. After the Smart Choice\n®\n Protection Period \nspecified above, the remedy provided for in this warranty may be different than that provided for during the Smart Choice\n®\n Protection Period, and any remedy will be reduced to reflect the use you have received from your GAF Products.\n  ***    Special Installation: Your GAF LayerLock\n®\n-labeled Shingles will be covered up to the maximum wind speed above ONLY if installed using 4 nails per shingle and you have GAF Starter Strip Products installed at the eaves and rakes. Special \nInstallation for all other GAF Shingles requires use of 6 nails per shingle and GAF Starter Strip Products installed at the eaves and rakes. Your GAF Ridge Cap Shingles will be covered up to the maximum wind speed above ONLY if your ridge cap \nshingles are installed in strict accordance with the “Maximum Wind Speed Coverage Under Limited Warranty” section of the applicable ridge cap shingle application instructions.\nWho Is Covered by This Limited Warranty; Transferability \nYou are covered by this limited warranty if you live in the United States or Canada and are the original property owner (i.e., not a builder or installer) or the first subsequent owner if this \nwarranty was properly transferred.\nThis limited warranty may be transferred only once. The second owner must notify GAF in writing within one year after the property transfer for warranty coverage to be transferred. (Other \nthan this one transfer, this warranty may not be transferred or assigned, directly or indirectly.) If the transfer takes place within the Smart Choice\n®\n Protection Period, the second owner is \nentitled to the same coverage as the original owner. If the transfer takes place afterwards, the length of this warranty shall be reduced to the two-year period after the ownership changes. If \nthere is a defect during this two-year period, GAF’s reimbursement to the second owner will be based only on the reasonable cost of replacement shingles or applicable accessories, reduced \nby the amount of use that has been received from the shingles or applicable accessories from the date of installation through the date of claim.\nManufacturing Defects: What Is Covered/Sole and Exclusive Remedy \nGAF Warranty Company, LLC, a subsidiary of GAF, warrants that your GAF Roofing Shingles will remain free from manufacturing defects that adversely affect their performance during \nthe applicable Smart Choice\n®\n Protection Period or that cause leaks for the remainder of the applicable warranty term and that your GAF Accessory Products will remain free from \nmanufacturing defects that adversely affect their performance during the applicable warranty term. Note: Wind Warranty and Algae Warranty are covered separately below.\n(1) During the Smart Choice\n®\n Protection Period: GAF will pay you the full reasonable cost of labor to repair or re-cover any defective GAF Products (excluding non-GAF accessories, \nmetalwork, or flashing) and will provide replacement GAF Products or the reasonable cost of obtaining replacement GAF Products, at GAF’s option. GAF will not pay to tear off your GAF \nProducts, or to dispose of them.\n(2) After the Smart Choice\n®\n Protection Period: Labor will no longer be covered. GAF’s contribution to you will be based on either providing you with replacement GAF Products or, at \nGAF’s choice, reimbursing you for the reasonable cost of replacement GAF Products. The amount of replacement GAF Products or reimbursement provided to you will be reduced to reflect \nthe use you have received from your GAF Products. The amount of use will be calculated by dividing the number of months which have elapsed since installation to the date of claim by the \nnumber of months in the warranty term. For a Lifetime\n†\n warranty, the number of months in the warranty term is deemed to be 600 for years 11–40 of the warranty term. For years 41 and \nbeyond of a Lifetime\n†\n warranty, GAF’s contribution is 20%. For example, if you make a claim for Lifetime\n†\n Shingles installed on a single-family home after your shingles have been installed \nfor 25 years (300 months), GAF’s contribution will be reduced by 300/600 or 50%.\ncontinued on next page\nGAF Shingle & Accessory \nLimited Warranty\n\n \n  We protect   what  mat  ters  most\n™\n \nVisit gaf.com\nWind Warranty: What Is Covered/Sole and Exclusive Remedy \nThis limited warranty is specifically conditioned on your shingles or ridge cap shingles being fastened and installed strictly in accordance with GAF’s application instructions. This \nlimited warranty does not apply to starter strip shingles. GAF warrants to you that your GAF shingles or ridge cap shingles will not fail to seal, blow off, or sustain damage from winds (in-\ncluding gusts) up to the applicable wind speed listed above after they should have sealed but did not due to a manufacturing defect. If your shingles or ridge cap shingles do fail to seal, \nblow off, or suffer wind damage, GAF will reimburse you for the reasonable costs of replacing the blown-off or damaged shingles or ridge cap shingles and hand-sealing any unsealed \nshingles or ridge cap shingles. Costs related to underlayment, metal work, and flashings are not included. GAF’s maximum liability under this paragraph is to reimburse you for the cost \nof hand-sealing all of the shingles and ridge cap shingles on your roof.\nNote: All self-sealing shingles and ridge cap shingles, including GAF’s, must be exposed to warm, sunny conditions for several days before they completely seal. Before sealing occurs, \nshingles and ridge cap shingles are vulnerable to blow-offs and wind damage. Shingles and ridge cap shingles installed in fall or winter may not seal until the following spring. Shingles \nor ridge cap shingles that are not exposed to direct sunlight or adequate surface temperatures or that are not fastened or installed properly may never seal. Failures to seal, blow-offs, \nand wind damage under these circumstances result from the nature of self-sealing shingles and ridge cap shingles, not a manufacturing defect, and are not covered under this limited \nwarranty.\nAlgae Warranty: What Is Covered/Sole and Exclusive Remedy \nThis limited warranty applies only to shingles, ridge cap shingles, and starter strip shingles sold in packages bearing the StainGuard Plus PRO\n™\n, StainGuard Plus\n™\n or StainGuard\n®\n \nlogos. GAF warrants to you that blue-green algae (also known as cyanobacteria) will not cause a pronounced discoloration of your StainGuard Plus PRO\n™\n-, StainGuard Plus\n™\n-, or \nStainGuard\n®\n-labeled shingles, ridge cap shingles, or starter strip shingles for the warranty term listed above. If your StainGuard Plus PRO\n™\n-, StainGuard Plus\n™\n-, or StainGuard\n®\n- \nlabeled shingles, ridge cap shingles, or starter strip shingles exhibit a pronounced discoloration caused by blue-green algae during the Smart Choice\n®\n Protection Period listed above, \nGAF’s contribution will be either the reasonable cost of commercially cleaning your shingles, ridge cap shingles, or starter strip shingles or, at GAF’s sole option, replacing discolored \nshingles, ridge cap shingles, or starter strip shingles. The maximum cost to GAF shall be the lesser of the original cost of the affected shingles, ridge cap shingles, or starter strip shin-\ngles or the cost to clean the affected shingles, ridge cap shingles, or starter strip shingles. During the remainder of the limited warranty period, GAF’s contribution to you will be reduced \nto reflect the amount of use you have received from your shingles, ridge cap shingles, or starter strip shingles since they were installed. The amount of use will be calculated by dividing \nthe number of months which have elapsed since installation to the date of claim by the number of months in the Algae Warranty term.\nNote: Preventing pronounced algae-related discoloration of your shingles, ridge cap shingles, and starter strip shingles is achieved through formulations or through unique blends of \ngranules.\nWhat Is Not Covered \nEven if your GAF Products were not properly installed according to GAF’s application instructions or to standard good roofing practices, this limited warranty remains in effect. However, \nGAF will NOT be liable for and this warranty does NOT apply to:\n(1)  Damage resulting from anything other than an inherent manufacturing defect in the GAF Products, such as:\n (a)  improper fastening of your shingles or accessories or application not in strict accordance with GAF’s printed application instructions, if the improper installation was the cause of \nthe damage.\n  (b)  settlement, movement, structural damage, or defects in the building, walls, foundation, or the roof base over which the GAF Products were applied.\n (c) inadequate ventilation.\n(2) Damage resulting from causes beyond normal wear and tear, such as:\n (a) acts of nature, such as hail, fire, or winds (including gusts) over the applicable wind speed listed above.\n (b)  impact of traffic on the roof or foreign objects, including damage caused by objects blown onto the roof by wind.\n (c) improper storage or handling of the GAF Products.\n(3)  Ice damming, except for leaks in the area of your roof deck covered by a GAF Leak Barrier which are caused by a manufacturing defect in your GAF Leak Barrier.\n(4)  Shading or variations in the color of your GAF Products or discoloration or contamination caused by fungus, mold, lichen, algae (except for blue-green algae if your shingles, ridge \ncap shingles, or starter strip shingles were labeled with the Stainguard Plus PRO\n™\n, StainGuard Plus\n™\n, or StainGuard\n®\n logos), or other contaminants, including that caused by organic \nmaterials on the roof.\n(5)  Labor costs, except as specifically provided for above, disposal costs, tear-off costs, and costs related to underlayments (unless your claim involves a manufacturing defect in a GAF \nUnderlayment), metal work, and flashings.\n(6) Damage to the interior or exterior of the building, including, but not limited to, mold growth.\nOther Limitations Concerning Coverage \nDecisions as to the extent of repair, re-cover, or cleaning required, and the reasonable cost of such work, will be made solely by GAF. GAF reserves the right to arrange directly for your \nGAF Products to be repaired, re-covered, or cleaned instead of reimbursing you for such work. The remedy under this warranty is available only for that portion of your GAF Products \nactually exhibiting manufacturing defects or algae discoloration at the time your claim is settled. Any replacement GAF Products will be warranted only for the remainder of the original \nwarranty period. GAF reserves the right to discontinue or modify its shingles or accessories, including the colors available, so any replacement GAF Products may not be an exact match \nfor the GAF Products on your roof. Even if GAF does not modify a color, replacement GAF Products may not match your original GAF Products due to normal weathering, manufacturing \nvariations, or other factors. In the event that GAF is unable to provide replacement products, GAF reserves the right to provide the cash value of those replacement products.\nClaims: What You Must Do \nYou must notify GAF about any claim within 30 days after you notice a problem. You may report a claim online at gaf.com/contact, by calling GAF at 1-800-458-1860, sending an email \nto warrantyclaims@gaf.com, or by sending a notice in writing to: GAF, Warranty Claims Department, 1 Campus Drive, Parsippany, NJ 07054, USA. You will then be provided with com-\nplete details about submitting your claim. You will be required to provide proof of the date your shingles or accessories were installed and that you were the owner of the property at that \ntime (or that the warranty was properly transferred to you). You may be required to send to GAF, at your expense, photographs and sample products for testing. Within a reasonable time \nafter proper notification, GAF will evaluate your claim and resolve it in accordance with the terms of this limited warranty. If you repair or replace your GAF Products before you notify GAF \nabout your claim or before GAF has completed its evaluation of your claim, your claim may be denied. If you need to repair or replace your GAF Products before your claim is resolved, \nyou MUST provide GAF with reasonable notice. NOTE: Notice to your contractor, dealer, or home builder is NOT notice to GAF. You should retain this document for your records in \nthe unlikely event that you need to file a claim.\nSole and Exclusive Warranty \nTHIS LIMITED WARRANTY IS EXCLUSIVE AND REPLACES ALL OTHER WARRANTIES, CONDITIONS, REPRESENTATIONS AND GUARANTEES, WHETHER EXPRESS OR IMPLIED, WHETHER BY \nSTATUTE, AT LAW OR IN EQUITY, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. This limited warranty is your exclusive warranty \nfrom GAF and represents the SOLE REMEDY available to any owner of GAF Shingles or Accessories. GAF makes NO OTHER REPRESENTATIONS, CONDITIONS, GUARANTEES, OR WARRAN-\nTIES of any kind other than that stated herein. GAF WILL NOT BE LIABLE IN ANY EVENT FOR CONSEQUENTIAL, PUNITIVE, SPECIAL, INCIDENTAL, OR OTHER SIMILAR DAMAGES OF ANY KIND, \nincluding DAMAGE TO THE INTERIOR OR EXTERIOR OF ANY BUILDING, whether any claim against it is based upon breach of this warranty, negligence, strict liability in tort, or for any other \ncause. This limited warranty gives you specific legal rights, and you may also have other rights which vary from jurisdiction to jurisdiction. Some jurisdictions do not allow limitations on \nor the exclusion of incidental or consequential damages, so the above limitations or exclusions may not apply to you. New Jersey state residents are encouraged to review their rights \nunder the agreement, as provided under the New Jersey Truth-In-Consumer Contract Warranty and Notice Act (“TCCWNA”).\nThe United Nations Convention on the International Sale of Goods shall NOT apply either to the sale of the GAF Products or to this limited warranty.\nModification Of Warranty \nThis limited warranty may not be changed or modified except in writing, signed by an officer of GAF. No one (other than an officer of GAF) has the authority to assume any additional or \nother liability or responsibility for GAF in connection with your GAF Products except as described in this limited warranty. (Note: Warranty subject to change. The warranty in effect at the \ntime your GAF Products are installed is the version of the warranty that will govern your claim. For current information, visit gaf.com or write to GAF at 1 Campus Drive, Parsippany, NJ \n07054, USA, Attn: Warranty Claims Department.)\nEffective Date \nThis limited warranty is effective for GAF Products installed after January 1, 2023. \n©2023 GAF 1/23 • RESWT160L-0123\ncontinued from previous page\nGAF Shingle & Accessory \nLimited Warranty",
  "textLength": 19862,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}