{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Customer Resources(Products, Warranties, etc.)/Golden_Pledge_Limited_RESWT161_Legal_Sample.pdf",
  "name": "Golden_Pledge_Limited_RESWT161_Legal_Sample.pdf",
  "type": "pdf",
  "size": 2440688,
  "relativePath": "Customer Resources(Products, Warranties, etc.)/Golden_Pledge_Limited_RESWT161_Legal_Sample.pdf",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:05.807Z",
  "extractedText": "The Legal Stuff \nWhat Is Covered/Excluded. This Golden Pledge\n®\n Limited Warranty covers certain GAF roofing products installed on your roof (the “GAF Products”) including GAF Asphaltic Shingles,  \nGAF Ridge Cap Shingles, GAF Starter Strip Shingles, GAF Leak Barrier Products, GAF Roof Deck Protection Products, GAF Cobra\n®\n Attic Ventilation Products, GAF Master Flow\n®\n Attic  \nExhaust Ventilation Products, and GAF Master Flow\n™\n Pivot\n™\n Pipe Boot Flashing, in the unlikely event that they contain a manufacturing defect. Misapplication of your GAF Products and  \nflashings at valleys, dormers, chimneys, and plumbing vents (the “Covered Flashings”) is also covered. Note: This limited warranty does not cover low-slope membranes, other Master \nFlow\n®\n Products, or GAF ThermaCal\n®\n Ventilated Nail Base Roof Insulation. Please go to gaf.com for a copy of the limited warranties covering these products.\nHow Long Your Warranty Lasts\nGAF Shingles\nManufacturing Defect CoverageWind Warranty CoverageAlgae Warranty Coverage\nMisapplication  \nCoverage*****\nLimited \nWarranty Term\nSmart Choice\n®\n \nProtection  \nPeriod**\nLimited \nWarranty \nTerm\nWind Speed Coverage \n(mph / km/h)\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection \nPeriod**\nDesigner Lifetime\n†\n Shingles\nLifetime\n†\n50 Years15 Ye a r sWith Special Installation***:  \n130 / 209\nWithout Special Installation***: \n110 / 175\nStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus\n™\n:  \n15* / 10 Years\n30 Years\nLayerLock\n®\n-labeled  \nTimberline\n®\n Shingles\nLifetime\n†\n50 Years15 Ye a r sWindProven\n™\n Limited  \nWind Warranty****:  \nNo maximum wind speed.\nFor all other installations:\nWith Special Installation***:  \n130 / 209\nWithout Special Installation***: \n110 / 175\nStainGuard Plus \nPRO\n™\n: \n30 years \nStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus \nPRO\n™\n &  \nStainGuard Plus\n™\n:  \n15* / 10 Years\n30 Years for  \nTimberline\n®\n UHDZ\n™\n  \nONLY\n25 Years for all other  \nLayerLock\n®\n-labeled  \nTimberline\n®\n Shingles\nAll Other GAF  \nLifetime\n†\n Shingles\nLifetime\n†\n50 Years15 Ye a r sWith Special Installation***:  \n130 / 209\nWithout Special Installation***: \n110 / 175\nStainGuard\n®\n:  \n10 Years\nStainGuard\n®\n:  \n1 Year\n25 Years\nMarquis WeatherMax\n®\n30 Years20 Years15 Ye a r s80 / 130No coverageNo coverage20 Years\nRoyal Sovereign\n®\n25 Years20 Years15 Ye a r s60 / 96StainGuard\n®\n:  \n10 Years\nStainGuard\n®\n:  \n1 Year\n20 Years\nGAF Ridge Cap \nShingles\nManufacturing Defect \nCoverage\nWind Warranty CoverageAlgae Warranty Coverage\nMisapplication  \nCoverage*****\nLimited \nWarranty \nTerm\nWind Speed Coverage \n(mph / km/h)\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection \nPeriod**\nTimberTex\n®\n,\n \nRidglass\n®\n, and \nTimberCrest\n®\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the type of shingle installed  \nin the field of the roof.\n15 Ye a r sWith Special Installation***:  \n130 / 209\nWithout Special Installation***: \n110 / 175\nStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus\n™\n:  \n15* / 10 Years\nMisapplication  \nCoverage Term for GAF  \nRidge Cap Shingles lasts as  \nlong as the Misapplication \nCoverage Term for the type  \nof shingle installed in  \nthe field of the roof.\nSeal-A-Ridge\n® \n, Seal-A-Ridge\n®\n AS\n90 / 144\nZ\n® \nRidge\nWith Special Installation***:  \n90 / 144\nWithout Special Installation***: \n70 / 112\nGAF Starter Strip  \nShingles\nManufacturing Defect CoverageWind Warranty Coverage\nAlgae Warranty Coverage\nMisapplication  \nCoverage*****\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection \nPeriod**\nStarterMatch\n®\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the type of shingle installed \nin the field of the roof.\nNo coverageStainGuard Plus\n™\n:  \n25 Years\nStainGuard Plus\n™\n:  \n15* / 10 Years\nMisapplication  \nCoverage Term for GAF \nStarter Strip Shingles lasts as \nlong as the Misapplication \nCoverage Term for the type  \nof shingle installed in  \nthe field of the roof.\nAll Other GAF Starter  \nStrip Shingles\nNo coverage No coverage \nOther GAF Accessories\nManufacturing Defect CoverageWind Warranty CoverageAlgae Warranty Coverage\nMisapplication  \nCoverage*****\nGAF Leak Barrier Products\nGAF Roof Deck Protection \nProducts\nGAF Cobra\n®\n Attic  \nVentilation Products\nGAF Master Flow\n®\n Non- \nPowered Attic Exhaust  \nVentilation Products\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the type of shingle installed  \nin the field of the roof.\nNo coverageNo coverageMisapplication  \nCoverage Term for GAF \nAccessories lasts as  \nlong as the Misapplication \nCoverage Term for the type  \nof shingle installed in  \nthe field of the roof.\nOther GAF Accessories\nManufacturing Defect CoverageWind Warranty CoverageAlgae Warranty Coverage\nMisapplication  \nCoverage*****\nGAF Master Flow\n®\n Powered  \nAttic Exhaust Ventilation Products\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period**  \nlasts as long as the warranty for  \nmanufacturing defects for the type \nof shingle installed in the field of the \nroof, except that Motorized, Solar, \nand Electronic Components and Wi-Fi \nConnectivity (if applicable) are covered \nfor the warranty term stated in the  \nGAF Master Flow\n®\n Powered Attic  \nExhaust Ventilation Products  \nLimited Warranty Addendum \nNo coverageNo coverageMisapplication  \nCoverage Term for GAF \nAccessories lasts as  \nlong as the Misapplication \nCoverage Term for the type  \nof shingle installed in  \nthe field of the roof.\n       †  Definition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred within the first 20 years], own the property where the shingles and/or accessories are installed. \nThe Lifetime warranty term and 50-year non-prorated period are applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, \ngovernmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years and the non-prorated period is 25 years.  \nSee Golden Pledge\n®\n Limited Warranty for Commercial and Multi-Family Properties for complete coverage and restrictions.\n        *\n 15-year Smart Choice\n®\n Protection Period for the StainGuard Plus PRO\n™\n or StainGuard Plus\n™\n Algae Protection Limited Warranty applies only if you install both StainGuard Plus PRO\n™\n-or StainGuard Plus\n™\n-labeled shingles and ridge cap \nshingles. For all other installations, the Smart Choice\n®\n Protection Period is 10-years.\n      **\n Smart  Choice\n®\n Protection Period: refers to the crucial period of time following installation of the GAF Products during which the coverage provided for in this limited warranty is non-prorated. After the Smart Choice\n®\n Protection Period specified \nabove, the remedy provided for in this warranty may be different than that provided for during the Smart Choice\n®\n Protection Period, and any remedy will be reduced to reflect the use you have received from your GAF Products. The amount of use \nwill be calculated by dividing the number of months which have elapsed since installation to the date of claim by the number of months in the warranty term. For a Lifetime\n†\n warranty, GAF’s contribution in years 51 and beyond is 20%. After the \nnon-prorated period, GAF’s maximum liability for any roof shall NOT exceed three times the reasonable cost of replacement GAF Products before any reduction for use.\n    ***\n  Special  Installation: Your GAF LayerLock\n®\n-labeled shingles will be covered up to the maximum wind speed above ONLY if installed using 4 nails per shingle and you have GAF Starter Strip Products installed at the eaves and rakes. Special \nInstallation for all other GAF Shingles requires use of 6 nails per shingle and GAF Starter Strip Products installed at the eaves and rakes. Your GAF Ridge Cap Shingles will be covered up to the maximum wind speed above ONLY if your ridge cap \nshingles are installed in strict accordance with the “Maximum Wind Speed Coverage Under Limited Warranty” section of the applicable ridge cap shingle application instructions.\n  ***\n *WindProven\n™\n Limited Wind Warranty requires installation of LayerLock\n®\n-labeled shingles using 4 nails per shingle, and at least four (4) qualifying accessories.\n**** *Misapplication  Coverage: Misapplication Coverage Terms listed above pertain to GAF Shingles and Accessories installed on single-family detached residences owned by individual(s). For other types of owners or buildings, coverage lasts  \n  for 25 years. See Golden Pledge\n®\n Limited Warranty for Commercial and Multi-Family Properties for complete coverage and restrictions.\nGolden Pledge\n®\n \nLimited Warranty\nSAMPLE\n425723_RESWT161L-0923_GAF Golden Pledge Limited Warranty_8.5 x 14.indd   1425723_RESWT161L-0923_GAF Golden Pledge Limited Warranty_8.5 x 14.indd   110/20/23   8:49 PM10/20/23   8:49 PM\n\nWho Is Covered by This Limited Warranty; Transferability \nYou are covered by this limited warranty if you live in the United States or Canada and are \nthe original property owner (i.e., not a builder or installer) or the first subsequent owner if \nthis warranty was properly transferred. \nThis limited warranty may be transferred only once. The second owner must notify GAF in \nwriting within one year after the property transfer for warranty coverage to be transferred. \n(Other than this one transfer, this warranty may not be transferred or assigned, directly \nor indirectly.) If the transfer takes place within the first 20 years after installation, the \nsecond owner is entitled to the same coverage as the original owner. If the transfer takes \nplace afterwards, the length of this warranty shall be reduced to the two-year period after \nownership changes. During this two-year period, GAF’s reimbursement to the second \nowner will be based only on the reasonable cost of replacement GAF Products, reduced by \nthe amount of use that has been received from the GAF Products from date of installation \nthrough the date of claim.\nManufacturing Defects: What Is Covered/Sole and Exclusive Remedy \nGAF Warranty Company, LLC, a subsidiary of GAF, warrants that your GAF Products will remain \nfree from manufacturing defects that adversely affect their performance during the applicable \nwarranty term listed above. Note: Wind Warranty and Algae Warranty are covered separately  \nbelow. For coverage related to Master Flow\n®\n Powered Attic Exhaust Ventilation Products,  \nrefer to your Master Flow\n®\n Powered Attic Exhaust Ventilation Products Limited Warranty \nAddendum (if applicable).\n(1) During the Smart Choice\n®\n Protection Period: GAF will pay you the full reasonable \ncost of labor to repair or re-cover any defective GAF Product(s) (excluding non-GAF \naccessories, metal work, or flashings other than Covered Flashings), and will provide \nreplacement GAF Products or the reasonable cost of obtaining replacement GAF Products, \nat GAF’s option. The costs of labor to tear off some or all of your GAF Products and disposal \nare included if necessary to repair your roof.\n(2) After the Smart Choice\n®\n Protection Period: The repair or re-cover cost, replacement \nGAF Products, or reimbursement provided to you will be reduced to reflect the use you \nhave received from your GAF Products. The amount of use will be calculated by dividing the \nnumber of months which have elapsed since installation to the date of claim by the number \nof months in the warranty term. For a Lifetime\n†\n warranty, GAF’s contribution in years 51 and \nbeyond will be 20%. After the non-prorated period, GAF’s maximum liability for any roof \nshall NOT exceed three times the reasonable cost of replacement GAF Products before any \nreduction for use.\nWindProven\n™\n Limited Wind Warranty: What Is Covered/Sole and Exclusive Remedy \nThis limited warranty is specifically conditioned on your meeting all eligibility \nrequirements, including installation of LayerLock\n®\n-labeled shingles, GAF Ridge Cap \nShingles, GAF Starter Strip Shingles, and a GAF Roof Deck Protection Product, plus your \nchoice of either a GAF Leak Barrier Product or GAF Attic Ventilation Product, and your \nLayerLock\n®\n-labeled shingles being fastened and installed strictly in accordance with  \nGAF’s application instructions. For installations which do not meet these eligibility \nrequirements, see Wind Warranty section below. The limited warranty applies only to \nyour LayerLock\n®\n-labeled shingles and does not apply to any GAF Accessory Products. \nGAF warrants to you that your LayerLock\n®\n-labeled shingles will not fail to seal, blow off, \nor sustain damage from winds (including gusts) after they should have sealed but did not \ndue to a manufacturing defect. If your LayerLock\n®\n-labeled shingles do fail to seal, blow \noff, or suffer wind damage, GAF will reimburse you for the reasonable costs of replacing \nthe blown-off or damaged shingles and hand-sealing any unsealed shingles. Costs related \nto underlayment, metal work, and flashings are not included. GAF’s maximum liability \nunder this paragraph is to reimburse you for the cost of hand-sealing all of the LayerLock\n®\n-\nlabeled shingles on your roof.\nWind Warranty: What Is Covered/Sole and Exclusive Remedy \nGAF warrants to you that your GAF shingles and ridge cap shingles will not fail to seal, blow \noff, or sustain damage from winds (including gusts) up to the applicable wind speed listed \nabove after they should have sealed but did not due to a manufacturing defect or their \nmisapplication. If your shingles or ridge cap shingles do fail to seal, blow off, or suffer wind \ndamage, GAF will reimburse you for the reasonable costs of replacing the blown-off shingles \nor damaged shingles or ridge cap shingles and head-sealing any unsealed shingles or ridge \ncap shingles. Costs relating to metal work and flashings (other than Covered Flashings) are \nnot included. GAF’s maximum liability under this paragraph is to reimburse you for the cost \nof hand-sealing all of the shingles and ridge cap shingles on your roof.\nAlgae Warranty: What Is Covered/Sole and Exclusive Remedy \nThis limited warranty applies only to shingles, ridge cap shingles, and starter strip shingles \nsold in packages bearing the StainGuard Plus PRO\n™\n, StainGuard Plus\n™\n, or StainGuard\n®\n \nlogos. GAF warrants to you that blue-green algae (also known as cyanobacteria) will not \ncause a pronounced discoloration of your StainGuard Plus PRO\n™\n-,StainGuard Plus\n™\n- or \nStainGuard\n®\n-labeled shingles, ridge cap shingles, or starter strip shingles for the warranty \nterm listed above. If your StainGuard Plus PRO\n™\n-, StainGuard Plus\n™\n-, or StainGuard\n®\n-\nlabeled shingles, ridge cap shingles, or starter strip shingles exhibit a pronounced \ndiscoloration caused by blue-green algae during the Smart Choice\n®\n Protection Period listed \nabove, GAF’s contribution will be either the reasonable cost of commercially cleaning your \nshingles, ridge cap shingles, or starter strip shingles or, at GAF’s sole option, replacing \ndiscolored shingles, ridge cap shingles, or starter strip shingles. The maximum cost to GAF \nshall be lesser of the original cost of the affected shingles, ridge cap shingles, or starter \nstrip shingles or the cost to clean the affected shingles, ridge cap shingles, or starter strip \nshingles. During the remainder of the limited warranty period, GAF’s contribution to you \nwill be reduced to reflect the amount of use you have received from your shingles, ridge \ncap shingles, or starter strip shingles since they were installed. The amount of use will be \ncalculated by dividing the number of months which have elapsed since installation to the \ndate of claim by the number of months in the Algae Warranty term.\nNote: Preventing pronounced algae-related discoloration of your shingles, ridge cap \nshingles, and starter strip shingles is achieved through formulations or through unique \nblends of granules.\nMisapplication: What Is Covered/Sole and Exclusive Remedy \nIf any of your GAF Products or Covered Flashings is found to have an application error that \nadversely affects performance, GAF will arrange to have your roof repaired or re-covered or, \nat its sole option, will provide you with replacement GAF product(s) and reimburse you for \nthe full reasonable cost of labor and other materials to repair or re-cover your roof, including \nCovered Flashings. The costs of labor to tear off some or all of your GAF Products and \nCovered Flashings and disposal are included if necessary to repair your roof.\nIf your claim arises out of an application error in your GAF Products or Covered Flashings, \nwhich is discovered or discoverable within the first two years after installation, it is the \nobligation of your Master Elite\n®\n Roofing Contractor to make all necessary repairs. In the \nevent that GAF determines your Master Elite\n®\n Roofing Contractor is unable or unwilling to \nperform these repairs, GAF will arrange to have your roof repaired if the issues were caused \nby application errors within the scope of GAF liability under this limited warranty.\nNOTE: Failure to install adequate ventilation is NOT an application error of your GAF \nProducts and is not covered under this Limited Warranty. Due to the design of certain \nbuildings, the replacement of existing flashings may be difficult, costly, or impractical. \nPlease be sure to review these items with your roofing contractor.\nWhat Is Not Covered \nEven if your GAF Products were not properly installed according to GAF’s application \ninstructions or to standard good roofing practices, this limited warranty remains in effect. \nHowever, GAF will NOT be liable for and this warranty does NOT apply to:\n(1) \n Damage resulting from anything other than an inherent manufacturing defect in the GAF \nProducts, their misapplication, or the misapplication of Covered Flashings, such as:\n (a)  settlement, movement, structural damage, or defects in the building, walls, \nfoundation, or the roof base over which the shingles or accessories were applied.\n (b) inadequate ventilation.\n(2)  Damage resulting from causes beyond normal wear and tear, such as:\n (a)  acts of nature, such as hail, fire, or winds (including gusts) over the applicable wind \nspeed listed above except there is no maximum wind speed restriction for shingles \ncovered by the WindProven\n™\n Limited Wind Warranty.\n (b)  impact of traffic on the roof or foreign objects, including damage caused by objects \nblown onto the roof by wind.\n      (c) \n improper storage or handling of the GAF Products.\n(3)  Ice damming, except for leaks in the area of your roof covered by a GAF Leak \nBarrier which are caused by a manufacturing defect in your GAF Leak Barrier, its \nmisapplication, or the misapplication of Covered Flashings.\n(4)  Shading or variations in the color of your GAF Products, chipping, fading, or peeling \npaint on your Master Flow\n®\n Attic Exhaust Vent, or Master Flow\n™\n Pivot\n™\n Pipe Boot \nFlashing, or discoloration or contamination caused by fungus, mold, lichen, algae \n(except for blue-green algae if your shingles, ridge cap shingles, or starter strip shingles \nwere labeled with the StainGuard Plus PRO\n™\n, StainGuard Plus\n™\n, or StainGuard\n®\n logos), \nor other contaminants, including that caused by organic materials on the roof.\n(5) \n Damage caused by, or the cost to repair or replace, products not sold by GAF, including \nbut not limited to metal work and counterflashing.\n(6)  Improperly designed or installed gutter or downspout systems.\n(7)  Damage to the interior or exterior of the building, including, but not limited to, mold growth.\n(8)  Damage to or caused by rooftop  air-conditioning units (and their flashing), pipe \nworks, brace works, skylights, rooftop satellite dishes or other radio/TV devices, \ncounterflashing, or flashings other than those specifically included above.\nOther Limitations Concerning Coverage \nDecisions as to the extent of repair, re-cover, or cleaning required, and the reasonable cost \nof such work, will be made solely by GAF. GAF reserves the right to arrange directly for your \nGAF Products to be repaired, re-covered, or cleaned instead of reimbursing you for such \nwork. The remedy under this warranty is available only for that portion of your GAF Products \nactually exhibiting manufacturing defects, application errors (including misapplication of \nCovered Flashings), or algae discoloration at the time your claim is settled. Any replacement \nGAF Products will be warranted only for the remainder of the original warranty period. \nGAF reserves the right to discontinue or modify its shingles or accessories, including the \ncolors available, so any replacement GAF Products may not be an exact match for the GAF \nProducts on your roof. Even if GAF does not modify a color, replacement GAF Products may \nnot match your original GAF Products due to normal weathering, manufacturing variations, \nor other factors. In the event that GAF is unable to provide replacement products, GAF \nreserves the right to provide the cash value of those replacement products. \nClaims: What You Must Do \nYou must notify GAF about any claim within 30 days\n after you notice a problem. You may \nreport a claim online at gaf.com/contact, by calling GAF at 1-800-458-1860, sending an \nemail to warrantyclaims@gaf.com, or by sending a notice in writing to: GAF, Warranty \nClaims Department, 1 Campus Drive, Parsippany, NJ 07054, USA. You will then be provided \nwith complete details about submitting your claim. You may be required to send to GAF, at \nyour expense, photographs and sample products for testing. Within a reasonable time after \nproper notification, GAF will evaluate your claim and resolve it in accordance with the terms \nof this limited warranty. If you repair or replace your GAF Products before you notify GAF \nabout your claim or before GAF has completed its evaluation of your claim, your claim may \nbe denied. If you need to repair or replace your GAF Products before your claim is resolved, \nyou MUST provide GAF with reasonable notice. NOTE: Notice to your contractor, dealer, \nor homebuilder is NOT notice to GAF. You should retain this document for your records in \nthe unlikely event that you need to file a claim.\nSole and Exclusive Warranty \nTHIS LIMITED WARRANTY IS EXCLUSIVE AND REPLACES ALL OTHER WARRANTIES, \nCONDITIONS, REPRESENTATIONS, AND GUARANTEES, WHETHER EXPRESS OR IMPLIED, \nWHETHER BY STATUTE, AT LAW OR IN EQUITY, INCLUDING THE IMPLIED WARRANTIES OF \nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. This limited warranty is your \nexclusive warranty from GAF and represents the SOLE REMEDY available to any owner of \nGAF Products. GAF makes NO OTHER REPRESENTATIONS, CONDITIONS, GUARANTEES, OR \nWARRANTIES of any kind other than that stated herein. GAF WILL NOT BE LIABLE IN ANY \nEVENT FOR CONSEQUENTIAL, PUNITIVE, SPECIAL, INCIDENTAL, OR OTHER SIMILAR DAMAGES \nOF ANY KIND, including DAMAGE TO THE INTERIOR OR EXTERIOR OF ANY BUILDING, whether \nany claim against it is based upon breach of this warranty, negligence, strict liability in tort, \nor for any other cause. This limited warranty gives you specific legal rights, and you may \nalso have other rights which vary from jurisdiction to jurisdiction. Some jurisdictions do not \nallow limitations on or the exclusion of incidental or consequential damages, so the above \nlimitations or exclusions may not apply to you. New Jersey state residents are encouraged \nto review their rights under the agreement, as provided under the New Jersey Truth-In-\nConsumer Contract Warranty and Notice Act (“TCCWNA”).\nThe United Nations Convention on Contracts for the International Sale of Goods shall NOT \napply either to the sale of the GAF Products or to this limited warranty.\nModification of Warranty \nThis limited warranty may not be changed or modified except in writing, signed by an officer \nof GAF. No one (other than an officer of GAF) has the authority to assume any additional or \nother liability or responsibility for GAF in connection with your GAF Products and Covered \nFlashings except as described in this limited warranty.\nEffectiveness \nThis limited warranty will not take effect unless all eligibility requirements have been \nsatisfied, this warranty is registered to you, and your roofing contractor has been paid in full. \nGolden Pledge\n®\n \nLimited Warranty\nVisit gaf.com\n©2023 GAF • RESWT161L-0923     425723-1023     \nSAMPLE\nImportant Notice:  \nTHIS IS A SAMPLE GOLDEN PLEDGE\n®\n LIMITED WARRANTY. IT IS YOUR CONTRACTOR’S \nRESPONSIBILITY TO REGISTER YOUR WARRANTY WITHIN 45 DAYS OF INSTALLATION. IF \nYOU HAVE NOT RECEIVED YOUR WARRANTY FROM GAF WITHIN 60 DAYS, YOU SHOULD \nCALL GAF AT: 1-888-532-5767, OPTION 5.\n425723_RESWT161L-0923_GAF Golden Pledge Limited Warranty_8.5 x 14.indd   2425723_RESWT161L-0923_GAF Golden Pledge Limited Warranty_8.5 x 14.indd   210/20/23   8:49 PM10/20/23   8:49 PM",
  "textLength": 25099,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}