{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Hover ESX_XML_PDF Process.docx",
  "name": "Hover ESX_XML_PDF Process.docx",
  "type": "docx",
  "size": 80167,
  "relativePath": "Hover ESX_XML_PDF Process.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:35.855Z",
  "extractedText": "When you need a Hover ESX, XML, or PDF to send to your adjuster, please task Brandon, Danny, Ford, or Reese to approve your Hover.  Please state in your task if it is roof only or roof and siding.\n\n\n\nAfter the Hover is approved, you will receive an email from Hover with the PDF.  Once you receive that, it means your Hover is ready (if it is roof and siding, it will take a little bit longer to have the siding added as well.)\n\n\n\nOnce the Hover is complete, you will be able to download your own ESX, XML, or PDF.  You will also be able to see if your Hover is still processing and not ready for download yet.\n\n\n\nYou will do this through your internet browser; this can be done on a computer, ipad, or on your phone.  Go to the website: Hover.to\n\nOnce you go there, search your customer’s Job ID to find your customer. See the screenshot below.  The Job ID is 6902\n\n\n\n\n\nIf you manually created the hover (which you should not be doing) you will have to just search for the customer’s hover that you manually created.\n\n\n\nOnce you open the file, you will click “export”. See screenshot below\n\n\n\nYou will then download the ESX. See screenshot below\n\n\n\nESX is at the very bottom. Once you click that checkbox next to it, press download.  \n\n\n\nThe most effective way to get this to your adjuster is to: \n\nEmail this file to yourself. \n\nDownload the document(s) on your computer, phone or iPad.\n\nCompose a new email and send it to your adjuster. (This way you can write the subject, write the note, and it should have your signature at the bottom of the email.)\n\n\n\n",
  "textLength": 1559,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}