{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/How to do a Repair Attempt [EXAMPLE].docx",
  "name": "How to do a Repair Attempt [EXAMPLE].docx",
  "type": "docx",
  "size": 12562292,
  "relativePath": "How to do a Repair Attempt [EXAMPLE].docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:36.918Z",
  "extractedText": "Use email template to Adjuster/Insurance and \n\nCC or BCC Reese and/or Danny if needed\n\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED, REMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\n\nPlease refer to Sales Operations and Tasks Document for more detailed explanation of how to successfully conduct an RA.\n\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL INSTRUCTIONS BEFORE SENDING THIS TO YOUR THE INSURANCE.  EVERYTHING IN THE BRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\n\nMAKE SURE TO ATTACH CLAIM AUTHORIZATION AND INCLUDE CLAIM # IN SUBJECT\n\n\n\nPLEASE ALSO INCLUDE BEFORE/AFTER PHOTOS!!!\n\nCreating iTel, Repair Attempt, or Tarp Agreements\n\nClick the words Switch Agreement at the bottom right of the screen\n\nSelect needed agreement (Itel, Repair Attempt, or Tarp)\n\nDO NOT enter in the customer’s information again\n\nPress Existing Customers at the top right of the screen\n\nFill out additional information at the bottom of the page\n\nPlease reach out to Reese, Danny, or your trainer if you need additional assistance with this bottom section\n\nPress Proceed to Agreement\n\nYou sign Agreement\n\nCustomer signs Agreement\n\nFor iTel and Repair Attempt make sure to let HO know that they are never responsible for the cost that appears on the agreement (read the bold section of the agreement)\n\nFor Tarp make sure to let HO know to submit payment first, but they will be reimbursed by the insurance company\n\nSee section above titled: “Customer needs Tarp”\n\nUploading Missing Documents\n\nIf you notice that the job file for your customer is missing Contingency or Claim Authorization do the following:\n\nOpen the Sales App\n\nClick the documents button (folder) at the bottom left of the screen\n\nScroll until you see your customer\n\nPress the upload button next to each of the forms that you need uploaded (button looks like a cloud with an up arrow inside of it)\n\n\\\n\nFilming Repair Attempt Video\n\nBefore you begin filming, ask the Field Tech (Francisco or Ishmael) to point out which of the surrounding shingles will be affected by the extraction. Mark the damaged tab (if applicable) and mark the bottom right corner with chalk of every shingle the Field Tech points out.\n\n\n\n\n\n\n\n Before you begin filming; take a before shot of the area where you will be extracting the shingle. Start recording, state the Homeowners name and house number. “...Here we are at [HOMEOWNER’S HOUSE at 1234 (street name)] performing a repair attempt on this storm damaged shingle. As you can see I have pre-marked every tab that will sustain unavoidable creasing due to the brittleness of the roof. Go ahead and get started Francisco/Ishmael”\n\n\n\n\n\nFilm the entire area where repair is going to occur, then go from the Wide camera shot to a low down side view camera angle, to show how the shingles get bent back/pried up during the process. Make sure to show on camera or explicitly mention the high amount of granule loss running down the roof.\n\n\n\n\n\nOnce the new shingle has been installed, hover the camera over the shingles and wipe your hand back and forth gently or blow over the top of each tab that was pried up. Trace your finger along the crease and show it on camera, explain how each tab has now been mechanically creased and confirms the roof failed a “brittle test”. (picture below)\n\n\n\n\n\n\n\nOnce you have finished recording your video. Take close-up after pictures of the rows above the replaced shingle. Draw an arrow to where the crease is on the shingle or point to it for the picture.\n\n\n\n\n\n(see good examples of after pics below email template)\n\n\n\n\n\n\n\n\n\nTo whom it may concern,\n\n\n\nPlease see the attached video link and photos of the attempted repair for the claim number (#__________). \n\n\n\nAs can be clearly seen in the evidence provided, the homeowner's roof sustained additional damage during the attempted repairs. Thus confirming a failed brittle test for the shingles, indicating irreparability for the roof as a whole.\n\n\n\nWith this fact established, your current estimate does not adequately address the needs of this roof. Performing further patch repairs as [INSURANCE COMPANY NAME] has suggested will unintentionally, yet unavoidably, cause further extensive damage to surrounding shingles. Therefore I have gone ahead and attached an estimate that accurately reflects the full scope of work necessary to make our mutual client whole again. \n\n\n\nYouTube Link: https://youtu.be/Tx6km60KXhc?feature=shared (watch this for a good example)\n\n\n\nI also ask that you take note of the attached before and after pictures of the attempted repair. These photos clearly demonstrate the brittleness of this roof, and moving forward with further patch repairs will inevitably do further unavoidable damage to surrounding shingles. \n\n\n\nPlease review these findings and revise your estimate/scope of work accordingly, so we can begin to move forward with the full roof replacement for [HOMEOWNER NAME]. If we can provide any additional information, please don't hesitate to reach out.\n\n\n\nThank you for your time and for working with us to assist [HOMEOWNER] in restoring their property effectively after the loss they have experienced.\n\n\n\n(your signature)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBefore\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBefore\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBefore\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(continue below)\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfter\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
  "textLength": 5549,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}