{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Sales Scripts /Initial Pitch Script.docx",
  "name": "Initial Pitch Script.docx",
  "type": "docx",
  "size": 16793,
  "relativePath": "Sales Scripts /Initial Pitch Script.docx",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:02.259Z",
  "extractedText": "\n\n\n\nInitial Pitch\n\n\n\n5 Non-negotiables with every pitch\n\nWho you are\n\nWho we are and what we do (Roof ER)\n\nMake it relatable\n\nWhat you’re there to do (an inspection)\n\nGo for the close (them agreeing to the inspection)\n\n\n\nKnock on door/ring doorbell \n\nAs they are opening the door, smile and wave. \n\n“Hi, how are you? My Name is ________ with Roof- ER we’re a local roofing company that specializes in helping homeowners get their roof (and siding) replaced, paid for by their insurance!”  \n\n\n\n\n\nGeneric:\n\n“We’ve had a lot of storms here in Northern Virginia/Philadelphia/Maryland over the past few months that have done a lot of damage! \n\n“We’re already working with your neighbors. We’ve been able to help them get fully approved through their insurance company to have their roof  and/or siding replaced.”\n\n (Go to line marked with ^)\n\n\n\n\t\t-OR-\n\n\n\nSpecific\n\n“Were you home for the storm we had in ___. Wait for answer\n\nIf yes “It was pretty crazy right?! Wait for answer \n\nIf no: “Oh no worries at all, we get that all the time.\n\nIf yes move on to next line marked with *\n\nIf no “That’s good! It was a pretty bad one!”\n\n*“We’re working with a lot of your neighbors in the area. We’ve been able to help them get fully approved through their insurance company to have their roof (and siding) replaced.”\n\n\n\n\n\n\n\n^“While I’m here, in the neighborhood, I am conducting a completely free inspection to see if you have similar, qualifiable damage. If you do,  I’ll take a bunch of photos and walk you through the rest of the process. If you don’t, I wouldn’t want to waste your time, I wouldn’t want to waste mine! I will at least leave giving you peace of mind that you’re in good shape.”\n\n\n\nOnce they agree to let you do the inspection:, “Alright! It will take me about 10 - 15 minutes. I’m gonna take a look around the perimeter of your home, then grab the ladder, and take a look at your roof.\n\nGo in for a handshake. What was your name again? [Their name] great to meet you, again I am (your name).  Oh and by the way do you know who your insurance company is”? Wait for their answer, “Great! We work with those guys all the time.”\n\n\n\n“Here’s my card/flier, look us up while I’m conducting the inspection! I will give you a knock when I finish up and show you what I’ve found.”\n\nWithout any hesitation, move into inspection. (See Inspection and Post-Inspection Script for detailed next steps.)\n\n\n\n",
  "textLength": 2396,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}