{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Sales Scripts /Inspection and Post Inspection Script.docx",
  "name": "Inspection and Post Inspection Script.docx",
  "type": "docx",
  "size": 241389,
  "relativePath": "Sales Scripts /Inspection and Post Inspection Script.docx",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:03.278Z",
  "extractedText": " \n\n\n\n   Inspection and Post-Inspection \n\nInspection - Ideal photo progression \n\n§Mailbox/House Number\n\n§Overview of House\n\n§Front Elevation Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Right Elevation  Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Rear Elevation Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Left Elevation Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Roof Overview Collateral\n\n§Damage to roof metals and other collateral on the roof\n\n§Circle Hail Hits & Slash Wind Damage (close up of each)\n\n§Overview of majority of the damage chalked up\n\n§Pictures of granules in the gutters or at the bottom of downspouts \n\n§Entire inspection shouldn’t take any longer than 15-20 minutes. How thorough of an inspection you  should do is a judgment call. Getting enough photos to sell the homeowner is most important. It doesn’t  matter how quickly you are able to complete the inspection if you don’t have enough damage-photos for  the homeowner to be on board with filing the claim.\n\n§Flashlight\n\n \\\n\nPost-Inspection Pitch\n\n\n\nKnock on the door \n\n\n\n“Hey _______, so I have a bunch of photos to show you. First I walked around the perimeter of the house  to look for collateral damage. I’ll also show you the collateral damage we found on the roof.”  Say this while going through through house number and overview photos\n\n\n\nStart showing the pictures of damage to screens, gutters, downspouts, and soft metals\n\n\n\n“While this damage functionally isn’t a big deal, it really helps build a story.  Think of us like lawyers and this collateral damage is the evidence that builds the case which helps us get the roof (and siding) approved.”\n\nContinue to slide through collateral damage photos\n\n\n\n“Here are the photos of the damage to your shingles. Anything I have circled means its hail damage (IF there were any wind damaged shingles or missing shingles say:) and  anything I have slashed means its wind damage. \n\n\n\nRemain on a photo of hail damage as you explain the following\n\n\n\n“This is exactly what we look for when we're looking for hail damage. If you notice, the divot is circular  in nature.   Even if this  damage doesn’t look like a big deal, what happens over time, these hail divots fill with water, freeze….,  when water freezes it expands and breaks apart the shingle which will eventually lead to leaks.  That is why your insurance company is responsible and your policy covers this type of damage.” \n\n\n\nStart slowly swiping through all the pictures of hail. \n\n\n\n“As you can see there is quite a bit of damage.  \n\n\n\nStart slowly swiping through all the pictures of hail.  \n\n\n\nIf there was wind damage or missing shingles, say the following:\n\n“Now here are the wind damaged shingles. You have both shingles that are creased from the wind lifting them up and shingles that have completely been blown off.”\n\n\n\nShow the pictures of wind damaged and/or missing shingles (if applicable)\n\n\n\nNow show them pictures of the granules in gutters and downspouts\n\n“As you can see here, granules have filled up your gutters. These granules are supposed to be what’s protecting your home. When wind and hail hits your roof, it knocks out these granules which reduces the lifespan of your roof.”\n\n\n\n“This is very similar to damage to ________’s home and/or the rest of the approvals we’ve gotten in the area”.  \n\n\n\n“With that being said, insurance companies are always looking for ways to mitigate their losses. It’s unfortunate but that’s how they make money. The most important part of this process is that when your insurance company comes out to run their inspection, we are here as storm experts to make sure you as a homeowner get a fair shake. If they are missing anything we make sure they see all the damage that I  just showed you.” \n\n\n\n“What I’m going to do now is run to my car, grab my iPad and we can get this process started”! Go get iPad \n\n\n\nAs you approach back to the house/homeowner ask “Is there a place we could sit down for 5-10  Minutes”?\n\nOnce you are in the house, spend some time building rapport as you get settled. \n\n\n\n“Okay, so first I am going to grab some of your basic information for our system. Then we can let your insurance company know about the damagel”. \n\n\n\nGather information from the homeowner:\n\nFull name\n\nAddress\n\nPhone Number  \n\nE-mail\n\nInsurance Company\n\n\n\n“Do you happen to know your deductible? If not, no big deal at all”! \n\nAfter you have collected all the information:\n\nAsk if they have the app or if they have the login to the website. \n\nIf not, use the Homeowner Information Sheet to prep the HO.  As you are writing or typing the information for the HO to use on the call, explain each part to them.\n\nAs much as possible, use HO’s phone to make the call \n\nReference Claim Filing Information Sheet\n\n\n\nMove on to Contingency & Claim Authorization\n\n",
  "textLength": 4863,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}