{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Email Templates/iTel Shingle Template.docx",
  "name": "iTel Shingle Template.docx",
  "type": "docx",
  "size": 10119,
  "relativePath": "Email Templates/iTel Shingle Template.docx",
  "category": "email_templates",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:34.839Z",
  "extractedText": "iTel Argument to Send to Adjuster/Insurance\n\n\n\nSend to Adjuster/Insurance and CC the customer\n\nCC or BCC Reese if needed\n\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED, REMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\n\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL INSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER.  EVERYTHING IN THE BRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\n\n\n\n\n\n\n\nTo whom it may concern\n\n\n\n\n\nThis is [REP NAME] with Roof ER.  I am the contractor assisting [CUSTOMER’S NAME].  Attached you will find an iTel report [AND any additional documents if you attach them.]\n\n\n\n[Use the following APPLICABLE arguments]\n\nPer the attached iTel report, there are no similar matches available which makes a patch repair impossible\n\nPer the attached iTel report, the existing shingle is discontinued. We have attempted to contact the suppliers listed on the report to secure the suggested samples, however each supplier noted [they do not carry the suggested product/the suggested product would need to be special-ordered by the pallet, meaning the costs to do so would be more exorbitant than simply replacing the roof]. As a result, the approved scope of work cannot be completed as currently written.\n\n(Homeowner's) shingles are the English-dimension architectural shingles which are no longer in production. The new metric-dimension shingles have a larger exposure size and for that reason, cannot be mixed with the existing shingles via a repair. If we try to repair with the new shingles, the sealant on the shingle above would not secure to the correct portion of the new underlying shingle. The sealant would be secured to the granules on the underlying shingle - any reputable contractor knows a proper repair cannot be completed in this fashion. \n\n\n\n\n\nPlease review these findings and revise your estimate accordingly so we can begin to move forward with the full replacement for [HOMEOWNER’S NAME]. If we can provide additional information, please let us know. Thank you for your time and for working with us to assist [HOMEOWNER’S NAME] in restoring their property effectively after the loss they have experienced.\n\n\n\nYour signature with your contact information\n\n\n\n",
  "textLength": 2240,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}