{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Questions/Knowledge.docx",
  "name": "Knowledge.docx",
  "type": "docx",
  "size": 28382,
  "relativePath": "Questions/Knowledge.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:00:12.541Z",
  "extractedText": "Q601–Q650 – Knowledge Q&A (with Guidance + Next Step)\n\nQ601 – What does GAF say about patching shingles?\n\nKnowledge: GAF Storm Damage Guidelines.pdf states shingles should not be patched because repairs compromise sealant bonds and void warranty.\n\nGuidance: Always cite this when adjuster insists on patching.\n\nNext Step: Escalate with the GAF guideline attached.\n\nQ602 – What does the Maryland Matching Law require?\n\nKnowledge: Maryland Insurance Administration Matching Requirement.pdf requires repairs to be uniform in color, quality, and appearance.\n\nGuidance: Use this when siding or shingles don’t match.\n\nNext Step: File complaint with regulator if carrier denies matching.\n\nQ603 – What does Virginia roofing code require for reroofs?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx requires complete underlayment replacement and proper flashing installation during reroofing.\n\nGuidance: Present this whenever carriers argue to reuse materials.\n\nNext Step: Attach code section to escalation email.\n\nQ604 – When does Maryland require exterior wrap?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx requires house wrap when siding is removed or replaced.\n\nGuidance: Explain to carrier it’s a mandatory code upgrade.\n\nNext Step: If denied, escalate with code text.\n\nQ605 – What do Low Roof/Flat Roof codes require?\n\nKnowledge: Low Roof_Flat Roof Code.docx requires proper slope for drainage and approved materials for waterproofing.\n\nGuidance: Cite during flat roof inspections.\n\nNext Step: Escalate if carrier ignores ponding or seam failures.\n\nQ606 – Why are discontinued shingles unrepairable?\n\nKnowledge: Discontinued-Shingle-List.pdf and iTel reports confirm discontinued shingles can’t be replaced with “like kind and quality.”\n\nGuidance: Use these to prove replacement is the only option.\n\nNext Step: Submit iTel + Discontinued List as evidence.\n\nQ607 – What is an iTel report?\n\nKnowledge: iTel Template.docx is a lab test that verifies if a shingle or siding product is still manufactured and available.\n\nGuidance: Use to back claims of unavailability.\n\nNext Step: Always attach iTel to your escalation.\n\nQ608 – What’s the role of complaints in claim escalation?\n\nKnowledge: Complaint Forms.docx allow homeowners to file with the state regulator when carriers violate law or delay.\n\nGuidance: Educate homeowners that this is their right.\n\nNext Step: Assist in filling out form when carrier refuses compliance.\n\nQ609 – What are flashing code requirements?\n\nKnowledge: Flashing Codes.docx requires step and counter-flashing replacement during reroof.\n\nGuidance: Always cite this when carriers suggest reusing flashing.\n\nNext Step: Document flashing with close-up photos.\n\nQ610 – What does GAF require for slope replacement?\n\nKnowledge: GAF Requirement – Slope Replacement.pdf states if one section is damaged, the entire slope must be replaced for warranty.\n\nGuidance: Present this when carrier suggests patching slopes.\n\nNext Step: Provide GAF doc in your escalation email.\n\n\n\nQ611 – What’s the importance of slope overview photos?\n\nKnowledge: Photo Report Template.docx standardizes slope documentation, showing overall damage pattern.\n\nGuidance: Use overview + close-ups for credibility.\n\nNext Step: If adjuster disputes, show pattern across slope.\n\nQ612 – Why must underlayment be replaced in reroofs?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx mandates complete underlayment replacement.\n\nGuidance: Explain old underlayment is brittle and fails.\n\nNext Step: Provide code citation to adjuster.\n\nQ613 – What does the GAF storm guide say about hail?\n\nKnowledge: GAF Storm Damage Guidelines.pdf states hail causes functional damage including granule loss and mat fractures.\n\nGuidance: Use when adjuster calls hail cosmetic.\n\nNext Step: Escalate with GAF guide attached.\n\nQ614 – What is arbitration?\n\nKnowledge: Arbitration Information.docx is a binding process to resolve disputes over policy interpretation.\n\nGuidance: Only used after complaints and escalation.\n\nNext Step: Discuss with Sales Manager before filing.\n\nQ615 – What’s the rule for siding underlayment?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx requires house wrap for siding replacements.\n\nGuidance: Present code whenever carriers try to skip wrap.\n\nNext Step: File complaint if denied.\n\nQ616 – Why do repairs void warranty?\n\nKnowledge: GAF Storm Damage Guidelines.pdf states improper repairs break sealant bonds and void coverage.\n\nGuidance: Present this to both homeowner and carrier.\n\nNext Step: Attach manufacturer guidelines to escalation.\n\nQ617 – What’s the purpose of the Estimate Request Template?\n\nKnowledge: Estimate Request Template.docx forces carriers to provide a full itemized scope.\n\nGuidance: Use if adjuster provides vague or partial estimate.\n\nNext Step: Escalate if carrier ignores formal request.\n\nQ618 – What are repair attempt requirements?\n\nKnowledge: Repair Attempt Template.docx documents repair efforts with before/after photos.\n\nGuidance: Only used when adjuster insists shingles are repairable.\n\nNext Step: Perform attempt and escalate with results.\n\nQ619 – What does iTel confirm beyond availability?\n\nKnowledge: iTel Template.docx also reports shingle dimensions, thickness, and sealant, proving mismatches.\n\nGuidance: Show that substitutes can’t meet “like kind and quality.”\n\nNext Step: Provide full report in escalation packet.\n\nQ620 – What do Virginia codes say about ventilation?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require intake/exhaust ventilation balance.\n\nGuidance: Use to justify adding vents if code requires.\n\nNext Step: Escalate if denied as “upgrade.”\n\n\n\nQ621 – Why are siding mismatches unacceptable?\n\nKnowledge: Siding Argument.docx shows mismatches in color, texture, and profile violate uniformity.\n\nGuidance: Show mismatched panels side by side.\n\nNext Step: Escalate with photo evidence.\n\nQ622 – What’s the role of CRM notes?\n\nKnowledge: CRM notes document carrier responses and actions.\n\nGuidance: Log every interaction.\n\nNext Step: If claim escalates, CRM becomes record.\n\nQ623 – What’s required for flat roof materials?\n\nKnowledge: Low Roof_Flat Roof Code.docx requires specific membranes and slope for drainage.\n\nGuidance: Document material type and ponding.\n\nNext Step: Escalate if carrier calls ponding “wear and tear.”\n\nQ624 – Why can’t shingles be repaired individually?\n\nKnowledge: GAF Storm Damage Guidelines.pdf state shingles interlock and repairs damage surrounding shingles.\n\nGuidance: Demonstrate with repair attempt photos.\n\nNext Step: Escalate with Repair Attempt Template.\n\nQ625 – What are complaint form essentials?\n\nKnowledge: Complaint Forms.docx requires homeowner info, claim details, and supporting evidence.\n\nGuidance: Fill out completely to avoid delays.\n\nNext Step: File with state insurance regulator.\n\nQ626 – What does code say about flashing reuse?\n\nKnowledge: Flashing Codes.docx requires replacement during reroof.\n\nGuidance: Always cite when adjuster says reuse.\n\nNext Step: Escalate with photos of deteriorated flashing.\n\nQ627 – Why is exterior wrap mandatory?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx prevents moisture intrusion behind siding.\n\nGuidance: Show homeowners it protects long-term value.\n\nNext Step: Attach code in escalation email.\n\nQ628 – What’s the difference between arbitration and complaint?\n\nKnowledge: Complaint = regulator involvement; Arbitration = binding decision on policy.\n\nGuidance: Complaint usually comes first.\n\nNext Step: Confirm with Sales Manager before filing arbitration.\n\nQ629 – Why can’t discontinued shingles be substituted?\n\nKnowledge: Discontinued-Shingle-List.pdf shows design differences (sealant, thickness, cut).\n\nGuidance: Explain “like kind and quality” standard.\n\nNext Step: Escalate with supplier letters.\n\nQ630 – What are step vs counter-flashing rules?\n\nKnowledge: Flashing Codes.docx details step flashing goes under shingles, counter-flashing into mortar joints.\n\nGuidance: Cite this for chimneys and walls.\n\nNext Step: Escalate with photos if carrier denies.\n\n\n\nQ631 – What does policy say about “like kind and quality”?\n\nKnowledge: Repairs must restore roof to pre-loss condition with matching function, quality, appearance.\n\nGuidance: Explain to homeowner in plain terms.\n\nNext Step: Escalate with manufacturer doc if denied.\n\nQ632 – Why are repair attempts important?\n\nKnowledge: Repair Attempt Template.docx proves shingles can’t be fixed.\n\nGuidance: Always photo-document.\n\nNext Step: Escalate failed attempts as irreparable.\n\nQ633 – What does code say about reroofing over old shingles?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx limit layers and often require tear-off.\n\nGuidance: Use when carrier suggests overlay.\n\nNext Step: Escalate with code citation.\n\nQ634 – Why must homeowners pay deductible?\n\nKnowledge: Insurance law prohibits deductible waivers.\n\nGuidance: Present as standard legal requirement.\n\nNext Step: If homeowner resists, frame as investment.\n\nQ635 – What are proper photo standards?\n\nKnowledge: Photo Report Template.docx requires slope overviews, close-ups, and context shots.\n\nGuidance: Follow template every time.\n\nNext Step: Return to site if missed.\n\nQ636 – What’s the importance of ventilation?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require balanced ventilation to prevent rot.\n\nGuidance: Use to justify adding vents.\n\nNext Step: Escalate if denied as “upgrade.”\n\nQ637 – Why can’t hail damage be called cosmetic?\n\nKnowledge: GAF Storm Damage Guidelines.pdf lists fractures and granule loss as functional damage.\n\nGuidance: Use whenever carrier denies hail claims.\n\nNext Step: Escalate with GAF guide attached.\n\nQ638 – What does complaint achieve?\n\nKnowledge: Complaint Forms.docx trigger regulator investigation.\n\nGuidance: Explain to homeowner it pressures carrier.\n\nNext Step: Assist homeowner in filing.\n\nQ639 – What are VA code tear-off rules?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx limit roof layers and require tear-off if damaged.\n\nGuidance: Use when carrier suggests overlay.\n\nNext Step: Escalate with photos of existing damage.\n\nQ640 – Why can’t siding mismatches be allowed?\n\nKnowledge: Siding Argument.docx shows mismatches reduce property value and violate uniformity.\n\nGuidance: Show side-by-side panels.\n\nNext Step: Escalate with supporting doc.\n\n\n\nQ641 – What are flashing types?\n\nKnowledge: Flashing Codes.docx lists step, counter, valley flashing.\n\nGuidance: Use correct type in arguments.\n\nNext Step: Escalate with photos.\n\nQ642 – What does iTel prove for siding?\n\nKnowledge: iTel Template.docx proves profile, lock, and color mismatch.\n\nGuidance: Use for siding disputes.\n\nNext Step: Attach to complaint.\n\nQ643 – What’s the rule for roof slope replacement?\n\nKnowledge: GAF Requirement – Slope Replacement.pdf requires full slope replacement if damaged.\n\nGuidance: Use when adjuster suggests partial.\n\nNext Step: Provide GAF doc.\n\nQ644 – Why do carriers deny for cosmetic damage?\n\nKnowledge: They try to classify damage as non-functional.\n\nGuidance: Counter with GAF guidelines.\n\nNext Step: Escalate with photo report.\n\nQ645 – What are Maryland siding requirements?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx requires weather barrier behind siding.\n\nGuidance: Use if adjuster excludes wrap.\n\nNext Step: Escalate with code doc.\n\nQ646 – What’s the function of granules?\n\nKnowledge: GAF Storm Damage Guidelines.pdf say granules protect asphalt from UV.\n\nGuidance: Explain granule loss = functional damage.\n\nNext Step: Provide GAF doc.\n\nQ647 – Why use repair attempt documentation?\n\nKnowledge: Repair Attempt Template.docx proves repairs fail.\n\nGuidance: Document thoroughly.\n\nNext Step: Escalate failed attempt.\n\nQ648 – What’s the purpose of arbitration?\n\nKnowledge: Arbitration Information.docx resolves disputes outside court.\n\nGuidance: Only last resort.\n\nNext Step: Consult Sales Manager.\n\nQ649 – Why must carriers follow code?\n\nKnowledge: State law requires compliance with building codes.\n\nGuidance: Use when adjuster tries to skip upgrades.\n\nNext Step: Escalate with complaint if refused.\n\nQ650 – What’s the top source for storm damage rules?\n\nKnowledge: GAF Storm Damage Guidelines.pdf is the go-to authority.\n\nGuidance: Always attach in hail/wind disputes.\n\nNext Step: Escalate with GAF doc if carrier won’t budge.\n\nQ651 – What does VA code say about ice & water shield?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require ice & water shield in valleys and eaves in cold regions.\n\nGuidance: Present this when carriers exclude it.\n\nNext Step: Escalate with code language if denied.\n\nQ652 – Why is counter-flashing required on chimneys?\n\nKnowledge: Flashing Codes.docx mandates counter-flashing embedded in mortar to prevent water intrusion.\n\nGuidance: Point this out when adjuster suggests caulking only.\n\nNext Step: Escalate with photo + code section.\n\nQ653 – What does GAF say about wind-damaged shingles?\n\nKnowledge: GAF Storm Damage Guidelines.pdf classify creased, torn, or missing shingles as functional wind damage.\n\nGuidance: Show creased tabs as evidence.\n\nNext Step: Escalate with GAF guideline.\n\nQ654 – What is “reasonable uniformity” in siding law?\n\nKnowledge: Maryland Matching Requirement.pdf defines it as repairs not being “readily noticeable.”\n\nGuidance: Use when mismatches are obvious.\n\nNext Step: Escalate with photo comparisons.\n\nQ655 – What does VA code say about reroof overlays?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx prohibit overlays if roof is water-soaked or deteriorated.\n\nGuidance: Use when carrier suggests overlay.\n\nNext Step: Provide code citation + photos of rot.\n\nQ656 – What’s the requirement for valley flashing?\n\nKnowledge: Flashing Codes.docx requires metal valley flashing or closed-cut shingles per code.\n\nGuidance: Document type present.\n\nNext Step: Escalate if carrier omits replacement.\n\nQ657 – Why do sealant bond failures matter?\n\nKnowledge: GAF Storm Damage Guidelines.pdf state failed sealant bonds allow wind-driven rain entry.\n\nGuidance: Point this out in hail/wind disputes.\n\nNext Step: Escalate with GAF guide.\n\nQ658 – What’s the rule for siding lock mismatch?\n\nKnowledge: Siding Argument.docx states different lock profiles prevent proper installation.\n\nGuidance: Show mismatched lock photos.\n\nNext Step: Escalate with siding doc.\n\nQ659 – What does iTel siding test show?\n\nKnowledge: iTel Template.docx confirms siding brand, color, profile, and availability.\n\nGuidance: Use for siding mismatch arguments.\n\nNext Step: Escalate if adjuster denies iTel findings.\n\nQ660 – Why can’t old flashing be reused?\n\nKnowledge: Flashing Codes.docx prohibit reuse due to deformation and corrosion.\n\nGuidance: Explain reused flashing leads to leaks.\n\nNext Step: Provide close-up photos + code.\n\n\n\nQ661 – What’s the purpose of complaint escalation?\n\nKnowledge: Complaint Forms.docx allow regulator enforcement when carrier ignores law.\n\nGuidance: Use when carrier delays >30 days.\n\nNext Step: File complaint with state.\n\nQ662 – What does MD code say about weather barrier?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx requires continuous weather barrier under siding.\n\nGuidance: Cite when wrap is omitted.\n\nNext Step: Escalate denial with code.\n\nQ663 – Why can’t repairs restore pre-loss condition?\n\nKnowledge: GAF Storm Damage Guidelines.pdf note damaged shingles compromise performance permanently.\n\nGuidance: Use to counter “repairable” arguments.\n\nNext Step: Escalate with GAF doc.\n\nQ664 – What does VA code say about ventilation?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require 1:150 vent area ratio unless balanced system is installed.\n\nGuidance: Use to justify vents.\n\nNext Step: Escalate if carrier excludes ventilation.\n\nQ665 – What’s the rule on drip edge?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require drip edge at eaves and rakes.\n\nGuidance: Point this out if excluded.\n\nNext Step: Escalate with photo + code.\n\nQ666 – Why does hail bruise matter?\n\nKnowledge: GAF Storm Damage Guidelines.pdf describe bruising as mat fracture leading to leaks.\n\nGuidance: Demonstrate with pressure test photos.\n\nNext Step: Attach GAF guide in rebuttal.\n\nQ667 – What’s the rule on multiple roof layers?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx prohibit >2 layers of shingles.\n\nGuidance: Document # of layers.\n\nNext Step: Escalate if carrier suggests overlay.\n\nQ668 – What does code say about starter strips?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require starter course along eaves.\n\nGuidance: Use if excluded from estimate.\n\nNext Step: Escalate with code doc.\n\nQ669 – Why are manufacturer warranties voided by improper repairs?\n\nKnowledge: GAF Storm Damage Guidelines.pdf make this clear.\n\nGuidance: Always attach warranty doc in disputes.\n\nNext Step: Escalate warranty void argument with GAF doc.\n\nQ670 – What’s the rule for valley liners?\n\nKnowledge: Flashing Codes.docx require liners under open valleys.\n\nGuidance: Cite when excluded.\n\nNext Step: Escalate with code reference.\n\n\n\nQ671 – What does MD matching law cover?\n\nKnowledge: Maryland Matching Requirement.pdf applies to both siding and roofing.\n\nGuidance: Cite law when partial approval granted.\n\nNext Step: Escalate with regulator complaint.\n\nQ672 – Why are ridge caps critical?\n\nKnowledge: GAF Storm Damage Guidelines.pdf say ridge caps are most vulnerable to wind/hail.\n\nGuidance: Highlight cracked/missing ridge caps.\n\nNext Step: Escalate with ridge photos.\n\nQ673 – What’s the VA code rule on re-nailing decking?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require fastening to code spacing during reroof.\n\nGuidance: Use when decking is exposed.\n\nNext Step: Escalate if carrier denies re-nailing.\n\nQ674 – Why do lock mismatches fail siding installation?\n\nKnowledge: Siding Argument.docx explains profile mismatch prevents interlock.\n\nGuidance: Show failed connection photos.\n\nNext Step: Escalate with siding doc.\n\nQ675 – What’s the rule for skylight flashing?\n\nKnowledge: Flashing Codes.docx require complete flashing kit replacement with reroof.\n\nGuidance: Cite when carrier omits.\n\nNext Step: Escalate with photo evidence.\n\nQ676 – Why are photo reports structured?\n\nKnowledge: Photo Report Template.docx ensures consistent slope, close-up, and overview photos.\n\nGuidance: Follow it exactly.\n\nNext Step: Escalate with template if adjuster disputes photos.\n\nQ677 – What’s the function of ice & water shield?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require it for waterproofing in vulnerable areas.\n\nGuidance: Present as code upgrade.\n\nNext Step: Escalate if omitted.\n\nQ678 – What does MD code say about siding overlaps?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx specifies minimum overlaps for weatherproofing.\n\nGuidance: Use if carrier approves shortcuts.\n\nNext Step: Escalate denial with code.\n\nQ679 – Why do brittle shingles fail repairs?\n\nKnowledge: GAF Storm Damage Guidelines.pdf say brittle shingles crack during lifting.\n\nGuidance: Use repair attempt to prove.\n\nNext Step: Escalate failed repair attempt with photos.\n\nQ680 – What’s the rule for chimney cricket?\n\nKnowledge: Flashing Codes.docx require crickets for chimneys >30” wide.\n\nGuidance: Cite when carrier omits.\n\nNext Step: Escalate with code + chimney photo.\n\n\n\nQ681 – What’s the purpose of state complaint forms?\n\nKnowledge: Complaint Forms.docx ensure regulator oversight of carriers.\n\nGuidance: Use if delays exceed timelines.\n\nNext Step: File with state insurance regulator.\n\nQ682 – What are PA’s roofing code basics?\n\nKnowledge: Pennsylvania code (from Virginia doc adaptation if uploaded) requires ice/water shield and tear-off rules.\n\nGuidance: Apply same standards as VA/MD.\n\nNext Step: Escalate with state code citation.\n\nQ683 – What does GAF say about thermal splitting?\n\nKnowledge: GAF Storm Damage Guidelines.pdf list thermal splitting as a defect requiring replacement.\n\nGuidance: Document splits clearly.\n\nNext Step: Escalate with manufacturer doc.\n\nQ684 – Why is decking inspection required?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require inspection for rot before reroof.\n\nGuidance: Take decking photos during tear-off.\n\nNext Step: Escalate if carrier omits decking repair.\n\nQ685 – What’s the role of manufacturer bulletins?\n\nKnowledge: GAF Requirement – Slope Replacement.pdf and others are binding manufacturer rules.\n\nGuidance: Always attach them to disputes.\n\nNext Step: Escalate with bulletin copy.\n\nQ686 – What’s the MD law on uniformity of siding?\n\nKnowledge: Maryland Matching Requirement.pdf requires uniformity across visible surfaces.\n\nGuidance: Show visible mismatch photos.\n\nNext Step: File complaint if denied.\n\nQ687 – Why are sealant bonds critical?\n\nKnowledge: GAF Storm Damage Guidelines.pdf say bonds prevent wind uplift.\n\nGuidance: Use to explain functional damage.\n\nNext Step: Escalate with manufacturer guideline.\n\nQ688 – What’s required for flashing around sidewalls?\n\nKnowledge: Flashing Codes.docx require step flashing at wall intersections.\n\nGuidance: Cite when omitted.\n\nNext Step: Escalate with photo + code.\n\nQ689 – Why can’t overlay be approved on brittle shingles?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx prohibit overlays on deteriorated shingles.\n\nGuidance: Use in brittle roof cases.\n\nNext Step: Escalate with photo + code.\n\nQ690 – What does VA code say about underlayment type?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require ASTM-compliant underlayment.\n\nGuidance: Cite if carrier omits upgrade.\n\nNext Step: Escalate with code citation.\n\n\n\nQ691 – Why can’t hail-damaged shingles be reused?\n\nKnowledge: GAF Storm Damage Guidelines.pdf classify impact damage as permanent.\n\nGuidance: Document bruising as functional.\n\nNext Step: Escalate with manufacturer guide.\n\nQ692 – What’s the rule for kickout flashing?\n\nKnowledge: Flashing Codes.docx require kickout flashing at roof-wall intersections.\n\nGuidance: Cite if omitted.\n\nNext Step: Escalate with photos.\n\nQ693 – Why does MD require siding wrap?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx says it prevents moisture intrusion.\n\nGuidance: Show wrap as mandatory upgrade.\n\nNext Step: Escalate with code doc.\n\nQ694 – What’s the rule on starter strip adhesion?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require adhesive starter strips.\n\nGuidance: Point this out if omitted.\n\nNext Step: Escalate with code language.\n\nQ695 – What does GAF say about slope replacement vs patching?\n\nKnowledge: GAF Requirement – Slope Replacement.pdf requires slope replacement if damaged.\n\nGuidance: Use in patching disputes.\n\nNext Step: Attach manufacturer doc.\n\nQ696 – Why can’t siding color be mismatched?\n\nKnowledge: Siding Argument.docx states mismatches are “readily noticeable.”\n\nGuidance: Show side-by-side photo evidence.\n\nNext Step: Escalate with siding doc.\n\nQ697 – What’s the rule on multiple reroofs?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx limit reroof layers.\n\nGuidance: Document existing layers.\n\nNext Step: Escalate with photo + code.\n\nQ698 – Why does hail void warranties?\n\nKnowledge: GAF Storm Damage Guidelines.pdf state hail impact breaks seals and voids coverage.\n\nGuidance: Use this when carrier says cosmetic.\n\nNext Step: Escalate with guideline.\n\nQ699 – What’s the MD law on roofing uniformity?\n\nKnowledge: Maryland Matching Requirement.pdf requires uniform repair across slope.\n\nGuidance: Cite in partial approvals.\n\nNext Step: Escalate with complaint.\n\nQ700 – What’s the rule on attic ventilation verification?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require intake/exhaust balance checked during reroof.\n\nGuidance: Document attic vents.\n\nNext Step: Escalate if denied.\n\nQ701 – What’s the purpose of drip edge?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require drip edge at rakes and eaves to prevent water intrusion.\n\nGuidance: Point this out when missing from carrier scope.\n\nNext Step: Escalate with photo + code reference.\n\nQ702 – Why can’t shingles be spliced mid-slope?\n\nKnowledge: GAF Requirement – Slope Replacement.pdf prohibits splice repairs, requiring full slope replacement.\n\nGuidance: Explain splices break seal integrity.\n\nNext Step: Escalate with manufacturer doc.\n\nQ703 – What are MD siding overlap rules?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx requires proper lap joints for weather barrier.\n\nGuidance: Cite during siding disputes.\n\nNext Step: Escalate with code reference.\n\nQ704 – Why must ridge vents be replaced in reroofs?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require proper ventilation replacement.\n\nGuidance: Point this out when excluded.\n\nNext Step: Escalate with attic photos.\n\nQ705 – What’s the rule on chimney cricket construction?\n\nKnowledge: Flashing Codes.docx require crickets for chimneys >30” wide.\n\nGuidance: Show chimney dimensions if denied.\n\nNext Step: Escalate with code doc.\n\nQ706 – What does GAF say about “functional damage”?\n\nKnowledge: GAF Storm Damage Guidelines.pdf define it as damage reducing roof performance.\n\nGuidance: Use in hail/wind disputes.\n\nNext Step: Attach GAF guide.\n\nQ707 – Why can’t old siding locks be reused?\n\nKnowledge: Siding Argument.docx states locks bend and deform after removal.\n\nGuidance: Show photos of bent locks.\n\nNext Step: Escalate with siding doc.\n\nQ708 – What’s the role of underlayment code?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require ASTM-compliant underlayment on reroofs.\n\nGuidance: Cite when carrier omits.\n\nNext Step: Escalate with code.\n\nQ709 – Why is ventilation critical to warranty?\n\nKnowledge: GAF Storm Damage Guidelines.pdf note improper ventilation voids warranty.\n\nGuidance: Present to homeowner as necessity.\n\nNext Step: Escalate with GAF doc if denied.\n\nQ710 – What’s required for sidewall flashing?\n\nKnowledge: Flashing Codes.docx require step flashing under shingles at wall intersections.\n\nGuidance: Document missing flashing.\n\nNext Step: Escalate with code doc.\n\n\n\nQ711 – Why do brittle shingles break during repair?\n\nKnowledge: GAF Storm Damage Guidelines.pdf say older shingles lose flexibility and crack.\n\nGuidance: Prove with repair attempt photos.\n\nNext Step: Escalate failed attempt.\n\nQ712 – What does MD law say about partial siding replacement?\n\nKnowledge: Maryland Matching Requirement.pdf prohibits partial siding if not uniform.\n\nGuidance: Show mismatch photos.\n\nNext Step: File complaint if denied.\n\nQ713 – What are valley underlayment rules?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require extra underlayment in valleys.\n\nGuidance: Cite if missing.\n\nNext Step: Escalate with code.\n\nQ714 – Why can’t hail-damaged shingles be sealed?\n\nKnowledge: GAF Storm Damage Guidelines.pdf say sealant doesn’t restore structural integrity.\n\nGuidance: Use in rebuttals.\n\nNext Step: Attach GAF doc.\n\nQ715 – What are VA attic vent rules?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require balanced venting.\n\nGuidance: Document attic conditions.\n\nNext Step: Escalate denial with code.\n\nQ716 – Why must ridge cap shingles match?\n\nKnowledge: GAF Requirement – Slope Replacement.pdf says mismatched ridge voids warranty.\n\nGuidance: Use when carrier substitutes.\n\nNext Step: Escalate with manufacturer doc.\n\nQ717 – What’s required for step flashing replacement?\n\nKnowledge: Flashing Codes.docx require new step flashing on reroof.\n\nGuidance: Point out during disputes.\n\nNext Step: Escalate with code citation.\n\nQ718 – Why can’t siding colors “close enough” be approved?\n\nKnowledge: Siding Argument.docx says any noticeable mismatch violates law.\n\nGuidance: Show visual comparison.\n\nNext Step: File complaint.\n\nQ719 – What does iTel prove for roofing?\n\nKnowledge: iTel Template.docx shows manufacturer, dimensions, and availability.\n\nGuidance: Attach for discontinued claims.\n\nNext Step: Escalate if denied.\n\nQ720 – What are VA reroof tear-off rules?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require tear-off if decking is deteriorated.\n\nGuidance: Document rot.\n\nNext Step: Escalate denial with photos.\n\n\n\nQ721 – Why are granules critical for shingles?\n\nKnowledge: GAF Storm Damage Guidelines.pdf say granules protect asphalt from UV.\n\nGuidance: Explain to homeowner.\n\nNext Step: Use in functional vs cosmetic disputes.\n\nQ722 – What are MD siding water barrier rules?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx requires continuous barrier behind siding.\n\nGuidance: Show missing wrap in disputes.\n\nNext Step: Escalate with code doc.\n\nQ723 – Why must ventilation be verified in reroofs?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx mandate it.\n\nGuidance: Document vents.\n\nNext Step: Escalate if omitted.\n\nQ724 – What’s the rule for chimney flashing kits?\n\nKnowledge: Flashing Codes.docx require full replacement kits.\n\nGuidance: Use when adjuster excludes.\n\nNext Step: Escalate with photos.\n\nQ725 – Why can’t cracked shingles be reused?\n\nKnowledge: GAF Storm Damage Guidelines.pdf state cracked shingles lose integrity.\n\nGuidance: Document with chalk circles.\n\nNext Step: Escalate with manufacturer doc.\n\nQ726 – What does MD matching law mean for siding?\n\nKnowledge: Maryland Matching Requirement.pdf ensures siding must appear uniform.\n\nGuidance: Use when adjuster says “close enough.”\n\nNext Step: File complaint.\n\nQ727 – What are VA flashing valley rules?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require metal or woven valleys.\n\nGuidance: Cite if estimate omits.\n\nNext Step: Escalate with code.\n\nQ728 – Why can’t repairs restore warranty?\n\nKnowledge: GAF Storm Damage Guidelines.pdf state improper repairs void warranty.\n\nGuidance: Always attach GAF doc.\n\nNext Step: Escalate if denied.\n\nQ729 – What are chimney cricket codes?\n\nKnowledge: Flashing Codes.docx require for wide chimneys.\n\nGuidance: Document chimney size.\n\nNext Step: Escalate with code.\n\nQ730 – Why do mismatched siding panels fail resale?\n\nKnowledge: Siding Argument.docx explains mismatches reduce property value.\n\nGuidance: Share with homeowners.\n\nNext Step: Escalate with siding doc.\n\n\n\nQ731 – What’s the rule for step flashing reuse?\n\nKnowledge: Flashing Codes.docx prohibit reuse.\n\nGuidance: Show old flashing damage.\n\nNext Step: Escalate with photo + code.\n\nQ732 – Why must underlayment be ASTM-rated?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require ASTM D226/D4869 underlayment.\n\nGuidance: Cite in disputes.\n\nNext Step: Escalate with code doc.\n\nQ733 – What’s the MD law on roofing uniformity?\n\nKnowledge: Maryland Matching Requirement.pdf requires uniform slope repairs.\n\nGuidance: Cite when partial is approved.\n\nNext Step: Escalate with complaint.\n\nQ734 – Why are GAF docs important?\n\nKnowledge: GAF Storm Damage Guidelines.pdf are industry standard.\n\nGuidance: Always attach in disputes.\n\nNext Step: Escalate with manufacturer doc.\n\nQ735 – What are VA decking repair rules?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require decking replacement when damaged.\n\nGuidance: Document rot photos.\n\nNext Step: Escalate with code.\n\nQ736 – Why can’t siding profiles be mixed?\n\nKnowledge: Siding Argument.docx states lock/profile mismatch voids installation.\n\nGuidance: Show misfit panels.\n\nNext Step: Escalate.\n\nQ737 – What’s the rule for ventilation ratio?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require 1:150 or 1:300 with vapor barrier.\n\nGuidance: Cite when venting is inadequate.\n\nNext Step: Escalate with code doc.\n\nQ738 – Why do brittle repairs fail?\n\nKnowledge: GAF Storm Damage Guidelines.pdf note cracked mats spread damage.\n\nGuidance: Use repair attempt photos.\n\nNext Step: Escalate with template.\n\nQ739 – What’s required for chimney counter-flashing?\n\nKnowledge: Flashing Codes.docx require embedding into mortar joints.\n\nGuidance: Document missing counter-flashing.\n\nNext Step: Escalate with photo + code.\n\nQ740 – Why is uniformity key in siding law?\n\nKnowledge: Maryland Matching Requirement.pdf ensures siding must not be visibly different.\n\nGuidance: Show homeowner mismatch risks.\n\nNext Step: Escalate with complaint.\n\n\n\nQ741 – What’s VA rule on ridge caps?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require ridge caps installed to spec.\n\nGuidance: Cite if omitted.\n\nNext Step: Escalate with code.\n\nQ742 – Why are cracked shingles irreparable?\n\nKnowledge: GAF Storm Damage Guidelines.pdf classify cracks as functional damage.\n\nGuidance: Document clearly.\n\nNext Step: Escalate with manufacturer doc.\n\nQ743 – What are MD siding fastening rules?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx specifies nail spacing for siding.\n\nGuidance: Use in disputes.\n\nNext Step: Escalate denial with code.\n\nQ744 – Why can’t “close color” siding be used?\n\nKnowledge: Siding Argument.docx states law requires uniform color.\n\nGuidance: Show contrast photos.\n\nNext Step: File complaint.\n\nQ745 – What’s required for valley flashing replacement?\n\nKnowledge: Flashing Codes.docx require new valley flashing during reroof.\n\nGuidance: Cite when excluded.\n\nNext Step: Escalate.\n\nQ746 – Why is decking inspection mandatory?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require inspection after tear-off.\n\nGuidance: Document decking condition.\n\nNext Step: Escalate if denied.\n\nQ747 – What’s the rule for siding joints?\n\nKnowledge: Maryland Exterior Wrap Code R703.docx require staggered joints.\n\nGuidance: Cite during siding disputes.\n\nNext Step: Escalate with code.\n\nQ748 – Why do GAF docs help win claims?\n\nKnowledge: GAF Storm Damage Guidelines.pdf carry manufacturer authority.\n\nGuidance: Attach in hail/wind cases.\n\nNext Step: Escalate if carrier ignores.\n\nQ749 – What are VA roof slope requirements?\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx require minimum slope for shingles.\n\nGuidance: Cite for low-slope disputes.\n\nNext Step: Escalate with code.\n\nQ750 – Why do regulators enforce matching law?\n\nKnowledge: Maryland Matching Requirement.pdf protects consumer property value.\n\nGuidance: Use this when explaining to homeowners.\n\nNext Step: File complaint if denied.\n\n",
  "textLength": 34110,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}