{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Insurance Argument Resources/Maryland Exterior Wrap Code R703.docx",
  "name": "Maryland Exterior Wrap Code R703.docx",
  "type": "docx",
  "size": 9261,
  "relativePath": "Insurance Argument Resources/Maryland Exterior Wrap Code R703.docx",
  "category": "pushback_strategies",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:59:07.884Z",
  "extractedText": "The 2018 IRC\n\nChapter 7 Wall Covering \n\nR703.1 General. Exterior walls shall provide the building with a weather-resistant exterior wall envelope. The exterior wall envelope shall include flashing as described in Section R703.4.\n\nR703.1.1 Water resistance. The exterior wall envelope shall be designed and constructed in a manner that prevents the accumulation of water within the wall assembly by providing a water-resistant barrier behind the exterior veneer as required by Section R703.2 and a means of draining to the exterior water that enters the assembly.\n\nImportance of Moisture Management \n\nR703.2 Water-resistive barrier. One layer of No. 15 asphalt felt, free from holes and breaks, complying with ASTM D226 for Type I felt or other approved water-resistive barrier shall be applied over studs or sheathing of all exterior walls. Such felt or material shall be applied horizontally, with the upper layer lapped over the lower layer not less than 2 inches (51mm). Where joints occur, felt shall be lapped not less than 6 inches (152mm). The felt or other approved material shall be continuous to the top of walls and terminated at penetrations and building appendages in a manner to meet the requirements of the exterior wall envelope as described in Section R703.1.\n\nR703.4 Flashing. Approved corrosion-resistant flashing shall be applied shingle-fashion in a manner to prevent the entry of water into the wall cavity or penetration of water to the building structural framing components. Self-adhered membranes used as flashing shall comply with AAMA (Ameri-can Architectural Manufacturers Association) 711. Fluid-applied membranes used as flashing in exterior walls shall comply with AAMA 714. The flashing shall extend to the surface of the exterior wall finish. Approved corrosion-resistant flashings shall be installed at:\n\nExterior window and door openings. Flashing at exterior window and door openings shall extend to the surface of the exterior wall finish or to the water-resistive barrier complying with Section R703.2 for subsequent drainage. Mechanically attached flexible flashings shall comply with AAMA 712.\n\nR703.7.3 Water-resistive barriers. Water-resistive barriers shall be installed as required in Section R703.2 and, where applied over wood-based sheathing, shall include a water-resistive vapor-permeable barrier with a performance at least equivalent to two layers of Grade D paper. The individual layers shall be installed independently such that each layer provides a separate continuous plane and any flashing (installed in accordance with Section R703.4) intended to drain to the water-resistive barrier is directed between the layers.\n\nExceptions:\n\nWhere the water-resistive barrier that is applied over wood-based sheathing has a water resistance equal to or greater than that of 60-minute Grade D paper and is separated from the stucco by an intervening, substantially non-water-absorbing layer or designed drainage space.\n\n\n\n",
  "textLength": 2968,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}