{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Merged_PDFs_1.pdf",
  "name": "Merged_PDFs_1.pdf",
  "type": "pdf",
  "size": 33936,
  "relativePath": "Merged_PDFs_1.pdf",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:59:50.810Z",
  "extractedText": "Claim Filing Information Sheet\nYou should use this information to prep the HO – Use a blank note on your iPad\nHO: “I’d like to file a claim for hail [and wind] damage” (never only wind)\nInsurance: “What was damaged?”\nRoof\nDownspouts\nGutters\nWindow Wraps\nSiding\nEtc.\nDate of loss\nTime of storm (usually around 5pm)\nSize of hail (usually 1 – 1.5 inches)\nType of shingle and/or siding\nAny interior damage?\nIs the house livable?\nWas there any personal property damaged?\nDid they lose power?\nHave you selected a contractor? (yes, we want them to know ASAP that you are working with me)\nDo they have an estimate? (always no)\nIs your roof steeper than an average staircase?\nHow high is the roof/is it difficult to access with most ladders?\nThings they should do on the call:\nAsk for adjuster info, if not available yet, that’s okay too.\nAlways ask for claim number\nIf Claim Rep wants to schedule the inspection now (only Allstate) – have 3 available times listed out\nfor the HO\nSee example on next page\nExample Customer Info Sheet\n\nLet them know you would like to file a claim for hail and wind damage.\nWhat was damaged: Roof and Aluminum siding\nDate of the storm: September 8th 2023\nTime of the storm: Around 5pm\nSize of hail: 1 inch\nType of shingle: Asphalt\nType of siding: Aluminum\nInterior Damage: Yes, 1 bedroom upstairs\nIs the house livable: Yes\nWas there any personal property damaged: No\nDid they lose power: No\nHave you selected a contractor: Yes, Roof ER out of Vienna VA. All my information is on the\nbusiness card\nDid they give you an estimate: No\nIs your roof steeper than a staircase: No\nHow high is your roof/is it difficult to access with most ladders: No, it has 1 story access\nAfter they say the claim is filed, please ask for the Claim Number\nAfter they provide that, ask if an adjuster has been assigned\n\nContingency & Claim Authorization\nAfter the claim: “Okay, perfect! Like they said, an adjuster will be reaching out to you in the next 24\nto 48 hours to schedule the inspection. The absolute most important part of this process is that I am\nat this inspection. Insurance companies don’t want to pay out. They are trying to mitigate their\nlosses after storms. I am there as your representation to make sure you get a fair shake.\nTurn the iPad so you and the homeowner can see. \n“This basic/simple agreement backs you as the homeowner by guaranteeing you that your only cost\nwill be your deductible if we get you fully approved. If it is a partial approval or denial, first we will\nfight and jump through the necessary hoops to turn that into a full approval; but if we are not able to\nget you fully approved, this contract is null and void and you do not owe us a penny.”\n“What’s in it for us, is we just want to get to do the work. This agreement commits you to using us if\nwe hold up our end of the bargain and achieve a full-approval.”\nYou sign\nThey sign\n“This next form is our Claim Authorization form. Very simple, it allows us to communicate with your\ninsurance company. I’ll be here for the inspection and we will also communicate with them through\nemail and phone calls so you don’t have to be a middle-man. Of course, I’ll always keep you looped\nin with our communication by CCing you in all emails and updating you on any conversations we\nhave.\nThey sign\nPress Submit enter password “roofer” if it asks.\n“Alright, we are all set! Again, the most important part of this process is that I am here when the\ninsurance company comes out. Ideally you can have them call me to schedule that directly. If they\ncall me, great! But, regardless, please get the adjuster’s information (name, email, phone number)\nand send that over to me so that I can communicate with them before the inspection. If they insist\non scheduling with you, go ahead and pencil in a time and avoid these times and days [provide your\nschedule]\nAnswer any questions that the HO may have\n“Thank you, sir/ma’am, looking forward to seeing you on the day of inspection, you have my contact\ninformation on my card if you need anything else.\n\nFull Approval Estimate Phone Call\nThis is the call you will make to your HO as soon as you receive the estimate\n“Hello sir/ma’am! It’s [YOUR NAME] with Roof ER. Congratulations, I am glad we were able to\nensure that your insurance company fully approved your roof/siding/gutters/etc replacement!\n“So the next steps are, as I mentioned last time we met:\n“One of our Project Coordinators will be reaching out to you to schedule a Project Meeting to go\nover your full scope of work.\n“Based on the estimate, your insurance company will be sending you [ACV AMOUNT] shortly. This\nwill be used as your down payment. With that, we can start all of your work! When they send you\nthat check, just hold on to it until your meeting with our Project Coordinator who will help with all the\nnext steps.\n“Our estimating team will also be sending in supplements to the insurance company based on items\nthey may have missed. This includes Code Items such as IWS and Drip Edge. And don’t worry!\nEven if for some reason they do not approve these amounts, we will still do all the necessary work\nand never charge you for it. As we talked about earlier, your only cost out of this will be your\ndeductible once we finish all the work.\n“Upon completion of the installation, we will review and inspect all of our work to ensure it is to your\nsatisfaction. Then we will send in a completion form once you sign off on the complete project.\nThat’s when the insurance company will release the remaining funds minus your deductible. So\nyour final payment will only be those funds plus your deductible.\n“Any questions so far, sir/ma’am?”\nAnswer any questions\n“Great! Again, I am glad that we were able to make this happen for you, now you get to experience\nthe quality that Roof ER always delivers, at only the cost of your deductible after your whole project\nis complete!” Potentially mention additional work that they may want to add.\nAnswer any additional questions or engage in any conversation the HO starts.\n“Also, if you know anyone else that I can help, have them reach out to me! You have my card - they\ncan call, text, or email me and I can inspect their property to see if they have the same qualifying\ndamage and I can walk them through the same process I have walked you through!\nEngage in any conversation that this starts\n“Awesome!\nIf you haven’t already put up a yard sign: “Would you mind if I put up a yard sign next time I’m in\nyour area? This will definitely help other companies already know that you’re working with someone\nand hopefully eliminate anyone else from knocking your door asking about your roof/siding.”\n“Look out for the communication from one of our Project Coordinators so you can get that Project\nMeeting scheduled to go over all the next steps and your full scope of work. Congratulations again\nand have a great day!”\n\nInitial Pitch\n5 Non-negotiables with every pitch\nWho you are\nWho we are and what we do (Roof ER)\nMake it relatable\nWhat you’re there to do (an inspection)\nGo for the close (them agreeing to the inspection)\nKnock on door/ring doorbell\nAs they are opening the door, smile and wave.\n“Hi, how are you? My Name is ________ with Roof- ER we’re a local roofing company that\nspecializes in helping homeowners get their roof (and siding) replaced, paid for by their insurance!”\nGeneric:\n“We’ve had a lot of storms here in Northern Virginia/Philadelphia/Maryland over the past few\nmonths that have done a lot of damage!\n“We’re already working with your neighbors. We’ve been able to help them get fully approved\nthrough their insurance company to have their roof and/or siding replaced.”\n(Go to line marked with ^)\n-OR-\nSpecific\n“Were you home for the storm we had in ___. Wait for answer\nIf yes “It was pretty crazy right?! Wait for answer\nIf no: “Oh no worries at all, we get that all the time.\nIf yes move on to next line marked with *\nIf no “That’s good! It was a pretty bad one!”\n*“We’re working with a lot of your neighbors in the area. We’ve been able to help them get fully\napproved through their insurance company to have their roof (and siding) replaced.”\n^“While I’m here, in the neighborhood, I am conducting a completely free inspection to see if you\nhave similar, qualifiable damage. If you do, I’ll take a bunch of photos and walk you through the rest\nof the process. If you don’t, I wouldn’t want to waste your time, I wouldn’t want to waste mine! I will\nat least leave giving you peace of mind that you’re in good shape.”\nOnce they agree to let you do the inspection:, “Alright! It will take me about 10 - 15 minutes. I’m\ngonna take a look around the perimeter of your home, then grab the ladder, and take a look at your\nroof.\n\nGo in for a handshake. What was your name again? [Their name] great to meet you, again I am\n(your name). Oh and by the way do you know who your insurance company is”? Wait for their\nanswer, “Great! We work with those guys all the time.”\n“Here’s my card/flier, look us up while I’m conducting the inspection! I will give you a knock when I\nfinish up and show you what I’ve found.”\nWithout any hesitation, move into inspection. (See Inspection and Post-Inspection Script for\ndetailed next steps.)\n\nInspection and Post-Inspection\nInspection - Ideal photo progression \n§Mailbox/House Number\n§Overview of House\n§Front Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Right Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Rear Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Left Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Roof Overview Collateral\n§Damage to roof metals and other collateral on the roof\n§Circle Hail Hits & Slash Wind Damage (close up of each)\n§Overview of majority of the damage chalked up\n§Pictures of granules in the gutters or at the bottom of downspouts\n§Entire inspection shouldn’t take any longer than 15-20 minutes. How thorough of an inspection\nyou should do is a judgment call. Getting enough photos to sell the homeowner is most important. It\ndoesn’t matter how quickly you are able to complete the inspection if you don’t have enough\ndamage-photos for the homeowner to be on board with filing the claim.\n§Flashlight\n \\\nPost-Inspection Pitch\nKnock on the door \n“Hey _______, so I have a bunch of photos to show you. First I walked around the perimeter of the\nhouse  to look for collateral damage. I’ll also show you the collateral damage we found on the\nroof.”  Say this while going through through house number and overview photos\nStart showing the pictures of damage to screens, gutters, downspouts, and soft metals\n“While this damage functionally isn’t a big deal, it really helps build a story. Think of us like lawyers\nand this collateral damage is the evidence that builds the case which helps us get the roof (and\nsiding) approved.”\n\nContinue to slide through collateral damage photos\n“Here are the photos of the damage to your shingles. Anything I have circled means its hail damage\n(IF there were any wind damaged shingles or missing shingles say:) and  anything I have slashed\nmeans its wind damage. \nRemain on a photo of hail damage as you explain the following\n“This is exactly what we look for when we're looking for hail damage. If you notice, the divot is\ncircular  in nature.   Even if this damage doesn’t look like a big deal, what happens over time, these\nhail divots fill with water, freeze...., when water freezes it expands and breaks apart the shingle\nwhich will eventually lead to leaks.  That is why your insurance company is responsible and your\npolicy covers this type of damage.” \nStart slowly swiping through all the pictures of hail. \n“As you can see there is quite a bit of damage.  \nStart slowly swiping through all the pictures of hail.  \nIf there was wind damage or missing shingles, say the following:\n“Now here are the wind damaged shingles. You have both shingles that are creased from the wind\nlifting them up and shingles that have completely been blown off.”\nShow the pictures of wind damaged and/or missing shingles (if applicable)\nNow show them pictures of the granules in gutters and downspouts\n“As you can see here, granules have filled up your gutters. These granules are supposed to be\nwhat’s protecting your home. When wind and hail hits your roof, it knocks out these granules which\nreduces the lifespan of your roof.”\n“This is very similar to damage to ________’s home and/or the rest of the approvals we’ve gotten in\nthe area”.  \n“With that being said, insurance companies are always looking for ways to mitigate their losses. It’s\nunfortunate but that’s how they make money. The most important part of this process is that when\nyour insurance company comes out to run their inspection, we are here as storm experts to make\nsure you as a homeowner get a fair shake. If they are missing anything we make sure they see all\nthe damage that I  just showed you.” \n“What I’m going to do now is run to my car, grab my iPad and we can get this process started”! Go\nget iPad \nAs you approach back to the house/homeowner ask “Is there a place we could sit down for 5-10\nMinutes”?\nOnce you are in the house, spend some time building rapport as you get settled. \n“Okay, so first I am going to grab some of your basic information for our system. Then we can let\nyour insurance company know about the damagel”. \nGather information from the homeowner:\nFull name\n\nAddress\nPhone Number  \nE-mail\nInsurance Company\n“Do you happen to know your deductible? If not, no big deal at all”! \nAfter you have collected all the information:\nAsk if they have the app or if they have the login to the website.\nIf not, use the Homeowner Information Sheet to prep the HO. As you are writing or typing the\ninformation for the HO to use on the call, explain each part to them.\nAs much as possible, use HO’s phone to make the call\nReference Claim Filing Information Sheet\nMove on to Contingency & Claim Authorization\n\nPartial Estimate/Denial Phone Call\nThis is the call you will make to your HO as soon as you receive the estimate\n“Hello sir/ma’am! It’s [YOUR NAME] with Roof ER. How’s it going?”\n“Great, well we just received the decision from the insurance company. We’re going to have to take\nsome steps to get this turned around. I have already submitted my photo report that demonstrates\nthe damage to your property and the need to replace your whole roof, so hopefully they review and\napprove that. Could you please reach out to the adjuster to see if they were able to review my\nreport?”\nAfter HO answers. “Thank you! During that call, please let them know that you disagree with their\ncurrent decision and would like to have your property reinspected if they are not able to update their\ncurrent decision to a full approval based on the photo report that I sent them.”\nIf there are some approved shingles:\n“So we will also be conducting an iTel and Repair Attempt.\n“An iTel is where we will take a shingle off your roof and send it in to get tested to verify that it is\ndiscontinued. Since it is discontinued, the only effective way to restore your property would be with\na full roof replacement.\n“At that time, I will also take a video of us removing and replacing that shingle. This Repair Attempt\nvideo will demonstrate to the insurance company that your roof is not repairable and therefore\nwould need to be fully replaced.\n“To get those scheduled, I will need you to sign these 2 documents allowing us to do that. When\nyou see the documents, it will have a cost attached, but don’t worry! Read the bold print and you will\nsee that you, as the homeowner, are never responsible for this cost.”\nSchedule a time to meet with the HO to sign or let them know you will be sending it out for eSign.\nTask the proper people for eSign, if necessary.\n“We will definitely be putting in the work to give you the highest chance of getting this turned\naround. I definitely believe your roof has the damage that warrants a full replacement. But, of\ncourse, insurance companies are billion dollar, publicly traded companies that will try to save as\nmuch money as they can on every claim. That is why it is great that you are working with us since\nwe know the proper steps to ensure that you are adequately taken care of by your insurance\ncompany!”\nAnswer any questions or concerns the HO has.\n“Alright, so let me know how the phone call goes with your adjuster and I’ll start working on my end\nto put everything together to get this turned around. Thank you, sir/ma’am, goodbye!”\n\nPost Adjuster Meeting Script\nThis is the conversation you will have with the HO after an adjuster meeting\nIf moving to Estimate Pending:\n“Great! The Adjuster/Ladder Assist identified all the same damage as me. You will be receiving an\nemail from us shortly saying that you’ve been fully approved. Within a few days you should receive\nthe itemized estimate from the Insurance Company. Once you receive that, you can forward that to\nme. This is going to include every line item that the insurance company believes is needed to make\nyou whole again. To you this is going to look like gibberish. But, don’t worry, that’s what we’re here\nfor. If for some weird reason the desk adjuster does not write it for a full approval after this\ninspection, I will take the steps necessary to get it turned around! Any questions on that,\nsir/ma’am?”\nAnswer any questions\n“When the insurance company generates their estimate, it will also typically trigger the release of\nthe first payment. The insurance company refers to this payment as the ACV. Which stands for\nActual Cash Value. That amount will be used as your down payment. The remaining funds are held\nby the insurance company until we complete the work. They refer to these remaining funds as\nDepreciation. Which is not “depreciation” as most would think about it, it’s just their way of holding\non to some of the funds to make sure the work gets done.\n“At the same time our office will be reviewing your entire project along with my photos and the\ninsurance estimate. As I’ve mentioned, insurance companies are always trying to save money. We\nusually find specific line items that are missing. Most commonly, code items like IWS and Drip\nEdge. We will supplement for all the items needed to complete your project to code and our\nmanufacturer’s specifications. Don’t worry, like we have agreed to from the beginning, we\nguarantee you that you would not have to cover any of these costs even if the insurance company\nwere to deny our supplement. [Which does not happen.]\n“Once our office has completed your job review, which takes 2 - 3 business days, your job will be\nassigned to one of our Project Coordinators. They will reach out to schedule a project meeting\nwhere they will walk you through all of the finer details. This is the fun part where you will get to pick\nour products and colors. *Of course if you have anything else you would like us to do beyond the\ninsurance approval, your Project Coordinator could price that out for you.*\n“Your install date will typically be 4 - 6 weeks after your Project Meeting. After you submit that initial\npayment from the insurance company, we’ll reach out to get your project scheduled!\n“I know that was a lot of information. The most important thing from here is forwarding the estimate\nas soon as you get it. Of course if you have any questions in the meantime, please feel free to\nreach out.\nAnswer any questions that they may have.\n“A great way for me to help assist some of your neighbors, would be if I could put up a yard sign!\nWould you mind if I put one up? Thank you, sir/ma’am!”\nSubmit your Photo Report and Claim Authorization to the adjuster with an effective email. Use\nPost-AM-Email-Template if you need to.\nIf moving to Decision Pending:\n“So, we just finished our inspection. The Adjuster/Ladder Assist will be sending their report to a\ndesk adjuster and will be making a final decision. Once they make a decision, they will write up an\n\nitemized estimate and should send that over to you. Once you receive that, please forward that over\nto me. They can be a bit hard to read, so I’ll be able to walk through all of that with you.\n“If it comes back as anything other than a full approval, I’ll take the necessary steps to make sure it\ngets turned around! There are a lot of steps we can take from here, which we can go over once we\nreceive the estimate.\n“I will go over all this information again once we receive the estimate and have a more clear picture\nof what the next steps will be.”\nAnswer any questions they may have\n“Great! So, if you have any questions between now and when you get your estimate, please reach\nout! And, again, once you receive that from the insurance company, forward that over to me so I\ncan review that with you. Thank you sir/ma’am! Have a great day!”\nSubmit your Photo Report and Claim Authorization to the adjuster with an effective email. Use\nPost-AM-Email-Template if you need to.\n\nSales Operations and Tasks\nQuick Tip: Press CTRL + F and type in what you are looking for in the search bar. (for example:\ntype “Appraisal”)\nSending Documents for e-sign iTel / Repair Attempt\nTask Brandon Pernot (operations assistant) during Business Hours\nReach out to and/or Task Danny or Brandon Pernot after Business Hours\nIf sending Itel or Repair Attempt, must have:\nCurrent partial estimate\nPhotos\n(see the section titled: Creating iTel, Repair Attempt, and Tarp Agreements below)\nOnce Customer signs iTel / RA Agreement - Tag Brandon Pernot and he will create Task to get a\nField Technician scheduled\nCustomer needs Tarp\nCreate Tarp Agreement and have customer sign (see the section titled: Creating iTel, Repair\nAttempt, and Tarp Agreements below)\nCollect payment from customer\nIf check/cash - bring it to the office\nIf credit card - Task Ford to send qb link to customer for tarp payment\nTag Reese once customer has signed and you received payment\nWe will create task to get FT scheduled for tarp\nNeed a Repair Estimate\nTask Danny\nRequesting a job to be reviewed or to go to Appraisal or Public Adjuster\nMessage (Not Task) Reese on the job you would like reviewed\nRequesting a job be reviewed to go to TAG Reese on the job you would like reviewed\nIf you believe a job is dead\nTag Reese on the message board for the job\nIf you need a customer job file to be created in the Field Portal\nYou must have the following:\nFull name\n\nEmail\nAddress\nPhone Number\nTH/SFH\nTask Brandon Pernot\nIf you have production/operations related questions\nTask and Tag Ford\nIf you need a job reviewed for Retail/Insurance Conversion\nTAG Reese on the message board and he will create the proper task for Ford\nIf you have general questions about estimates, denials, partials, reinspect, or any job stage before\ninstall\nTag Reese, Danny, and/or Brandon Pernot\nIf you need immediate assistance to answer a customer’s questions about product, warranty,\npricing, etc and you are unsure how to answer\nIn a group text, text Ford, Reese, and Oliver the question, one of them should be able to get to you\nquickly\nIf 1 minute passes and you do not have an answer Call Ford, Reese, Oliver, PC’s, or Trainers\nFull Approvals must have\nPhotos\nHover\nIf you submit estimate to Amber and do not have photos and hover yet, she will not move forward\nwith Project Review\nOnce you upload photos/hover, Tag Amber to let her know\nPinning Homes\nYou should pin every home that you knock\nUnder the Leads page of the Field Portal App on your phone, you will press the arrow at the top\nright of the screen to pull up the map\nHere, you will long press on a home and then fill out the information you have\nStatus is the only required field (it is a drop down menu)\nSee screenshots below\nSigning up a new customer\n\nEnter all required fields on Sales App using the iPad\nAfter HO files claim, enter Claim Number\nPress Proceed to Agreement ONCE ONLY (if nothing happens, wait at least a minute before\nattempting to press it again - simply because nothing happens immediately, it does not mean that\nyou did not press the button, the system is just moving slow)\nYou sign Contingency Agreement\nFor roof and aluminum siding sign up, write “Full replacement value claim = Full approval for roof\nand/or siding”\nHO signs Contingency Agreement and Claim Authorization\nPress Submit\nEnter password roofer if applicable\nSigning up a lead\nWhen a lead is already in your portal under Inspection Pending\nDO NOT type in all the HO’s information again\nPress the red letters at the top of the screen that says LEADS\nThen you select your customer’s name\nAfter HO files claim, enter Claim Number\nPress Proceed to Agreement ONCE ONLY (if nothing happens, wait at least a minute before\nattempting to press it again - a lot of people think they must not have pressed it, which is why it did\nnot go through, but usually it is not the case, the system is just moving slow)\nYou sign Contingency Agreement\nFor roof and aluminum siding sign up, write “Full replacement value claim = Full approval for roof\nand/or siding”\nHO signs Contingency Agreement and Claim Authorization\nPress Submit\nEnter password roofer if applicable\nSee screenshot below\nCreating iTel, Repair Attempt, or Tarp Agreements\nClick the words Switch Agreement at the bottom right of the screen\nSelect needed agreement (Itel, Repair Attempt, or Tarp)\nDO NOT enter in the customer’s information again\nPress Existing Customers at the top right of the screen\n\nFill out additional information at the bottom of the page\nPlease reach out to Reese, Danny, or your trainer if you need additional assistance with this bottom\nsection\nPress Proceed to Agreement\nYou sign Agreement\nCustomer signs Agreement\nFor iTel and Repair Attempt make sure to let HO know that they are never responsible for the cost\nthat appears on the agreement (read the bold section of the agreement)\nFor Tarp make sure to let HO know to submit payment first, but they will be reimbursed by the\ninsurance company\nSee section above titled: “Customer needs Tarp”\nUploading Missing Documents\nIf you notice that the job file for your customer is missing Contingency or Claim Authorization do the\nfollowing:\nOpen the Sales App\nClick the documents button (folder) at the bottom left of the screen\nScroll until you see your customer\nPress the upload button next to each of the forms that you need uploaded (button looks like a cloud\nwith an up arrow inside of it)\nFilming Repair Attempt Video\nBefore you begin filming, ask the Field Tech (Francisco or Ishmael) to point out which of the\nsurrounding shingles will be affected by the extraction. Mark the damaged tab (if applicable) and\nmark the bottom right corner with chalk of every shingle the Field Tech points out.\nBefore you begin filming; take a before shot of the area where you will be extracting the shingle.\nStart recording, “...Here we are at [HOMEOWNER’S HOUSE] performing a repair attempt on this\nstorm damaged shingle. As you can see I have pre-marked every tab that will sustain unavoidable\ncreasing due to the brittleness of the roof. Go ahead and get started Francisco/Ishmael”\nFilm the entire area where repair is going to occur, then go from the Wide camera shot to a low\ndown side view camera angle, to show how the shingles get bent back/pried up during the process.\nMake sure to show on camera or explicitly mention the high amount of granule loss running down\nthe roof.\nOnce the new shingle has been installed, hover the camera over the shingles and wipe your hand\nback and forth gently over the top of each tab that was pried up. Trace your finger along the crease\nand show it on camera, explain how each tab has now been mechanically creased and confirms the\nroof failed a “brittle test”.\nOnce you have finished recording your video. Take close-up after pictures of the browns above the\nreplaced shingle. Draw an arrow to where the crease is on the shingle or point to it for the picture.\n\nChecklist for Post-Adjuster Meeting\nPhoto Report Complete\nUpload photo report from photos tab when you have good reception\nHover Complete\nMove Job File\nMost jobs should go to Estimate Pending (make sure to look at next item on this check list - very\nimportant when moving a job to Estimate Pending)\nJobs that you think are partial or denial will be moved to Decision Pending\nNote: This is the ONLY time you move a job\nPost-Adjuster Meeting Script\nRead it to your customer if you have to - much better than missing something\nMain emphasis should be for them to send you the estimate once they receive it\nPost-Adjuster Meeting Email\nPlease send Claim Authorization (and photo report when needed) to the adjuster after the AM. Start\nwith the Post AM Email Template\nPlease make sure all of these things are complete before the end of the day of an Adjuster Meeting\nPartials/Reinspects/Moving jobs\nSee above for when you should move a job to Decision Pending or Estimate Pending\nA job will be automatically moved for you after you submit the full approval, partial estimate, or\ndenial letter (Do not move the job yourself to another stage here!)\nFor your jobs that are partial or denials - they will automatically be moved to one of two stages:\nPartial - Approval\nReinspection - Request Pending\nOnce your job is moved and you have a clear plan, make sure to execute\niTel\nRA\nReinspect\nCustomer Complaint Form\nEtc\nOnce you complete one of the above tasks:\n\nIf your job was in Partial - Approval, move job to Partial Pending - which will let the customer know\nthat you have sent in your arguments and are awaiting additional communication or potentially an\nupdated estimate to full approval\nIf your job was in Reinspection-Request Pending and the adjuster has confirmed they will be\nscheduling a reinspect, move job to Reinspection Pending\nOnce the reinspection has happened, ensure the same tasks that are listed under the Checklist for\nPost-Adjuster Meeting are completed\nIn most cases, the only item not completed there yet would be moving the job back to Decision or\nEstimate Pending",
  "textLength": 29902,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}