{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Merged_PDFs_5.pdf",
  "name": "Merged_PDFs_5.pdf",
  "type": "pdf",
  "size": 7813,
  "relativePath": "Merged_PDFs_5.pdf",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:59:55.215Z",
  "extractedText": "Use email template to Adjuster/Insurance and\nCC or BCC Reese and/or Danny if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPlease refer to Sales Operations and Tasks Document for more detailed explanation of how to\nsuccessfully conduct an RA.\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR THE INSURANCE. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nMAKE SURE TO ATTACH CLAIM AUTHORIZATION AND INCLUDE CLAIM # IN SUBJECT\nPLEASE ALSO INCLUDE BEFORE/AFTER PHOTOS!!!\nCreating iTel, Repair Attempt, or Tarp Agreements\nClick the words Switch Agreement at the bottom right of the screen\nSelect needed agreement (Itel, Repair Attempt, or Tarp)\nDO NOT enter in the customer’s information again\nPress Existing Customers at the top right of the screen\nFill out additional information at the bottom of the page\nPlease reach out to Reese, Danny, or your trainer if you need additional assistance with this bottom\nsection\nPress Proceed to Agreement\nYou sign Agreement\nCustomer signs Agreement\nFor iTel and Repair Attempt make sure to let HO know that they are never responsible for the cost\nthat appears on the agreement (read the bold section of the agreement)\nFor Tarp make sure to let HO know to submit payment first, but they will be reimbursed by the\ninsurance company\nSee section above titled: “Customer needs Tarp”\nUploading Missing Documents\nIf you notice that the job file for your customer is missing Contingency or Claim Authorization do the\nfollowing:\nOpen the Sales App\nClick the documents button (folder) at the bottom left of the screen\nScroll until you see your customer\n\nPress the upload button next to each of the forms that you need uploaded (button looks like a cloud\nwith an up arrow inside of it)\n\\\nFilming Repair Attempt Video\nBefore you begin filming, ask the Field Tech (Francisco or Ishmael) to point out which of the\nsurrounding shingles will be affected by the extraction. Mark the damaged tab (if applicable) and\nmark the bottom right corner with chalk of every shingle the Field Tech points out.\nBefore you begin filming; take a before shot of the area where you will be extracting the shingle.\nStart recording, state the Homeowners name and house number. “...Here we are at\n[HOMEOWNER’S HOUSE at 1234 (street name)] performing a repair attempt on this storm\ndamaged shingle. As you can see I have pre-marked every tab that will sustain unavoidable\ncreasing due to the brittleness of the roof. Go ahead and get started Francisco/Ishmael”\nFilm the entire area where repair is going to occur, then go from the Wide camera shot to a low\ndown side view camera angle, to show how the shingles get bent back/pried up during the process.\nMake sure to show on camera or explicitly mention the high amount of granule loss running down\nthe roof.\nOnce the new shingle has been installed, hover the camera over the shingles and wipe your hand\nback and forth gently or blow over the top of each tab that was pried up. Trace your finger along the\ncrease and show it on camera, explain how each tab has now been mechanically creased and\nconfirms the roof failed a “brittle test”. (picture below)\nOnce you have finished recording your video. Take close-up after pictures of the rows above the\nreplaced shingle. Draw an arrow to where the crease is on the shingle or point to it for the picture.\n(see good examples of after pics below email template)\nTo whom it may concern,\nPlease see the attached video link and photos of the attempted repair for the claim number\n(#__________).\nAs can be clearly seen in the evidence provided, the homeowner's roof sustained additional\ndamage during the attempted repairs. Thus confirming a failed brittle test for the shingles, indicating\nirreparability for the roof as a whole.\nWith this fact established, your current estimate does not adequately address the needs of this roof.\nPerforming further patch repairs as [INSURANCE COMPANY NAME] has suggested will\nunintentionally, yet unavoidably, cause further extensive damage to surrounding shingles.\nTherefore I have gone ahead and attached an estimate that accurately reflects the full scope of\nwork necessary to make our mutual client whole again.\nYouTube Link: (watch this for a good example)\nI also ask that you take note of the attached before and after pictures of the attempted repair. These\nphotos clearly demonstrate the brittleness of this roof, and moving forward with further patch repairs\nwill inevitably do further unavoidable damage to surrounding shingles.\nPlease review these findings and revise your estimate/scope of work accordingly, so we can begin\nto move forward with the full roof replacement for [HOMEOWNER NAME]. If we can provide any\nadditional information, please don't hesitate to reach out.\n\nThank you for your time and for working with us to assist [HOMEOWNER] in restoring their property\neffectively after the loss they have experienced.\n(your signature)\nBefore\nBefore\nBefore\nAfter\n(continue below)\nAfter\nAfter\n\nWhen you need a Hover ESX, XML, or PDF to send to your adjuster, please task Brandon, Danny,\nFord, or Reese to approve your Hover. Please state in your task if it is roof only or roof and siding.\nAfter the Hover is approved, you will receive an email from Hover with the PDF. Once you receive\nthat, it means your Hover is ready (if it is roof and siding, it will take a little bit longer to have the\nsiding added as well.)\nOnce the Hover is complete, you will be able to download your own ESX, XML, or PDF. You will\nalso be able to see if your Hover is still processing and not ready for download yet.\nYou will do this through your internet browser; this can be done on a computer, ipad, or on your\nphone. Go to the website: Hover.to\nOnce you go there, search your customer’s Job ID to find your customer. See the screenshot\nbelow. The Job ID is 6902\nIf you manually created the hover (which you should not be doing) you will have to just search for\nthe customer’s hover that you manually created.\nOnce you open the file, you will click “export”. See screenshot below\nYou will then download the ESX. See screenshot below\nESX is at the very bottom. Once you click that checkbox next to it, press download.\nThe most effective way to get this to your adjuster is to:\nEmail this file to yourself.\nDownload the document(s) on your computer, phone or iPad.\nCompose a new email and send it to your adjuster. (This way you can write the subject, write the\nnote, and it should have your signature at the bottom of the email.)",
  "textLength": 6616,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}