{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Merged_PDFs_4.pdf",
  "name": "Merged_PDFs_4.pdf",
  "type": "pdf",
  "size": 21345,
  "relativePath": "Merged_PDFs_4.pdf",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:59:54.087Z",
  "extractedText": "Use this template to Send to the Adjuster/Insurance when sending in your Repair Attempt Videos\nPLEASE REVIEW AND MAKE EDITS TO MAKE SURE THIS EMAIL FITS YOUR SPECIFIC\nSITUATION BEFORE YOU SEND IT\nPLEASE ATTACH CLAIM AUTHORIZATION AND MAKE SURE TO INCLUDE CLAIM # IN\nSUBJECT LINE\nEDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern,\nPlease see the attached video link and photo report of the attempted repair for the claim number\n[#_____]. As can be clearly seen in the video and pictures, the homeowner's roof sustained\nadditional damage during the attempted repairs. This confirms a failed brittle test for the shingles,\nindicating irreparability.\nWith this fact established, your estimate as it currently stands would not actually fix the damages,\nbut would in fact further compromise the integrity of the roof as a whole. Therefore I have gone\nahead and attached an estimate below that accurately reflects the full scope of work necessary to\nmake our mutual client whole again.\nYouTube Link:\n↓[USE THIS PARAGRAPH ONLY IF YOU HAVE BEFORE AND AFTER PICTURES]↓\nI also ask that you take note of the before and after pictures of the attempted repair. Due to the\nbrittleness of the roof in general, during the repair the two rows of shingles above the one we were\nattempting to replace sustained unavoidable mechanical creasing. These photos clearly\ndemonstrate the brittleness of this roof, and moving forward with further patch repairs will inevitably\ndo further damage to surrounding shingles.\n1. These can be seen in the updated photo report under the \"Brittle Test\" section, and best shown\nin Photos:(___)\nOR\n2. Please find these photos attached below.\nI kindly ask that you review these findings and revise your estimate/scope of work accordingly, so\nwe can begin to move forward with the necessary full [Roof AND/OR Siding] replacement to restore\nour mutual client's property to pre-storm condition.\nIf we can provide any additional information, please don't hesitate to reach out.\nThank you for your time and for working with us to assist [HOMEOWNER’S NAME] in restoring their\nproperty effectively after the loss they have experienced.\n[YOUR SIGNATURE]\n\nUse this template to Send to the Adjuster/Insurance when requesting a copy of an estimate\nPLEASE REVIEW AND MAKE EDITS TO MAKE SURE THIS EMAIL FITS YOUR SPECIFIC\nSITUATION BEFORE YOU SEND IT\nPLEASE ATTACH CLAIM AUTHORIZATION AND MAKE SURE TO INCLUDE CLAIM # IN\nSUBJECT LINE\nEDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nHello!\nThis is [REP NAME] with Roof-ER. We are assisting [CUSTOMER’S NAME] with the claim\nreferenced above. Attached you will find a signed Claim Authorization and our Photo Report [IF\nYOU’VE ATTACHED IT, IF NOT PLEASE DELETE THAT LINE]\nI am reaching out in regards to an estimate for the scope of repairs that should have been created\nafter an inspection of [CUSTOMER NAME]’S property that happened on [DATE OF INSPECTION\nIF APPLICABLE].\nIf you are still working on the estimate, no problem at all! However, once you have a finalized\nestimate, please send a copy to both [CUSTOMER’S NAME] and to me as soon as possible.\nWe at Roof-ER want to quickly and effectively restore our mutual client’s property back to pre-storm\ncondition as soon as possible. Please let me know if you need anything else from me.\nThank you for working with us to assist [CUSTOMER’S NAME] with this project.\n[YOUR SIGNATURE]\n\nGAF Guidelines Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance company with customer CC’d\nMake sure to attach the document called GAF Storm Damage Recommendation\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern:\nThis is [REP NAME] with Roof ER. I am assisting [CUSTOMER’s NAME]. Attached is our Photo\nReport, Claim Authorization, and GAF Storm Damage Guidelines.\nGAF's guideline to not repair any more than 2 or 3 shingles. A repair at the level that is in your\ncurrent decision would cause significantly more damage to [CUSTOMER NAMES]’s roof, and\nwould not be an effective solution to restore his property after the hail storm that impacted his\nhouse.\nPlease update your current estimate to take this into consideration.\nWe sincerely appreciate your time and assistance.\nYour Signature with your contact information\n\nPartial Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance company with customer CC’d\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern:\nThis is [REP NAME] with Roof ER. I am assisting [CUSTOMER’s NAME]. We have attached our\n[repair estimate and/or accompanying documentation] for your review.\n[insert rep argument here]\nPlease let us know if you have any questions/concerns regarding our estimate and provide us with\na revised estimate accounting for the additional damages found during our inspection at your\nearliest convenience. If you would like to perform an additional inspection of the property, please let\nus know when you would like to do so by contacting me at the information below. We appreciate\nyour time and assistance in reviewing this information and look forward to reaching a timely\nresolution on the scope of repairs.\nYour Signature with your contact information\n\niTel Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nThis is [REP NAME] with Roof ER. I am the contractor assisting [CUSTOMER’S NAME]. Attached\nyou will find an iTel report [AND any additional documents if you attach them.]\n[Use the following APPLICABLE arguments]\nPer the attached iTel report, there are no similar matches available which makes a patch repair\nimpossible\nPer the attached iTel report, the existing shingle is discontinued. We have attempted to contact the\nsuppliers listed on the report to secure the suggested samples, however each supplier noted [they\ndo not carry the suggested product/the suggested product would need to be special-ordered by the\npallet, meaning the costs to do so would be more exorbitant than simply replacing the roof]. As a\nresult, the approved scope of work cannot be completed as currently written.\n(Homeowner's) shingles are the English-dimension architectural shingles which are no longer in\nproduction. The new metric-dimension shingles have a larger exposure size and for that reason,\ncannot be mixed with the existing shingles via a repair. If we try to repair with the new shingles, the\nsealant on the shingle above would not secure to the correct portion of the new underlying shingle.\nThe sealant would be secured to the granules on the underlying shingle - any reputable contractor\nknows a proper repair cannot be completed in this fashion.\nPlease review these findings and revise your estimate accordingly so we can begin to move forward\nwith the full replacement for [HOMEOWNER’S NAME]. If we can provide additional information,\nplease let us know. Thank you for your time and for working with us to assist [HOMEOWNER’S\nNAME] in restoring their property effectively after the loss they have experienced.\nYour signature with your contact information\n\nPhoto Report Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nYou will find our photo report attached to this email citing additional damage not accounted for in\nyour initial decision. [IF A PARTIAL THAT HAS ROOF DAMAGE, USE THE FOLLOWING\nSENTENCE] This damage is consistent with what has already been approved which leaves us and\nthe homeowner unsure why these findings were left off of the estimate. [IF A FULL DENIAL, USE\nTHE FOLLOWING SENTENCE INSTEAD] The extent of the wind AND/OR hail damage can be\nseen in the photo report.\n[Other things you can mention before closing out the email]\nNoting damage to the soft metals, gutter, downspouts, etc.\nWould be more expensive to replace in patch form\nClear areas that may be causing interior leaks\nPlease review these findings and revise your estimate/scope of work accordingly so we can begin\nto move forward with the full replacement for [HOMEOWNER’S NAME]. If we can provide additional\ninformation, please let us know. Thank you for your time and for working with us to assist\n[HOMEOWNER’S NAME] in restoring their property effectively after the loss they have\nexperienced.\nYour signature with your contact information\n\nPost Adjuster Meeting Email Template\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nThis is [REP NAME] with Roof ER, the contractor assisting [CUSTOMER’S NAME.]\nAttached you will find our Photo Report and Claim Authorization. Please use this to assist in\nfinalizing your decision. Please take note of the significant storm damage throughout our client’s\nproperty that is evident in the Photo Report.\n[Use this area to highlight specific photo numbers if applicable]\nOnce you finalize your estimate, please send that to [CUSTOMER’S NAME] and me. We want to\nquickly and effectively restore their property after the loss they have experienced from the storm.\nPlease let me know if you may need anything else from me.\nThank you for working with us to assist [CUSTOMER’S NAME] with this project.\n[Your signature with contact information]\n\nRepair Attempt Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nPlease see [THE ATTACHED PHOTO AND/OR VIDEO – OR THE VIDEO LINKED BELOW] of the\nattempted repair for the claim number referenced in the subject line. As can be clearly seen in the\nphotos AND/OR video, the homeowner's roof sustained additional damage during the attempted\nrepairs. This confirms a failed brittle test indicating irreparability.\nPlease review these findings and revise your estimate/scope of work accordingly so we can begin\nto move forward with the full replacement for (homeowner). If we can provide additional information,\nplease let us know. Thank you for your time and for working with us to assist [HOMEOWNER’S\nNAME] in restoring their property effectively after the loss they have experienced.\n[Here is the link to the Repair Attempt Video: youtube.com/ ]\nYour signature with your contact information\n\nSiding Argument to send to Insurance/Adjuster\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo Whom it May Concern\nThis is [REP NAME] with Roof ER. I am the contractor assisting [CUSTOMER’S NAME]. Attached\nyou will find [MAKE SURE TO EDIT THIS SECTION FOR WHAT DOCUMENTS YOU ARE\nACTUALLY ATTACHING] my photo report [AND/OR], an iTel Report, [AND/OR] a repair estimate\nthat includes the siding.\n[INCLUDING THE FOLLOWING ARGUMENTS THAT ARE APPLICABLE TO YOUR EMAIL]\nDamage\nYou will find our photo report in the list of attachments citing additional damage not accounted for in\n(insurance)'s original estimate. This damage is consistent with what has already been approved\nwhich leaves us and the homeowner unsure why these findings were left off of the estimate.\n[Additional details as needed]\nDiscontinued\nThis estimate is for a full siding replacement due to the existing siding being discontinued. Per the\nattached iTel report, there are no similar matches available and so our estimate accounts for all\nelevations of siding.\nThe current siding is discontinued. The similar siding that is available would have to be special\nordered and paint matched. Because of those things, it would not be a cost-effective solution to\nrestore [HOMEOWNER’s] siding. The only way to effectively make them whole again would be with\nfull siding replacement.\nCode/Housewrap\nPer building code, we are required to install a house wrap on exterior wall sheathing to prevent\nmoisture from getting to the building envelope. Further, we are required to follow the manufacturer's\ninstallation instructions while applying the weather barrier. These instructions state we must overlap\nHousewrap 6\" over any outside corners. This would require us to remove the existing aluminum\noutside corner and detach the aluminum panels on the adjacent run that meet at that corner post.\nThis is not only impractical, but also impossible without causing further damage to metal siding\npanels, as they will inevitably sustain damage during the removal process. Due to this\nconsequential damage, we have submitted our estimate for a full siding replacement\nPlease review these findings and revise your estimate/scope of work accordingly so we can begin\nto move forward with the full replacement for [HOMEOWNER’S NAME]. If we can provide additional\ninformation, please let us know. Thank you for your time and for working with us to assist\n[HOMEOWNER’S NAME] in restoring their property effectively after the loss they have\nexperienced.\n\nYour signature with your contact information\n\nCustomer Perspective Template for Customer to Send to Adjuster/Insurance\nSend this to the customer and instruct them to COPY and PASTE your email and for them to send it\nthemselves (Make sure they do not just forward the email.)\nYou can also have the customer make edits as necessary\nAsk them to CC you as well\nPLEASE REVIEW AND MAKE EDITS TO MAKE SURE THIS EMAIL FITS YOUR SPECIFIC\nSITUATION BEFORE YOU SEND IT TO THE CUSTOMER\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern,\nI, a loyal customer of [INSURANCE COMPANY], find your current decision for my home\nunacceptable. I have chosen [INSURANCE COMPANY] to protect my home in the event that I find\nmyself in this situation. Your current decision will not effectively address the needs of my home after\nthe loss we have suffered from the storm.\nMy contractor, who is CC’d in this email, has provided documentation that outlines the most\neffective way to make my property whole again [AND/OR] while your current decision would be an\nineffective solution for my roof [AND/OR] siding.\nPlease update your decision/estimate to reflect a full roof [AND/OR] siding approval. If necessary,\nplease have someone else come back to inspect the property.\nPlease let my contractor or myself know if you need anything else from us.\nWe look forward to hearing from you soon,",
  "textLength": 16630,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}