{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Sales Scripts /Partial Estimate Phone Call.docx",
  "name": "Partial Estimate Phone Call.docx",
  "type": "docx",
  "size": 8210,
  "relativePath": "Sales Scripts /Partial Estimate Phone Call.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:04.285Z",
  "extractedText": "Partial Estimate/Denial Phone Call\n\nThis is the call you will make to your HO as soon as you receive the estimate\n\n\n\n“Hello sir/ma’am! It’s [YOUR NAME] with Roof ER. How’s it going?”\n\n\n\n“Great, well we just received the decision from the insurance company.  We’re going to have to take some steps to get this turned around.  I have already submitted my photo report that demonstrates the damage to your property and the need to replace your whole roof, so hopefully they review and approve that.  Could you please reach out to the adjuster to see if they were able to review my report?”\n\n\n\nAfter HO answers. “Thank you! During that call, please let them know that you disagree with their current decision and would like to have your property reinspected if they are not able to update their current decision to a full approval based on the photo report that I sent them.”\n\n\n\nIf there are some approved shingles:\n\n“So we will also be conducting an iTel and Repair Attempt. \n\n“An iTel is where we will take a shingle off your roof and send it in to get tested to verify that it is discontinued.  Since it is discontinued, the only effective way to restore your property would be with a full roof replacement.\n\n“At that time, I will also take a video of us removing and replacing that shingle.  This Repair Attempt video will demonstrate to the insurance company that your roof is not repairable and therefore would need to be fully replaced.\n\n“To get those scheduled, I will need you to sign these 2 documents allowing us to do that.  When you see the documents, it will have a cost attached, but don’t worry! Read the bold print and you will see that you, as the homeowner, are never responsible for this cost.”\n\nSchedule a time to meet with the HO to sign or let them know you will be sending it out for eSign.  Task the proper people for eSign, if necessary.\n\n\n\n“We will definitely be putting in the work to give you the highest chance of getting this turned around. I definitely believe your roof has the damage that warrants a full replacement.  But, of course, insurance companies are billion dollar, publicly traded companies that will try to save as much money as they can on every claim.  That is why it is great that you are working with us since we know the proper steps to ensure that you are adequately taken care of by your insurance company!”\n\n\n\nAnswer any questions or concerns the HO has.\n\n\n\n“Alright, so let me know how the phone call goes with your adjuster and I’ll start working on my end to put everything together to get this turned around.  Thank you, sir/ma’am, goodbye!”\n\n",
  "textLength": 2596,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}