{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Customer Resources(Products, Warranties, etc.)/Post Sign Up Timeline.docx",
  "name": "Post Sign Up Timeline.docx",
  "type": "docx",
  "size": 235435,
  "relativePath": "Customer Resources(Products, Warranties, etc.)/Post Sign Up Timeline.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:05.838Z",
  "extractedText": " \n\n\n\n   Insurance Process Steps & Timeline \n\n*** Please note that every insurance company/ individual adjuster has slightly different timeline based on multiple variables. Below is what we can typically expect:\n\n\n\nStep 1: Schedule Adjuster Meeting \n\nAssigned insurance adjuster will reach out within 1-3 business days to schedule their inspection of your property \n\nIf you have interior or would like to make sure you are home for the inspection, please schedule and let me know so I can fit it into my calendar \n\nOtherwise, please have the adjuster call me directly to schedule \n\nTHE most important part to me helping you get fully approved… is that I am here for the insurance company’s inspection. \n\n\n\nStep 2: Adjuster Meeting\n\nThis meeting will typically be scheduled within 1-2 weeks of filing the claim varying based on the adjuster’s current work load. \n\nI will arrive 30 minutes prior to the scheduled adjuster meeting time to set up my ladder.\n\nAfter the inspection, we will knock on your door to recap our inspection and to communicate the next steps. If you are not home, I will call you to let you know how things went. \n\n\n\nStep 3: Approved Scope of Work\n\nWithin 5 business days, the insurance company will provide an itemized estimate of the approved scope of work.\n\nIf we have not received anything within a week of the adjuster meeting, we will begin following up with you and the insurance company directly\n\nOnce you have received their written documentation please email that directly to myself and estimates@theroofdocs.com\n\n\n\n\n\n\n\n",
  "textLength": 1549,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}