{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Sales Scripts /Post Adjuster Meeting Script.docx",
  "name": "Post Adjuster Meeting Script.docx",
  "type": "docx",
  "size": 9082,
  "relativePath": "Sales Scripts /Post Adjuster Meeting Script.docx",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:04.290Z",
  "extractedText": "Post Adjuster Meeting Script\n\nThis is the conversation you will have with the HO after an adjuster meeting\n\n\n\n\n\nIf moving to Estimate Pending:\n\n“Great! The Adjuster/Ladder Assist identified all the same damage as me.  You will be receiving an email from us shortly saying that you’ve been fully approved.  Within a few days you should receive the itemized estimate from the Insurance Company.  Once you receive that, you can forward that to me. This is going to include every line item that the insurance company believes is needed to make you whole again. To you this is going to look like gibberish. But, don’t worry, that’s what we’re here for. If for some weird reason the desk adjuster does not write it for a full approval after this inspection, I will take the steps necessary to get it turned around! Any questions on that, sir/ma’am?”\n\n\n\nAnswer any questions\n\n\n\n“When the insurance company generates their estimate, it will also typically trigger the release of the first payment. The insurance company refers to this payment as the ACV. Which stands for Actual Cash Value. That amount will be used as your down payment.  The remaining funds are held by the insurance company until we complete the work. They refer to these remaining funds as Depreciation. Which is not “depreciation” as most would think about it, it’s just their way of holding on to some of the funds to make sure the work gets done.\n\n\n\n“At the same time our office will be reviewing your entire project along with my photos and the insurance estimate. As I’ve mentioned, insurance companies are always trying to save money.  We usually find specific line items that are missing. Most commonly, code items like IWS and Drip Edge. We will supplement for all the items needed to complete your project to code and our manufacturer’s specifications. Don’t worry, like we have agreed to from the beginning, we guarantee you that you would not have to cover any of these costs even if the insurance company were to deny our supplement. [Which does not happen.]\n\n\n\n“Once our office has completed your job review, which takes 2 - 3 business days, your job will be assigned to one of our Project Coordinators.  They will reach out to schedule a project meeting where they will walk you through all of the finer details.  This is the fun part where you will get to pick our products and colors. *Of course if you have anything else you would like us to do beyond the insurance approval, your Project Coordinator could price that out for you.*\n\n“Your install date will typically be 4 - 6 weeks after your Project Meeting.  After you submit that initial payment from the insurance company, we’ll reach out to get your project scheduled!\n\n\n\n\n\n“I know that was a lot of information. The most important thing from here is forwarding the estimate as soon as you get it. Of course if you have any questions in the meantime, please feel free to reach out.\n\n\n\nAnswer any questions that they may have.\n\n\n\n“A great way for me to help assist some of your neighbors, would be if I could put up a yard sign! Would you mind if I put one up? Thank you, sir/ma’am!”\n\n\n\nSubmit your Photo Report and Claim Authorization to the adjuster with an effective email.  Use Post-AM-Email-Template if you need to.\n\n\n\n\n\nIf moving to Decision Pending:\n\n“So, we just finished our inspection.  The Adjuster/Ladder Assist will be sending their report to a desk adjuster and will be making a final decision. Once they make a decision, they will write up an itemized estimate and should send that over to you.  Once you receive that, please forward that over to me.  They can be a bit hard to read, so I’ll be able to walk through all of that with you.\n\n\n\n“If it comes back as anything other than a full approval, I’ll take the necessary steps to make sure it gets turned around!  There are a lot of steps we can take from here, which we can go over once we receive the estimate.\n\n\n\n“I will go over all this information again once we receive the estimate and have a more clear picture of what the next steps will be.”\n\n\n\nAnswer any questions they may have\n\n\n\n“Great! So, if you have any questions between now and when you get your estimate, please reach out!  And, again, once you receive that from the insurance company, forward that over to me so I can review that with you.  Thank you sir/ma’am! Have a great day!” \n\n\n\nSubmit your Photo Report and Claim Authorization to the adjuster with an effective email.  Use Post-AM-Email-Template if you need to.\n\n",
  "textLength": 4490,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}