{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Agreements/Project Agreement - Repair - VA.pdf",
  "name": "Project Agreement - Repair - VA.pdf",
  "type": "pdf",
  "size": 250311,
  "relativePath": "Agreements/Project Agreement - Repair - VA.pdf",
  "category": "agreements",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:57:44.752Z",
  "extractedText": "INTEGRITY\n \nQUALITY\n \nSIMPLICITY\n \n  \n \n  \nHome Exterior Repair Agreement            Date: ___________________   \nCustomer(s): _____________________________       Phone Number(s): _____________________ \n          _____________________________             _____________________ \nProject Address: __________________________       Email(s):    ____________________________                              \n   __________________________             ____________________________ \n \nCustomer(s) is/are owner(s) of the listed Project Address and, jointly and severally, agree to purchase the goods \nand construction services (\"Services\") of The Roof Docs LLC and its vendors (“Company”) in accordance with \nthe prices and terms described in this three-page document as part of this Agreement (“Agreement”). This \nAgreement represents a cash sale of Services. Customer(s) agrees to pay the cost of the Services as described \nherein, regardless of timing or approval of any financing or insurance reimbursement Customer(s) may seek for \ntheir purchase. Future promotions not applicable to this Agreement. \n \n \nRepair Specifications \n \n \nTotal Contract Price: ________________*\nplus any Extra Work         Estimated Work Start: ____________ weeks \nPayment Schedule           Estimated Work Completion: ________ days \nDown-payment(s): _______________________________________________      Due: At time of agreement \nFinal Payment: _________________________________________________  Due: Upon Job Completion\n+ \n \nMethod of Payment:       Check ____                              Debit/Credit Card ____ \n \n \nI have read and received this three-page agreement. \n \nAgent of The Roof Docs LLC                                 Customer(s)                                                Customer(s) \n \n________________________                  _________________________                   ________________________ \nThe Roof Docs LLC (“Contractor”) \nClass A Virginia License # 2705169915 \n \n\n \n \nINTEGRITY\n \nQUALITY\n \nSIMPLICITY\n \nTERMS OF AGREEMENT \n \n1. Time: Contractor will use reasonable efforts but does not guarantee the date of Work start or completion. There will be an \nallowance of additional time if delays are caused by (1) Customer(s), (2) special orders for construction materials, (3) \nsubcontractor or supplier, (4) alterations required to the Work, (5) unforeseen conditions at the site, (6) natural causes such \nfire, rain or storm, or (7) conditions beyond Contractor’s control. Contractor has the right to cancel this Agreement and \nwithout liability or obligation (except return of deposit with appropriate debits for Services provided) in case of non-payment, \nemergency, strike, or factors beyond the control of the Contractor. Delay or cancellation of a scheduled workday by the \nCustomer(s) requires a minimum of 5 days prior notification or the Customer(s) shall be subject to paying a full crew day’s \nlabor charge at Contractor’s prevailing labor rate. Contractor may increase the prices charged if Customer(s) delays \nacceptance, start or completion of the Work. \n \n2. Payment: Customer(s) shall pay Contractor the amounts due on the dates set out in this Agreement. When any payment \nis due under this Agreement, Contractor may charge the Customer(s) credit card and provide notice to Customer(s) \nafter such charge has been processed. It is understood that the Contract Price does not include expenses for dealing with \nhidden or unknown contingencies found at the job site (which includes any cost related to asbestos or lead paint abatement, \nremoval or encapsulation) (\"Extra Work\"). In the event the Contractor determines that Extra Work is necessary, the \nadditional cost for the Extra Work will be paid by the Customer(s). Should Extra Work be identified, Contractor will notify \nthe Customer(s), provide the cost for such Extra Work, and give the Customer(s) 24 hours’ notice before commencing such \nExtra Work. If Customer(s) does not protest the Extra Work within such 24 hours, then Customer(s) shall be responsible for \npayment of the cost. If the Customer(s) protests the Extra Work within the 24-hour period, then Contractor can refuse to \nperform the Extra Work in which case the Contractor is released from any claim for damages resulting from the non-\nperformance of the Extra Work (such as leaks or structural failures), and the Warranty described in Section 6 below will not \nbe provided for any of the Services. Contractor may request payments in advance of the payment schedule if Customer(s) is \nlate with any payment or if Customer(s) notifies Contractor of a dispute. \n+\nIn the event there are punch list items or \nadjustments after substantial completion of the Services, Customer(s) may withhold a maximum of five percent (5%) of the \ntotal Price until such punch list items or adjustments are completed. Contractor at its sole discretion shall determine when the \npunch list items or adjustments are completed so that the five (5) percent withheld must be paid. Contractor may suspend \nWork if Customer(s) fails to make full payment on the due dates. *Any additional monies received from the insurance \ncompany as supplements, cost increases, and/or general contractor overhead and profit will be paid in addition to the contract \nprice above. \n \n3. Insurance Support: If the Customer(s) wishes to recover the Contract Price from its property insurance carrier, it is the \nresponsibility of the Customer(s) to submit a claim to the Customer(s)'s property insurance company. Customer(s) \nunderstands that the amount owed is not subject to collection of such amounts from the insurance carrier. If requested by the \ninsurance company, Contractor agrees to be present at the insurance company’s inspection of the Job Site to provide \nadditional information as requested by the insurance company to support the agreed Services and supplying additional reports \nas may be reasonably requested by the insurance company. Notwithstanding the foregoing, Customer(s) acknowledges \nthat Contractor is not a public adjuster and will not engage in public adjusting with the insurance company on \nCustomer(s)’s behalf. \n \n4. Permits/Inspections: Customer(s) is responsible for defining the Project property boundaries, obtaining all required \nzoning variances and building permits. However, Contractor will coordinate all building inspections. When requested by \nContractor, Customer(s) must sign required documents and make the Property available for inspection. \n \n5. Change Orders: Contractor may accept Change Orders initiated by the Customer(s) in which event an additional charge \nwill apply to such Change Order as calculated by Contractor. If Contractor requests a written Change Order or Clarification, \nCustomer(s) must execute the Change Order before Contractor is required to commence such additional Work. Change \nOrders may cause a delay in the completion date. \n \n6. Warranty: Company does not offer, nor represents to offer, any form of warranty for the Repair Specifications or Extra \nWork that may be required per this Agreement. This includes, but is not limited to, any labor, material, or workmanship, \nwarranties. Customer acknowledges that Company has agreed to perform repair work in a good-faith manner and is not to be \nheld liable for any issues that may arise, directly or indirectly, as a result of the repair work.  \n\n \n \nINTEGRITY\n \nQUALITY\n \nSIMPLICITY\n \n7. Disputes: Customer(s) must inform Contractor in writing of any problems with the Work and give Contractor a reasonable \ntime to cure such problem. Failure to notify Contractor in writing of any problem within fifteen (15) days from the discovery \nof such problem by Customer(s), shall be considered a waiver of such problem and any warranty relating thereto. \n \n8. Default: If Customer(s) fails to make any payment on the date due or fails to make the Property available when requested \nby Contractor (and such failure continues for more than three (3) business days), Contractor may, at its sole discretion, \nterminate this Agreement, retain all sums paid by Customer(s), charge Customer(s) for all sums paid by Contractor for \nconstruction materials ordered, charge Customer(s) for all labor provided (including inspections and preparation of a quote), \nand charge a $1,000 cancellation fee. Alternatively, if Customer(s) fails to make any payment on the date due, Contractor at \nits sole discretion may suspend Work and withhold delivery of construction materials until payment is received. A late fee of \nfive percent (5%) shall apply to any payment not paid when due. In addition, Customer(s) shall pay one and one-half percent \n(1.5%) interest per month on any late payment from the date due. Customer(s) shall pay to Contractor attorney’s fees of 25% \nof the amount of the claim, plus expert witness fees and costs incurred by Contractor to collect unpaid sums, enforce this \nAgreement and/or defend a claim involving this Agreement. \n \n9. Risk: Customer(s) understands that the Work may involve some risk of personal injury and property damage. Customer(s) \nmust move all furniture, window screens, hangings and other personal property away from the Work area(s) at a sufficient \ndistance and appropriate location so that the property will be protected, will not impact the Work and will not impede \nContractor’s access to the Work area(s). Customer(s) shall follow instructions of Contractor with regard to preventing injury \nto property of person. Customer(s) will not hold Contractor liable for personal injury, damage to mechanical systems, or \nproperty damage, even if caused by a subcontractor, unless caused by the gross negligence of the Contractor. Customer(s) \nagrees to carry full coverage on the Property covering Customer(s)’s risk of injury or damage to which insurance Customer(s) \nwill exclusively look for compensation in the event of loss or injury. \n \n10. Recovery Fund: Consumer is hereby notified of the existence of the Virginia Contractor Transaction Recovery Fund. \nThe Virginia Contractor Transaction Recovery Fund provides relief to eligible consumers who have incurred losses through \nthe improper and dishonest conduct of a licensed contractor. More information on the Fund or filing a claim can be obtained \nby visiting http://www.dpor.virginia.gov/Boards/Contractors_Recovery_Fund/ or by contacting the Board for claim \ninformation at the following address: \n \nRecovery Fund Office | DPOR \n9960 Mayland Drive, Suite 400 \nRichmond, VA 23233 \n(804) 367-1559 \nEmail: RecoveryFund@dpor.virginia.gov \n \n11. Entire Agreement: This Agreement contains the entire agreement between the parties, and supersedes all prior \nagreements, promises, inducements, discussions, statements, and writings, as well as promotional materials of Contractor or \nmanufacturer. There are no other understandings or agreements between the parties, except as otherwise provided herein. \n \n12. Additional Terms: \na. During the Work, Contractor may place a sign on the Property as advertisement. \nb. Customer(s) must provide electricity and water to the Work area(s) at Customer(s)' expense. \nc. Work will be performed from Monday through Saturday (7:00 a.m. to 8:00 p.m.) unless otherwise arranged. \ne. “Extra” construction materials are the property of the Contractor. \nf. Contractor is not responsible for any damage caused to Customer(s)' driveway from material delivery. \nCustomer(s) may request alternative methods of delivery but there will be an additional cost.",
  "textLength": 11485,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}