{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Questions/Pushback.docx",
  "name": "Pushback.docx",
  "type": "docx",
  "size": 30508,
  "relativePath": "Questions/Pushback.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:00:12.569Z",
  "extractedText": "Insurance Pushback & Arguments Playbook (Q1–Q100)\n\n\n\nQ1: Adjuster says: \n\n“We don’t see enough damage to warrant replacement.”\n\nShort Answer (with source):\n\nOur photo report shows functional storm damage (creases, missing shingles) beyond repair. This requires full replacement .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nPlease see the attached photo report documenting storm-related damage on multiple slopes. The photos clearly show creased and missing shingles, which are consistent with functional wind damage and cannot be repaired without causing further harm. Per standard industry practice, this constitutes irreparability, and a full replacement is required to restore the property to its pre-loss condition. We respectfully request that your estimate be revised accordingly .\n\n\n\nQ2: Adjuster says: \n\n“Hail is cosmetic and doesn’t affect function.”\n\nShort Answer (with source):\n\nHail damage is not cosmetic — it causes granule loss, mat fractures, and sealant bond failures, per GAF .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial states that hail damage is cosmetic only. However, per GAF Storm Damage Guidelines, hail impact causes functional issues such as granule loss, cracks in the asphalt mat, and compromised sealant bonds. These defects accelerate roof deterioration and shorten lifespan, making the roof irreparable. For these reasons, this damage cannot be dismissed as cosmetic. Please update your estimate to reflect full roof replacement .\n\n\n\nQ3: Carrier says: \n\n“Shingles can be patched.”\n\nShort Answer (with source):\n\nThe iTel report confirms the shingles are discontinued; patching would cause mismatches and fail manufacturer standards .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour position that the roof can be patched is not consistent with the findings of the attached iTel report, which confirms that the installed shingles are discontinued. Per the Discontinued Shingle List, no comparable replacements exist. Mixing discontinued shingles with available alternatives creates mismatches in size, color, and sealant bond, violating manufacturer standards. The only viable and code-compliant option is full replacement .\n\n\n\nQ4: Adjuster says: \n\n“We don’t see storm-related damage.”\n\nShort Answer (with source):\n\nOur photo report documents collateral and shingle damage consistent with the reported storm event. Latent storm damage may not be immediately visible .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial states no storm-related damage was found. Please review the attached photo report, which documents collateral impacts to gutters, soft metals, and shingles. These damage patterns are consistent with the storm event reported and align with industry-recognized storm signatures. Additionally, per GAF Storm Damage Guidelines, latent damage from wind or hail may not be visible immediately but still compromises long-term performance. We ask that the scope be reconsidered with this evidence in mind .\n\n\n\nQ5: Carrier says: \n\n“The roof is still functional.”\n\nShort Answer (with source):\n\nCoverage isn’t based on functionality — cracked shingles and exposed mats void warranties and require replacement .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nWhile you noted the roof is “still functional,” coverage is not determined by whether a roof is currently leaking but by restoring the property to its pre-loss condition. The attached documentation shows cracked shingles and exposed fiberglass mats. Per GAF Storm Damage Guidelines, these conditions void the manufacturer’s warranty and compromise the integrity of the system. Repair is not feasible, and replacement is required to bring the property back to pre-storm condition .\n\nQ6: Adjuster says: \n\n“We won’t cover storm tarp nail holes.”\n\nShort Answer (with source):\n\nPer GAF, tarping through shingles permanently damages them. Caulking nail holes is not an acceptable repair .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes coverage for tarp-related nail holes. Per GAF Storm Damage Guidelines, any roof that has been nailed through during tarping has been permanently compromised. Caulking these penetrations is not a permanent repair and creates a maintenance issue outside warranty coverage. The shingles with nail holes must be replaced to ensure a watertight system .\n\n\n\nQ7: Carrier says: \n\n“Damage is old, not storm-related.”\n\nShort Answer (with source):\n\nOur timestamped photo report shows fresh granule loss and collateral consistent with the reported storm .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial suggests the roof damage is due to age. However, the attached photo report includes timestamped documentation of fresh granule loss, creased shingles, and collateral damage consistent with the recent storm. Natural wear appears uniformly over time, while storm damage is localized and patterned. These conditions confirm storm-related damage .\n\n\n\nQ8: Adjuster says: \n\n“Denial stands, no additional inspection.”\n\nShort Answer (with source):\n\nThe homeowner may request a second inspection and has provided new documentation .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nWe respectfully request a second inspection on behalf of the homeowner. The customer-to-insurance template letter has been provided and highlights overlooked damage supported by our documentation. Denying reinspection ignores the policyholder’s right to fair claim handling. Please reconsider based on this new evidence .\n\n\n\nQ9: Carrier says: \n\n“No damage to soft metals = no hail event.”\n\nShort Answer (with source):\n\nOur photo report shows dents in metals. Even without collateral, GAF confirms hail causes latent shingle damage .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou denied hail damage based on an absence of collateral. The attached photo report shows visible dents to soft metals. Furthermore, per GAF Storm Damage Guidelines, shingles can sustain latent damage (fractures, granule loss, bond failures) even without collateral evidence. The absence of extensive metal damage does not rule out functional hail damage to shingles .\n\n\n\nQ10: Adjuster says: \n\n“Your test was unnecessary.”\n\nShort Answer (with source):\n\nThe brittle test is industry standard. Our video shows shingles cracked during manipulation, proving irreparability .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nOur brittle test was necessary to confirm whether repair was feasible. The documented repair attempt video shows the shingles fractured during manipulation, a clear indicator of irreparability. This aligns with accepted industry standards for testing storm-damaged shingles. Repair is not possible; full replacement is the only solution .\n\n\n\nQ11: Carrier says: \n\n“Your documentation isn’t sufficient.”\n\nShort Answer (with source):\n\nWe’ve provided photo report, repair attempt, and iTel report — proving irreparability and discontinuation .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou stated our documentation is insufficient. Please note we have submitted:\n\nA photo report showing storm-related damage.\n\nA repair attempt video proving irreparability.\n\nAn iTel report confirming discontinuation of the shingles. Together, these documents establish that the roof cannot be repaired, only replaced .\n\n\n\nQ12: Adjuster says: \n\n“The roof is patchable.”\n\nShort Answer (with source):\n\nMixing discontinued English-dimension shingles with metric shingles misaligns sealant, violating manufacturer standards .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial suggests patching is possible. The attached iTel report confirms the existing shingles are English dimension and discontinued. New shingles are only available in metric sizing, which misaligns sealant strips and prevents proper bonding. Manufacturer installation standards prohibit mixing dimensions, making patching non-viable .\n\n\n\nQ13: Carrier says: \n\n“No coverage for siding mismatch.”\n\nShort Answer (with source):\n\nMaryland Insurance Administration Bulletin 18-23 requires siding replacement unless policy explicitly excludes it .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial of siding mismatch coverage contradicts Maryland Insurance Administration Bulletin 18-23, which requires carriers to provide for siding replacement unless policies specifically exclude matching. The damaged siding is discontinued, and no suitable matches are available. Full elevation replacement is required .\n\n\n\nQ14: Adjuster says: \n\n“We only pay Actual Cash Value, not replacement.”\n\nShort Answer (with source):\n\nReplacement cost policies require restoring pre-loss condition. Patch repairs with discontinued shingles don’t qualify .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve indicated coverage is limited to ACV only. This property carries replacement cost coverage, which requires restoring it to pre-loss condition. Since the shingles are discontinued, patch repairs are impossible without mismatching and lowering value. Full replacement is the only way to honor policy terms .\n\n\n\nQ15: Carrier says: \n\n“No hail large enough reported.”\n\nShort Answer (with source):\n\nNOAA data and our photos show functional hail damage. Size is irrelevant once damage exists .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial cites no reported hail size sufficient for damage. Our photo report shows functional hail impacts — granule loss, fractures, and collateral dents. Per GAF Storm Damage Guidelines, even small hail can cause latent shingle failure. Coverage must be based on observed damage, not storm reports alone .\n\n\n\nQ16: Adjuster says: \n\n“We don’t cover flashing.”\n\nShort Answer (with source):\n\nPer VA Code 908.5, damaged or deteriorated flashing must be replaced during re-roofing .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes flashing. Per Virginia Building Code 908.5, all rusted, damaged, or deteriorated flashings must be replaced when re-roofing. Attempting to reuse old flashings violates code and creates long-term risk. Replacement must be included .\n\n\n\nQ17: Carrier says: \n\n“Granule loss is normal aging.”\n\nShort Answer (with source):\n\nGAF states storm-related granule loss exposes asphalt and accelerates failure .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial attributes granule loss to aging. Per GAF Storm Damage Guidelines, granule loss from hail or wind exposes the asphalt mat, accelerating deterioration and causing premature failure. This is storm-related functional damage, not normal wear .\n\n\n\nQ18: Adjuster says: \n\n“Repairs will hold fine.”\n\nShort Answer (with source):\n\nOur repair attempt already failed — shingles cracked during manipulation .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated repairs will hold. However, our documented repair attempt shows shingles cracking when lifted, confirming brittleness. Repairs would cause further damage and are not viable. Replacement is required .\n\n\n\nQ19: Carrier says: \n\n“We don’t pay for collateral damage.”\n\nShort Answer (with source):\n\nCollateral (gutters, metals, screens) proves storm impact and supports full replacement .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes collateral. Our photo report documents storm-related impacts to gutters, metals, and siding. Collateral damage proves storm impact, strengthens the claim, and requires coverage to restore the property fully .\n\n\n\nQ20: Adjuster says: \n\n“Denial is final.”\n\nShort Answer (with source):\n\nHomeowners may escalate through arbitration or formal complaint forms .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial letter states the decision is final. The homeowner reserves the right to escalate through arbitration or the appropriate state complaint process. We would prefer resolution at this stage and urge reconsideration with the new documentation provided .\n\n\n\nQ21: Carrier says: \n\n“We don’t accept contractor reports.”\n\nShort Answer (with source):\n\nOur iTel and photo reports are third-party verified industry standards .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated contractor reports are insufficient. Please note, the iTel report is a third-party laboratory analysis, and our photo report follows standard claim documentation procedures. These are accepted industry documents and valid evidence of storm damage .\n\n\n\nQ22: Adjuster says: \n\n“We see no storm date evidence.”\n\nShort Answer (with source):\n\nOur report is timestamped and consistent with NOAA storm data .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial cites no storm date evidence. Our photo report is timestamped and aligns with NOAA storm data for this location and date. The pattern and extent of the damage confirm storm causation .\n\n\n\nQ23: Carrier says: \n\n“Your estimate exceeds fair market value.”\n\nShort Answer (with source):\n\nOur estimate includes mandatory code items like flashing and WRB per VA & MD code .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated our estimate exceeds market value. Please note the estimate includes mandatory code items: flashing per VA Code 908.5 and water-resistive barriers per MD Code R703. These are required by law and must be included in the scope .\n\n\n\nQ24: Adjuster says: \n\n“We don’t owe for underlayment.”\n\nShort Answer (with source):\n\nGAF requires underlayment to overlap adjoining slopes by 4–6″. Reuse isn’t allowed .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes underlayment. Per GAF Slope Replacement Guidelines, when replacing a single plane, underlayment must overlap adjoining slopes by 4–6 inches. Reusing old material is not permitted, and proper installation requires new underlayment .\n\n\n\nQ25: Carrier says: \n\n“We won’t reopen this claim.”\n\nShort Answer (with source):\n\nNew evidence (repair attempt, iTel, photo report) requires reconsideration .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated the claim cannot be reopened. However, we’ve provided new documentation: a repair attempt video confirming irreparability, an iTel report verifying discontinuation, and a photo report documenting storm damage. This new evidence requires reconsideration under the policyholder’s rights .\n\nQ26: Adjuster says: \n\n“We’ll replace the back slope only, not the entire roof.”\n\nShort Answer (with source):\n\nPer GAF slope replacement requirements, underlayment and ridge/hip work cannot be isolated — full replacement is required .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved only the back slope for replacement. Per GAF Slope Replacement Requirements, replacing a single slope requires removing and overlapping underlayment at ridge and hip connections, which compromises adjoining slopes. This process makes isolated slope replacement impractical and risks system failure. A full replacement is required to maintain roof integrity .\n\n\n\nQ27: Carrier says: \n\n“We only saw damage on the front slope.”\n\nShort Answer (with source):\n\nStorms impact all slopes. Our photo report shows consistent collateral across multiple slopes .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour approval of only the front slope does not reflect the actual storm damage. Our attached photo report documents consistent collateral and shingle damage across multiple slopes. Storm exposure is not limited to a single elevation. To restore the property, all slopes must be included .\n\n\n\nQ28: Adjuster says: \n\n“Only one siding elevation is covered.”\n\nShort Answer (with source):\n\nMaryland law requires full replacement when matching is impossible .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved only one elevation for siding replacement. Per Maryland Insurance Administration Bulletin 18-23, mismatched siding is not acceptable unless explicitly excluded in the policy. The damaged siding is discontinued, and matching is impossible. Full elevation replacement is required .\n\n\n\nQ29: Carrier says: \n\n“We don’t see gutter damage.”\n\nShort Answer (with source):\n\nPhoto report shows collateral gutter impacts consistent with roof damage .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial omits gutters. Our photo report documents dents and granule washout in the gutters consistent with roof storm damage. Collateral gutter damage confirms storm impact and must be included in the scope .\n\n\n\nQ30: Adjuster says: \n\n“We won’t cover downspouts.”\n\nShort Answer (with source):\n\nDownspouts show hail dents and granule buildup. They are storm-damaged and must be replaced .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes downspouts. Our attached photo documentation shows clear hail dents and granule buildup at downspout terminations. These are storm-related damages that shorten system life. Replacement is required to restore pre-loss condition .\n\n\n\nQ31: Carrier says: \n\n“We’ll approve roof but not siding.”\n\nShort Answer (with source):\n\nStorm caused both roof and siding damage. Code and matching requirements apply .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved roof replacement but denied siding. The storm impacted both systems. Per our siding argument documentation and Maryland matching requirements, partial siding replacement creates mismatches and fails to restore the home properly. Siding must be included .\n\n\n\nQ32: Adjuster says: \n\n“Only approving half of siding wall.”\n\nShort Answer (with source):\n\nRemoving corner posts requires detaching full wall, causing consequential damage .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve limited siding replacement to half a wall. Per our siding argument documentation, removing corner posts and reinstalling panels causes consequential damage that requires full wall replacement. Partial approval is not feasible .\n\n\n\nQ33: Carrier says: \n\n“We only cover wind-damaged shingles, not hail.”\n\nShort Answer (with source):\n\nOur photo report documents both hail and wind impacts; both require coverage .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve covered wind damage but excluded hail. The attached photo report documents both creased shingles (wind) and circular divots with granule loss (hail). Per GAF Storm Guidelines, hail damage is functional, not cosmetic. Both perils must be covered .\n\n\n\nQ34: Adjuster says: \n\n“We’ll cover roof but not flashing.”\n\nShort Answer (with source):\n\nVA Code requires flashing replacement when deteriorated or rusted .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes flashing. Per Virginia Building Code 908.5, any rusted, damaged, or deteriorated flashing must be replaced during reroofing. Code compliance requires flashing be included in the scope .\n\n\n\nQ35: Carrier says: \n\n“No siding wrap needed.”\n\nShort Answer (with source):\n\nMaryland Code R703 requires WRB behind siding .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded housewrap. Per Maryland Exterior Wall Code R703, a water-resistive barrier must be installed behind siding. Omitting this violates code and risks moisture intrusion. WRB must be included .\n\n\n\nQ36: Adjuster says: \n\n“We’ll cover slope but not ridge cap.”\n\nShort Answer (with source):\n\nReplacing a slope requires ridge cap removal; reuse voids manufacturer standards .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved slope replacement but excluded ridge caps. Per GAF Slope Replacement Requirements, ridge caps must be removed during slope replacement and cannot be reinstalled without voiding warranty. Ridge caps must be included .\n\n\n\nQ37: Carrier says: \n\n“We’ll cover roof but not underlayment.”\n\nShort Answer (with source):\n\nGAF requires new underlayment overlap when replacing slopes .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied underlayment. Per GAF technical bulletin TAB-R-164, when replacing a slope, underlayment must extend 4–6 inches into adjoining slopes. Reuse is prohibited. Underlayment replacement is required .\n\n\n\nQ38: Adjuster says: \n\n“We’ll only replace one plane of siding.”\n\nShort Answer (with source):\n\nCode requires WRB overlap across corners; partial wall replacement isn’t feasible .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve limited siding replacement to one plane. Per Maryland Code R703, WRB must overlap 6 inches at joints and corners, which requires removal of adjacent siding. Partial replacement is not feasible and violates code .\n\n\n\nQ39: Carrier says: \n\n“We won’t cover ventilation removal.”\n\nShort Answer (with source):\n\nGAF requires ridge ventilation be removed when adjoining slopes are replaced .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes ventilation. Per GAF Slope Replacement Requirements, ridge vents must be removed when replacing adjoining slopes. They cannot be reused without risking water intrusion. Ventilation must be included .\n\n\n\nQ40: Adjuster says: \n\n“We don’t owe for drip edge.”\n\nShort Answer (with source):\n\nInternational Residential Code requires drip edge at eaves and rakes for asphalt shingles .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded drip edge. Per the Virginia adopted IRC, drip edge is required at eaves and rakes on asphalt shingle installations. This is a code-mandated component and must be included .\n\n\n\nQ41: Carrier says: \n\n“We’ll cover roof but not valley metal.”\n\nShort Answer (with source):\n\nVA Code requires valley flashing be replaced when deteriorated .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes valley flashing. Per VA Code 908.5, deteriorated flashing, including valleys, must be replaced when reroofing. Valley metal must be included in scope .\n\n\n\nQ42: Adjuster says: \n\n“We’ll cover slope but not hip shingles.”\n\nShort Answer (with source):\n\nHip shingles must be removed for slope replacement and cannot be reinstalled .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved slope replacement but excluded hips. Per GAF Slope Replacement Requirements, hip shingles must be removed when adjoining slopes are replaced. They cannot be reused; new hip shingles are required .\n\n\n\nQ43: Carrier says: \n\n“Only slope replacement, no ice/water shield.”\n\nShort Answer (with source):\n\nIce/water shield required at eaves in snow-prone areas per IRC .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied ice/water shield. Per the IRC as adopted in Virginia, ice barrier underlayment is required at eaves in regions subject to ice dams. This must be included for code compliance .\n\n\n\nQ44: Adjuster says: \n\n“We won’t cover ridge vent replacement.”\n\nShort Answer (with source):\n\nRidge vents must be removed for adjoining slope work and cannot be reused .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes ridge vent replacement. Per GAF Slope Replacement Requirements, ridge vents must be removed during adjoining slope replacement. Reuse compromises performance and violates manufacturer instructions. Ridge vent replacement must be included .\n\n\n\nQ45: Carrier says: \n\n“We don’t owe for starter shingles.”\n\nShort Answer (with source):\n\nManufacturer guidelines require starter strips on eaves and rakes for wind warranty .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded starter shingles. Per GAF installation standards, starter strips are required along eaves and rakes to maintain wind resistance warranty coverage. Starter shingles are a mandatory component .\n\n\n\nQ46: Adjuster says: \n\n“We won’t cover ridge caps because they look fine.”\n\nShort Answer (with source):\n\nRidge caps must be removed when slopes are replaced; reinstallation voids coverage .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded ridge caps. Per GAF Slope Replacement Requirements, ridge caps must be removed to install new underlayment and shingles. Once removed, they cannot be reused without voiding warranty. New ridge caps must be included .\n\n\n\nQ47: Carrier says: \n\n“We don’t cover step flashing.”\n\nShort Answer (with source):\n\nVA Code requires replacement of damaged flashing during reroofing .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes step flashing. Per VA Code 908.5, existing flashings that are rusted, damaged, or deteriorated must be replaced when reroofing. Step flashing is integral and cannot be reused .\n\n\n\nQ48: Adjuster says: \n\n“Only covering roof plane, not chimney flashing.”\n\nShort Answer (with source):\n\nCode requires flashing at all penetrations; chimney flashing must be replaced .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded chimney flashing. Per IRC R703.4 as adopted in Maryland, flashing must be installed at all penetrations to prevent water entry. Chimney flashing replacement is required for compliance .\n\n\n\nQ49: Carrier says: \n\n“We’ll cover roof but not fascia metal.”\n\nShort Answer (with source):\n\nCollateral fascia dents documented in photo report prove storm damage .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded fascia metal. Our attached photo report shows dents and creasing consistent with storm impact. Collateral damage must be included for proper restoration .\n\n\n\nQ50: Adjuster says: \n\n“We won’t cover skylight flashing.”\n\nShort Answer (with source):\n\nFlashing at penetrations must be replaced per code; skylights cannot be reused with old flashing .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied skylight flashing. Per IRC R703.4, flashing must be installed at penetrations to prevent water intrusion. Skylight flashing cannot be reused once disturbed and must be replaced to maintain watertightness .\n\nQ51: Adjuster says: \n\n“We can repair by lifting shingles.”\n\nShort Answer (with source):\n\nOur repair attempt video shows shingles cracked during lifting — proving brittleness .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested repairs by lifting shingles. We attempted this, and the repair attempt video shows shingles cracking and breaking when lifted. This confirms brittleness and irreparability. Replacement is the only feasible option to restore the property .\n\n\n\nQ52: Carrier says: \n\n“Try a patch first.”\n\nShort Answer (with source):\n\nPatch test failed — new shingles don’t align with existing sealant strips .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial requests a patch attempt. We attempted repair, and the shingles fractured upon manipulation. Further, per the iTel report, the existing shingles are discontinued and English dimension, while replacements are metric. This creates misaligned sealant strips and voids manufacturer warranty. Repairs are not possible .\n\n\n\nQ53: Adjuster says: \n\n“You didn’t prove repair wasn’t possible.”\n\nShort Answer (with source):\n\nRepair attempt caused more damage — documented in video .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou stated we did not prove repairs impossible. Our repair attempt video shows that when shingles were lifted, they tore and fractured. This damage is conclusive evidence of irreparability. Replacement is required .\n\n\n\nQ54: Carrier says: \n\n“Repairs will be minor.”\n\nShort Answer (with source):\n\nEven minor repairs cracked shingles, confirming brittleness .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial suggests only minor repairs are needed. We attempted such repairs, and even slight lifting of shingles caused cracking. This proves brittleness and irreparability. Minor repairs are not an option .\n\n\n\nQ55: Adjuster says: \n\n“We’ll repair siding with a panel swap.”\n\nShort Answer (with source):\n\nRemoving siding panels damages adjoining ones, requiring full wall replacement .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou proposed repairing siding by swapping panels. Per our siding argument documentation, removing individual panels requires detaching corner posts and adjoining panels, causing consequential damage. This makes partial repair infeasible. Full replacement is required .\n\n\n\nQ56: Carrier says: \n\n“Corner post removal is simple.”\n\nShort Answer (with source):\n\nRemoving corner posts causes consequential siding damage per siding repair standards .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested corner post removal is minor. In reality, per our siding argument, removing corner posts necessitates detaching full wall sections of siding. This process causes consequential damage and makes simple repairs impossible .\n\n\n\nQ57: Adjuster says: \n\n“We can reuse siding panels.”\n\nShort Answer (with source):\n\nSiding panels distort and crack when removed, making reuse impossible .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated siding panels can be reused. However, per our siding argument documentation, panels crack and distort when removed due to interlocking mechanisms. Reuse compromises fit and watertightness. Replacement is required .\n\n\n\nQ58: Carrier says: \n\n“Repair attempt wasn’t needed.”\n\nShort Answer (with source):\n\nRepair attempts are industry standard to confirm irreparability .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve dismissed the repair attempt as unnecessary. Repair tests are industry standard to confirm whether patching is possible. Our attempt caused additional shingle damage, proving irreparability. Replacement is justified .\n\n\n\nQ59: Adjuster says: \n\n“We’ll approve repair of flashing only.”\n\nShort Answer (with source):\n\nStep and counter flashing cannot be removed without damaging siding/roof .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved flashing repair only. Per VA code and flashing installation requirements, step and counter flashing are integrated into siding and roof coverings. They cannot be removed or repaired without causing consequential damage. Full replacement is necessary .\n\n\n\nQ60: Carrier says: \n\n“We’ll approve spot shingle replacement.”\n\nShort Answer (with source):\n\nSpot repairs cracked shingles and failed brittle test .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial suggests spot shingle replacement. Our repair attempt shows that individual shingle replacement caused additional cracking. Spot repair failed brittle testing and is not feasible. Full slope replacement is required .\n\n\n\nQ61: Adjuster says: \n\n“Metal roof can be spot repaired.”\n\nShort Answer (with source):\n\nMetal panels interlock; removal damages adjoining panels .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated metal roofing can be spot repaired. Per our photo documentation, metal panels interlock, and removal requires detaching adjoining panels, causing distortion. Spot repair is not feasible; replacement is necessary .\n\n\n\nQ62: Carrier says: \n\n“Flat roof can be patched.”\n\nShort Answer (with source):\n\nPatching violates manufacturer warranty; full system integrity is required .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested patching the flat roof. Per state code and manufacturer requirements, patching voids warranty and does not restore system integrity. Full section replacement is required to comply with building code .\n\n\n\nQ63: Adjuster says: \n\n“Aluminum siding can be spot replaced.”\n\nShort Answer (with source):\n\nAluminum siding dents cannot be corrected; matching profiles are discontinued .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested spot replacement for aluminum siding. Aluminum dents cannot be repaired, and per our siding argument, profiles are discontinued and mismatches inevitable. Full replacement is required .\n\n\n\nQ64: Carrier says: \n\n“Vinyl siding repair is simple.”\n\nShort Answer (with source):\n\nVinyl becomes brittle with age; removal cracks panels .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve described vinyl siding repair as simple. In reality, aged vinyl becomes brittle and cracks during removal. This is documented in our siding argument evidence. Repair is not feasible without causing more damage .\n\n\n\nQ65: Adjuster says: \n\n“Shingle repairs are safe.”\n\nShort Answer (with source):\n\nOur repair test shows cracking and sealant failure during attempts .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated repairs are safe. Our repair attempt shows cracking, sealant separation, and additional damage during attempted repairs. This is proof repairs are not safe or viable. Full replacement is required .\n\n\n\nQ66: Carrier says: \n\n“We can repair skylight flashing only.”\n\nShort Answer (with source):\n\nSkylight flashing cannot be reused once removed; requires replacement .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved flashing repair only. Per IRC R703.4, flashing must be watertight at penetrations. Skylight flashing cannot be reused once disturbed and must be replaced to maintain integrity .\n\n\n\nQ67: Adjuster says: \n\n“We’ll replace individual tabs only.”\n\nShort Answer (with source):\n\nTabs cracked during repair attempt, confirming irreparability .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested replacing individual shingle tabs. Our repair attempt showed that lifting tabs caused cracking and separation. This confirms irreparability. Replacement is required .\n\n\n\nQ68: Carrier says: \n\n“Your brittle test isn’t valid.”\n\nShort Answer (with source):\n\nBrittle testing is industry standard and widely accepted .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve dismissed our brittle test. Repair attempt testing is an accepted industry standard to determine shingle reparability. The documented cracking during our test confirms irreparability and requires replacement .\n\n\n\nQ69: Adjuster says: \n\n“Sealant re-bonding solves repair issues.”\n\nShort Answer (with source):\n\nSealant strips failed to re-bond in repair attempt; warranty voided .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated sealant re-bonding solves issues. Our repair attempt shows sealant strips did not re-bond after lifting, leaving the shingles vulnerable to wind uplift. Manufacturer warranties are void in this condition. Replacement is required .\n\n\n\nQ70: Carrier says: \n\n“We’ll use alternate manufacturer shingles.”\n\nShort Answer (with source):\n\nMixing manufacturers violates warranty and creates mismatches .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested alternate manufacturer shingles. The iTel report confirms no acceptable match exists. Mixing shingles from different manufacturers violates warranty and causes visual and structural mismatches. Replacement is required .\n\n\n\nQ71: Adjuster says: \n\n“Your test caused the damage.”\n\nShort Answer (with source):\n\nRepair attempt cracking is proof of brittleness, not damage creation .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated our repair test caused the damage. In fact, the cracking during the repair attempt is conclusive evidence of brittleness and irreparability. Industry standards support testing as proof of storm-related failure .\n\n\n\nQ72: Carrier says: \n\n“Aluminum wrap can be reused.”\n\nShort Answer (with source):\n\nAluminum wrap is distorted once removed and cannot be reused .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve proposed reusing aluminum wrap. Per our siding argument documentation, aluminum wrap distorts when removed and cannot be reused. Replacement is the only feasible option .\n\n\n\nQ73: Adjuster says: \n\n“You didn’t provide enough repair attempts.”\n\nShort Answer (with source):\n\nOne failed repair attempt is sufficient to prove irreparability .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve requested multiple repair attempts. Industry practice requires only one documented failed attempt to prove irreparability. Our attempt shows cracking and tearing, confirming repairs are not possible .\n\n\n\nQ74: Carrier says: \n\n“You can reseal shingles with adhesives.”\n\nShort Answer (with source):\n\nAdhesive reseal voids manufacturer warranty and fails under wind load .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested adhesive resealing. Per GAF Storm Damage Guidelines, artificial adhesive use is not an approved method and voids warranty. Wind resistance is reduced, creating liability. Replacement is the only compliant option .\n\n\n\nQ75: Adjuster says: \n\n“We’ll allow repair, not replacement, on siding.”\n\nShort Answer (with source):\n\nSiding repair requires removal of full wall wrap; partial repair is impossible .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve approved repair only for siding. Per Maryland Code R703, housewrap must overlap at corners, requiring removal of entire walls. This makes spot repair impossible. Full replacement is required .\n\nQ76: Carrier says: \n\n“Code upgrades aren’t required.”\n\nShort Answer (with source):\n\nVA Code R905.2.2 prohibits asphalt shingles under 2/12 slope; flat roofing required .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes code upgrades. Per Virginia Residential Building Code R905.2.2, asphalt shingles may only be installed on slopes of 2:12 or greater. The rear slope of this property measures 1:12. Flat roofing (TPO, rubber, etc.) is required to comply with code. This upgrade is mandatory, not optional .\n\n\n\nQ77: Adjuster says: \n\n“We don’t pay for flashing replacement.”\n\nShort Answer (with source):\n\nVA Code 908.5 requires all damaged/deteriorated flashing be replaced during reroofing .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes flashing replacement. Per VA Code 908.5, all rusted, damaged, or deteriorated flashing must be replaced during reroofing. Reusing old flashing violates state code and poses risk of water intrusion. Flashing replacement must be included .\n\n\n\nQ78: Carrier says: \n\n“No housewrap needed.”\n\nShort Answer (with source):\n\nMD Code R703 requires water-resistive barriers behind siding .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes housewrap. Per Maryland Code R703, water-resistive barriers are required behind siding to prevent water intrusion. Omitting this component violates state building code and leaves the property noncompliant. Housewrap must be included .\n\n\n\nQ79: Adjuster says: \n\n“We’ll just replace panels without wrap.”\n\nShort Answer (with source):\n\nHousewrap must overlap 6″ at corners, requiring full wall removal .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve suggested panel replacement without addressing housewrap. Per Maryland Code R703, housewrap must overlap at least 6 inches at corners, requiring full wall removal. Partial replacement is not feasible or compliant. Full siding replacement is required .\n\n\n\nQ80: Carrier says: \n\n“We don’t pay for ice and water shield.”\n\nShort Answer (with source):\n\nIRC requires ice barrier underlayment at eaves in ice-dam regions .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes ice and water shield. Per the International Residential Code (IRC) adopted in Virginia, an ice barrier underlayment is required at eaves in areas subject to ice dams. This is a code requirement and must be included in scope .\n\n\n\nQ81: Adjuster says: \n\n“Ventilation isn’t required.”\n\nShort Answer (with source):\n\nIRC mandates balanced attic ventilation for shingle roofs .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes ventilation. Per the IRC adopted in Virginia, attic ventilation is required for shingle roofs to prevent moisture accumulation and heat damage. Omission violates building code and voids manufacturer warranties. Ventilation must be included .\n\n\n\nQ82: Carrier says: \n\n“No drip edge required.”\n\nShort Answer (with source):\n\nIRC requires drip edge at eaves/rakes on asphalt shingles .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded drip edge. Per the IRC adopted in Virginia, drip edge is required at eaves and rakes on asphalt shingle roofs. This prevents water infiltration and protects roof sheathing. Drip edge is mandatory .\n\n\n\nQ83: Carrier says: \n\n“We don’t owe for valley liners.”\n\nShort Answer (with source):\n\nIRC requires valley flashing to be replaced when reroofing .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes valley liners. Per IRC 908.5 as adopted in Virginia, valley flashing must be replaced when reroofing. Old valley liners cannot be reused. Replacement is required for compliance .\n\n\n\nQ84: Adjuster says: \n\n“No step flashing required.”\n\nShort Answer (with source):\n\nIRC requires flashing at all wall intersections .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied step flashing. Per IRC R903.2.1, flashing must be installed at wall and roof intersections. Reusing existing flashing violates code and creates water intrusion risks. Step flashing replacement is required .\n\n\n\nQ85: Carrier says: \n\n“We don’t cover counter flashing.”\n\nShort Answer (with source):\n\nCounter flashing must be replaced if damaged/deteriorated per VA Code .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded counter flashing. Per VA Code 908.5, deteriorated or damaged flashing must be replaced during reroofing. Counter flashing around chimneys and walls falls under this requirement. Replacement is mandatory .\n\n\n\nQ86: Adjuster says: \n\n“Kick-out flashing isn’t necessary.”\n\nShort Answer (with source):\n\nIRC requires kick-out flashing at roof-wall intersections .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied kick-out flashing. Per IRC R903.2.1, kick-out flashing is required at roof-wall intersections to divert water away from walls. Omission violates code. Kick-out flashing must be included .\n\n\n\nQ87: Carrier says: \n\n“We don’t owe for chimney cricket.”\n\nShort Answer (with source):\n\nIRC requires crickets on chimneys wider than 30″ .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes a chimney cricket. Per IRC R903.2.2, crickets or saddles are required on chimneys wider than 30 inches to divert water. This is a code requirement and must be included .\n\n\n\nQ88: Adjuster says: \n\n“We don’t owe for starter course.”\n\nShort Answer (with source):\n\nManufacturer guidelines require starter strips for warranty .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied starter course. Per GAF installation standards, starter shingles are required at eaves and rakes to maintain wind resistance warranty. This is a manufacturer requirement and must be covered .\n\n\n\nQ89: Carrier says: \n\n“No ridge cap required.”\n\nShort Answer (with source):\n\nRidge caps must be replaced when removed for slope replacement .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied ridge caps. Per GAF Slope Replacement Requirements, ridge caps must be removed during slope replacement and cannot be reused without voiding warranty. Ridge cap replacement is mandatory .\n\n\n\nQ90: Adjuster says: \n\n“We won’t cover roof deck replacement.”\n\nShort Answer (with source):\n\nIRC requires roof decks to be sound; deteriorated decking must be replaced .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded roof deck replacement. Per the IRC adopted in Virginia, roof sheathing must be solidly sheathed and capable of supporting loads. Rotten or deteriorated decking must be replaced to comply with code .\n\n\n\nQ91: Carrier says: \n\n“We don’t pay for fastener removal.”\n\nShort Answer (with source):\n\nFasteners must be removed to install new roofing per code .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded fastener removal. Per the IRC reroofing section, fasteners must be removed before installing new roofing material to ensure proper fastening and code compliance. This is required work .\n\n\n\nQ92: Adjuster says: \n\n“We don’t owe for felt removal.”\n\nShort Answer (with source):\n\nOld underlayment must be removed when deteriorated per IRC .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied felt removal. Per the IRC reroofing requirements, deteriorated or saturated underlayment must be removed before installing new roofing. Felt removal is mandatory for compliance .\n\n\n\nQ93: Carrier says: \n\n“We don’t cover flashing at eaves.”\n\nShort Answer (with source):\n\nIRC requires flashing at eaves and rakes to prevent water entry .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve excluded eave flashing. Per IRC R903.2.1, flashing must be installed at eaves to prevent water infiltration. This is a code requirement that must be included .\n\n\n\nQ94: Adjuster says: \n\n“Drip edge is optional.”\n\nShort Answer (with source):\n\nDrip edge is mandatory under Virginia-adopted IRC .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve stated drip edge is optional. Per the IRC adopted in Virginia, drip edge is required at eaves and rakes for asphalt shingles. This is a mandatory component and must be included .\n\n\n\nQ95: Carrier says: \n\n“We don’t owe for deck inspection.”\n\nShort Answer (with source):\n\nDecking must be inspected for code compliance; damaged boards replaced .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes deck inspection. Per the IRC reroofing requirements, roof decking must be inspected for structural integrity during reroofing. Damaged boards must be replaced. Inspection is a code-mandated step .\n\n\n\nQ96: Adjuster says: \n\n“No code requirement for siding replacement.”\n\nShort Answer (with source):\n\nMD law requires siding matching when discontinued .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied siding replacement as a code item. Per Maryland Insurance Administration Bulletin 18-23, siding matching is required when discontinued products prevent repair. This is a state regulation requiring coverage .\n\n\n\nQ97: Carrier says: \n\n“We don’t cover weather barrier replacement.”\n\nShort Answer (with source):\n\nMD Code R703 requires WRB behind siding walls .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYour denial excludes WRB replacement. Per Maryland Code R703, weather-resistive barriers are required behind siding for moisture protection. Replacement is mandatory when siding is replaced .\n\n\n\nQ98: Adjuster says: \n\n“We don’t cover rake trim.”\n\nShort Answer (with source):\n\nTrim replacement required when removed for siding/roof replacement .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied rake trim. Per our siding argument documentation, rake trim must be removed for siding and roofing work. It cannot be reused without compromising fit. Replacement is required .\n\n\n\nQ99: Carrier says: \n\n“We don’t owe for caulking/sealant.”\n\nShort Answer (with source):\n\nSealant required at flashing and penetrations per IRC .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied sealant. Per IRC R903.2.1, flashing must be sealed at penetrations and joints. Sealant is required for compliance and must be included .\n\n\n\nQ100: Adjuster says: \n\n“No compliance issues apply.”\n\nShort Answer (with source):\n\nState building codes mandate multiple items (flashing, WRB, underlayment, drip edge) .\n\nDetailed Answer (Email Draft):\n\nTo whom it may concern,\n\nYou’ve denied all code compliance items. Per the IRC and state-adopted codes in Virginia and Maryland, reroofing requires drip edge, flashing replacement, weather barriers, and underlayment. These items are mandatory and must be included to bring the property into compliance .\n\n\n\n\n\n",
  "textLength": 47824,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}