{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Email Templates/Request For Appraisal.docx",
  "name": "Request For Appraisal.docx",
  "type": "docx",
  "size": 8386,
  "relativePath": "Email Templates/Request For Appraisal.docx",
  "category": "email_templates",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:30.103Z",
  "extractedText": "Please send exactly what is below to your customer.\n\nPlease call your customer first and let them know what you will be sending them and what they need to do with it.\n\nRead the instructions that you will be sending them.  They have to write a brand new email to their adjuster and copy and paste the template that you send them.\n\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL INSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER.  EVERYTHING IN THE BRACKETS [ ] AND/OR HIGHLIGHTED SHOULD BE DELETED BEFORE SENDING\n\n\n\nHello sir or ma’am. [please delete one of these]\n\n\n\nBelow is the template we spoke about.  Please copy and paste and send to claims@claims.allstate.com.[please change this if it is not Allstate]Please use the Claim Number below as the subject line. Please BCC on the email.  Also, please forward me anything they respond with.\n\n\n\nThank you!\n\n____________________________________________________\n\nDate of Loss: 07/14/2023  [please edit this info!!!]\n\nInsurance Policy Number:  000801216465\n\nClaim Number:  0728567686\n\n\n\nTo Whom It May Concern,\n\n\n\nThis letter is to notify you that we strongly disagree with the amount of loss you have calculated on the above referenced claim. As a result of our inability to reach an agreeable settlement on the “amount of loss”, we hereby invoke the appraisal clause, in writing, per our policy. This written demand is to advise you that this appraisal will include the “amount of loss” for Cov A (Dwelling). My contractor, Reese Samala [Edit this to your name] with Roof ER, has provided and submitted evidence of the necessity for our roof [and siding - please remove this if it is roof only] to be fully replaced and have estimated that cost to be $39,705.35, [please edit this amount to the repair/supplemented estimate that Danny, Amber, or Ed wrote.] while Allstate [please change if not Allstate] has provided a partial replacement estimate for $7,259.21. [please edit the amount of this partial to what the insurance company’s most recent partial is.]\n\n\n\nWe have selected Edmund O’Brien. He can be reached at:\n\nPh: 270-839-4971\n\nEm: ed@keyadjusting.com\n\n\n\nWe appreciate your prompt attention to this matter. Please notify us, as well as our appraiser, as to whom you will be naming as your appraiser. Please include as much contact information you can on this individual so the appraisal process can begin as soon as possible.\n\n\n\nRegards, \n\n\n\nCUSTOMER’S NAME\n\n\n\n",
  "textLength": 2448,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}