{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Roof-ER Sales Training.pptx.pdf",
  "name": "Roof-ER Sales Training.pptx.pdf",
  "type": "pdf",
  "size": 14560946,
  "relativePath": "Roof-ER Sales Training.pptx.pdf",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:00:53.497Z",
  "extractedText": "Roof-ER Sales Training\n\n\n\n\nGoogle \nDrive\n\nInitial Pitch\n5 Non-Negotiables\n▪Who you are\n▪Who we are and what we do (Roof ER)\n▪Make it relatable\n▪What you’re there to do (an inspection)\n▪Go for the close (them agreeing to the inspection)\n\n\nInitial Pitch\nKnocking Etiquette\n\nInitial Pitch\n▪“Hi, how are you? My Name is ________ with Roof- ER \nwe’re a local roofing company that specializes in \nhelping homeowners get their roof replaced, paid for \nby their insurance!”  \n▪Generic:\n▪“We’ve had a lot of storms here in Northern \nVirginia/Central Virginia/Philadelphia/Maryland over \nthe past few months that have done a lot of damage! \n▪“We’re already working with your neighbors. We’ve \nbeen able to help them get fully approved through their \ninsurance company to have their roof  replaced.”\n\n\nInitial Pitch\n▪“While I’m here, in the neighborhood, I am conducting a completely \nfree inspection to see if you have similar, qualifiable damage. If you do,  \nI’ll take a bunch of photos and walk you through the rest of the process. \nIf you don’t, I wouldn’t want to waste your time, I wouldn’t want to waste \nmine! I will at least leave giving you peace of mind that you’re in good \nshape.”\n▪Pause here – Wait for them to respond/agree.\n▪Once they agree to let you do the inspection:, “Alright! It will take me \nabout 10 - 15 minutes. I’m gonna take a look around the perimeter of \nyour home, then grab the ladder, and take a look at your roof.\n▪Go in for a handshake. “What was your name again? [Their name] great \nto meet you, again I am (your name).  Oh and by the way do you know \nwho your insurance company is”? Wait for their answer, “Great! We work \nwith those guys all the time.”\n▪“Here’s my card/flier, look us up while I’m conducting the inspection! I \nwill give you a knock when I finish up and show you what I’ve found.”\n▪Without any hesitation, move into inspection. (See Inspection and \nPost-Inspection Script for detailed next steps.)\n\n\nInitial Pitch\n▪Break into groups\n▪Switch between Sales Rep and Homeowner\n▪Read the script a few times each\n\nInitial Pitch\n▪Specific\n▪“Were you home for the storm we had in ___. Wait for \nanswer\n▪If yes “It was pretty crazy right?! Wait for answer \n▪If no: “Oh no worries at all, we get that all the time.\n▪If yes move on to next line marked with *\n▪If no “That’s good! It was a pretty bad one.”\n▪*“We’re working with a lot of your neighbors in the \narea. We’ve been able to help them get fully approved \nthrough their insurance company to have their roof \nreplaced.”\n\n\nInitial Pitch \nQuiz\n▪What are the 5 Non-Negotiables?\n▪What are the first two sentences of the Initial Pitch?\n▪What are the next 2 in the generic script?\n▪What are the next 3 lines if you are mentioning a \nspecific storm date?\n▪Fill in the blanks: “While I’m here in the neighborhood, I \nam conducting a _____ _____ ____ __ __ __ __ ____ \n______, ________damage.\n▪What are the next 2 sentences after they agree to let you \ndo the inspection?\n▪What is the last sentence of the Initial Pitch Script?\n\nField Portal \nApp\n▪The Field Portal App will be used mostly on your phone \n(but is also useable on your iPad)\n▪Later on this week, we will review using the Field Portal \nApp on a laptop or desktop which is the most ideal way \nto keep your jobs organized\n▪On the Field Portal App, you can:\n▪Track your jobs and what stage they are in\n▪Review Metrics\n▪Pin houses and create leads\n▪Create and upload your Photo reports\n▪Schedule customer-related events\n▪Review Tasks and Messages\n▪Check the Trade Calendar to see when your installs are \ngoing up\n\nField Portal \nApp\n▪Pinning Houses\n\nField Portal \nApp\n\n\n\n\n\n▪You can view a list of your door knocks.\n\nObjections\n▪Common Objections\n▪“not interested”\n▪“I need to talk to my spouse”\n▪“I don’t have enough time”\n▪“my roof is in good shape”\n▪“I just had it checked”\n▪“I don’t have the money for anything right now”\n▪“I have a roofer knock my door at least 5 times a week”\n▪“my roof is only 18 years old and is a 50 year roof”\n▪Tips:\n▪Always react positively with an agreeable response and \nattitude\n▪Ask questions when appropriate\n▪Repeat the customers’ objections when appropriate\n\nInitial Pitch\n▪Please memorize the whole Generic initial pitch \n▪Please also be familiar with the Specific Pitch\n\nInitial Pitch\n▪Pitch and Objection Practice\n\nBasic Roofing\n▪Most Common Roofing Material - Asphalt\n▪Other Roofing Material\n▪Metal\n▪Cedar/Wood/synthetic\n▪TPO/EPDM/Rolled Asphalt\n▪Gable Roof\n▪Hipped Roof\n▪Common Terms\n▪Eave\n▪Rake\n▪Ridge\n\nBasic Roofing\n\nBasic Roofing\n▪Flashing: a thin material, usually metal, that roofers \nuse to direct water away from critical areas of the \nroof.\n▪Types of Flashing\n▪Step\n▪Counter/Apron\n▪Chimney\n▪Skylight\n\nShingles\n\nDiscontinued \nShingles\n\nThe Sales \nCycle:\nGenerating \nNew Business\n▪KNOCK KNOCK KNOCK\n▪Make it a goal to knock 70 doors minimum per day\n▪Pin the houses\n▪Take good (quick) notes\n▪KNOCK SOME MORE\n\nThe Sales \nCycle:\nInspections\n▪Conduct the inspection in the order of the inspection\n▪Think about safety\n▪If you do not feel safe, DO NOT DO THE INSPECTION\n▪Always ensure ladder is safely placed\n▪Safety items you should consider:\n▪Cougar Paws (Get this before anything else)\n▪Bungee Cords\n▪Pitch Hopper\n▪Other roofing items – reach out to discuss additional \nsafety items\n\n\n\nThe Sales \nCycle:\nAdjuster \nMeeting\n▪Adjuster meeting typically happens within 2 – 7 days\n▪You meet with the insurance adjuster\n▪You will also be creating your formal photo report this \nday\n▪The decision from the insurance company usually \ncomes within 1 – 10 business days\n▪Once a decision is made, they usually only send the \nestimate to the homeowner\n▪Ensure the homeowner is prepped to send this to you if \nthe insurance company does not send it to you\n▪Don’t worry – we will review this in much more detail \nlater – we just want to ensure you understand the \ntimeline at this point\n\nThe Sales \nCycle:\nProject \nMeeting\n▪After you send the estimate to Amber \n(estimates@theroofdocs.com) and to me, we will begin to \nreview the estimate and conduct what is called a Project \nReview\n▪Within a few days, the job will be assigned to one of our \nProject Coordinators who will schedule a Project Meeting \nwith your homeowner\n▪This typically happens within a week of receiving the \nestimate\n▪After that meeting, the homeowner will sign the Project \nDocuments and submit Downpayment.\n▪The Downpayment will typically be the first payment the \ninsurance company sends. This payment is called Actual \nCash Value (ACV)\n▪You receive $1,000 of the job at Downpayment.\n\nThe Sales \nCycle:\nInstall and \nFinal Payment\n▪The install will typically be scheduled in 4 – 6 weeks from \nthe time that the Homeowner submits Downpayment\n▪After the install is complete, we will schedule a Quality \nCheck and Wrap Up with the homeowner. \n▪They will sign the Certificate of Completion here and we will \nsubmit this to the insurance company\n▪The insurance company will then release the remaining \nfunds.  They call this payment Depreciation.\n▪The Homeowner then submits Final Payment.  This payment \nis a combination of the Depreciation plus their insurance \ndeductible.\n▪Once they submit Final Payment, you will receive the \nremaining 16% of the job.\n▪The first 6 weeks, you get 16% of all completed jobs. After that, \nyou have to qualify to get the max of 16%.\n\nThe Sales \nCycle:\nCommission \n%’s and \nBonuses\n▪Insurance Sales\n▪$1000 paid on Downpayment\n▪Townhomes do not count as a sign/up \nsale unless:\n▪Has aluminum siding\n▪A minimum of 15sqs\n▪March - October\n▪10+ Sign ups:  16%\n▪8 - 9 Sign ups: 10%\n▪Less than 8 Sign ups: 6%\n▪November and February\n▪8+ Sign Ups:  16%\n▪Less than 8 Sign ups: 6%\n▪December and January\n▪4+ Sign ups:  16%\n▪Less than 4 Sign ups: 6%\n▪Retail\n▪Nothing paid on Downpayment\n▪Solar: 2%\n▪Other than Solar: 2%\n•15 Sign Ups or $250k in \nRevenue:  $2k\n•20 Sign Ups or $300k in \nRevenue: $4k\n•25 Sign Ups or $350k in \nRevenue:  $6k\n•30 Sign Ups or $400k in \nRevenue: $10k\n•35 Sign Ups or $450k in \nRevenue: $12k\n•40 Sign Ups or $500k in \nRevenue: $16k\n•President’s Club\n•$2mil Annual Sales -or-\n•$750k in 3 consecutive \nmonths in revenue\n•There will also be monthly \nincentives to earn additional \nbonuses, items (watches, golf \nclubs, etc), and events.\n•Rep has the option to receive \nbonus in first 90 days even if \nthey have a negative draw \nbalance\n•All bonuses and incentives will \nbe applied towards negative \ndraw balance first\n\n1099 + \nWorkers Comp\n▪1099 Tips\n▪Workers Comp requirement\n\nRecap\n▪Please have Generic Initial Pitch completely memorized\n▪Please always be safe when conducting inspections\n▪Sales Cycle: 9 – 16 weeks from sign up\n▪Work towards those bonuses! How? KNOCK KNOCK KNOCK\n▪Be familiar with the different type of shingles\n▪Please setup/submit Worker’s Comp to me\n▪I will then send you Gusto (direct deposit) email\n▪Please be here at 1000am tomorrow and ready to start\n▪TRAFFIC\n▪Please wear your Roof ER shirt and comfortable and durable \nshoes/pants for roof inspections\n▪Have a great evening!\n\nRoof-ER Sales Training\nWelcome:\n\nPrepare a quick introduction for the sales \nmeeting today.\n●What industry are you coming from?\n●What are you looking forward to working at \nRoof-ER?\n\n\n\nStorm \nDamage\n\nGoogle \nDrive\n\nInspection\n▪Mailbox/House Number \n▪Overview of House \n▪Front Elevation Collateral\n▪Damage to screens, gutters, downspouts, siding \n▪Right Elevation  Collateral\n▪Damage to screens, gutters, downspouts, siding \n▪Rear Elevation Collateral\n▪Damage to screens, gutters, downspouts, siding \n▪Left Elevation Collateral\n▪Damage to screens, gutters, downspouts, siding \n▪Roof Overview Collateral\n▪Damage to roof metals and other collateral on the roof\n▪Circle Hail Hits & Slash Wind Damage (close up of each) \n▪Overview of majority of the damage chalked up \n▪Pictures of granules in the gutters or at the bottom of downspouts  \n▪Entire inspection shouldn’t take any longer than 15-20 minutes. How thorough of an \ninspection you  should do is a judgment call. Getting enough photos to sell the homeowner is \nmost important. It doesn’t  matter how quickly you are able to complete the inspection if you \ndon’t have enough damage-photos for  the homeowner to be on board with filing the claim. \n▪Flashlight\n\nPost-Inspection \nPitch\n▪Knock on the door \n▪“Hey _______, so I have a bunch of photos to show you. \nFirst I walked around the perimeter of the house  to look \nfor collateral damage. I’ll also show you the collateral \ndamage we found on the roof.” Say this while going \nthrough house number and overview photos \n▪Start showing the pictures of damage to screens, \ngutters, downspouts, and soft metals\n▪“While this damage functionally isn’t a big deal, it really \nhelps build a story.  Think of us like lawyers and this \ncollateral damage is the evidence that builds the case \nwhich helps us get the roof approved.”\n▪Continue to slide through collateral damage photos\n\n\nPost-Inspection \nPitch\n▪“Here are the photos of the damage to your shingles. \nAnything I have circled means its hail damage\n▪Remain on a photo of hail damage as you explain the \nfollowing\n▪“This is exactly what we look for when we're looking for hail \ndamage. If you notice, the divot is circular  in nature.   Even if \nthis  damage doesn’t look like a big deal, what happens over \ntime, these hail divots fill with water, freeze....,  when water \nfreezes it expands and breaks apart the shingle which will \neventually lead to leaks.  That is why your insurance \ncompany is responsible and your policy covers this type of \ndamage.” \n▪Start slowly swiping through all the pictures of hail. \n▪“As you can see there is quite a bit of damage.  \n▪Start slowly swiping through all the pictures of hail. \n\nPost-Inspection \nPitch\n▪Now show them pictures of the granules in gutters and \ndownspouts\n▪“As you can see here, granules have filled up your \ngutters. These granules are supposed to be what’s \nprotecting your home. When wind and hail hits your \nroof, it knocks out these granules which reduces the \nlifespan of your roof.”\n▪Put phone away\n▪“This is very similar to damage to ________’s home \nand/or the rest of the approvals we’ve gotten in the \narea”.  \n\nPost-Inspection \nPitch\n▪“With that being said, insurance companies are always \nlooking for ways to mitigate their losses. It’s unfortunate \nbut that’s how they make money. The most important \npart of this process is that when your insurance \ncompany comes out to run their inspection, we are here \nas storm experts to make sure you as a homeowner get \na fair shake. If they are missing anything we make sure \nthey see all the damage that I  just showed you.” \n▪“What I’m going to do now is run to my car, grab my \niPad and we can get this process started”! Go get iPad \n▪As you approach back to the house/homeowner ask “Is \nthere a place we could sit down for 5-10  Minutes”?\n▪Once you are in the house, spend some time building \nrapport as you get settled. \n\nPost-Inspection \nPitch\n▪“Okay, so first I am going to grab some of your basic information for our \nsystem. Then we can let your insurance company know about the \ndamage”. \n▪Gather information from the homeowner:\n▪Full name\n▪Address\n▪Phone Number  \n▪E-mail\n▪Insurance Company\n▪“Do you happen to know your deductible? If not, no big deal at all”! \n▪After you have collected all the information:\n▪Ask if they have the app or if they have the login to the website. \n▪If not, use the Homeowner Information Sheet to prep the HO.  As you are \nwriting or typing the information for the HO to use on the call, explain \neach part to them.\n▪As much as possible, use HO’s phone to make the call \n▪Reference Claim Filing Information Sheet\n▪Move on to Contingency & Claim Authorization\n\nPost-Inspection \nPitch:\nAdditional lines \nif wind damage \nis present\n▪“Here are the photos of the damage to your shingles. \nAnything I have circled means its hail damage and  \nanything I have slashed means its wind damage.”\n▪After you go through the lines explaining the hail \ndamage, say:\n▪“Now here are the wind damaged shingles. You have \n(both,) shingles that are creased from the wind lifting \nthem up (and shingles that have completely been blown \noff.”)\n▪Show the pictures of wind damaged and/or missing \nshingles\n\n\n\nPost \nInspection \nPitch\n▪Break into groups\n▪Read through Post Inspection Pitch with Hail Damage a \nfew times\n▪WHEN IN DOUBT, SIGN IT UP. Not every roof is going to \nlook like it was destroyed by 4 inch hail.  But, we still \nfind a lot of success here.\n\nInspection and \nPost-Inspectio\nn Quiz\n▪What are the first pictures you take when you are on the \nroof?\n▪You should ask if they have the insurance company’s \napp or website login first – True or False?\n▪We should be mainly focusing on Wind Only claims – \nTure or False?\n▪What symbol do we use to mark hail damage?\n▪What symbol is used to mark wind damage?\n▪What are 2 methods you can use to see hail damage to \nmetals better?\n▪You should take all photos of hail damage first (so that \nthey are grouped,) and then all photos of wind damage \nafter – True or False?\n\n\nClaim Filing \nInformation \nSheet\n\nClaim Filing \nInformation \nSheet\n\nCalling the \nInsurance \nCompany\n▪Examples\n▪I will demonstrate a few examples\n▪Connect with your trainers on how to assist your clients \nwith filing this claim\n\nPutting the \nscript \ntogether\n▪Go through Initial Pitch without script\n▪Go straight to Inspection and Post-Inspection pitch \nwhile reading script\n\nRecap\n▪Familiarize yourself with Storm Damage\n▪Memorize the order of the Inspection\n▪Have Initial Pitch (non-storm environment) and (Hail \nOnly) Post-Inspection Pitch memorized\n▪Familiarize yourself with Claim Filing Information Sheet\n▪Always ask Homeowner if they have the website login \nor app to file the claim first\n▪Please be in and ready to start tomorrow morning at \n1000am\n\nRoof-ER Sales Training\nWelcome:\n\n\nInitial Pitch and \nPost-Inspection \nPitch\nReview together\n\nSales App \n(Only on your \niPad)\n\nContingency \nand Claim \nAuthorization\n\nGoogle \nDrive\n\nContingency & \nClaim \nAuthorization \nScript\n▪This is where you really go for the close\n▪After filing the claim: “Okay, perfect! Like they said, an \nadjuster will be reaching out to you in the next 24 to 48 \nhours to schedule the inspection. The absolute most \nimportant part of this process is that I am at this \ninspection. Insurance companies don’t want to pay out. \nThey are trying to mitigate their losses after storms. I \nam there as your representation to make sure you get a \nfair shake.”\n▪Turn the iPad so you and the homeowner can see. \n\n\nContingency & \nClaim \nAuthorization \nScript\n▪“This basic/simple agreement backs you as the \nhomeowner by guaranteeing you that your only cost will \nbe your deductible if we get you fully approved. If it is a \npartial approval or denial, first we will fight and jump \nthrough the necessary hoops to turn that into a full \napproval; but if we are not able to get you fully \napproved, this contract is null and void and you do not \nowe us a penny.\n▪“What’s in it for us, is we just want to get to do the work. \nThis agreement commits you to using us if we hold up \nour end of the bargain and achieve a full-approval.”\n▪You sign\n▪They sign\n\nContingency & \nClaim \nAuthorization \nScript\n▪“This next form is our Claim Authorization form.  Very \nsimple, it allows us to communicate with your insurance \ncompany.  I’ll be here for the inspection and  we will \nalso communicate with them through email and phone \ncalls so you don’t have to be a middle-man.  Of course, \nI’ll always keep you looped in with our communication \nby CCing you in all emails and updating you on any \nconversations we have.”\n▪They sign\n▪Press Submit enter password “roofer” if it asks.\n\nContingency & \nClaim \nAuthorization \nScript\n▪“Alright, we are all set! Again, the most important part \nof this process is that I am here when the insurance \ncompany comes out.  Ideally you can have them call me \nto schedule that directly. If they call me, great! But, \nregardless, please get the adjuster’s information (name, \nemail, phone number) and send that over to me so that I \ncan communicate with them before the inspection. If \nthey insist on scheduling with you, go ahead and pencil \nin a time and avoid these times and days [provide your \nschedule]\n▪Answer any questions that the HO may have\n▪“Thank you, sir/ma’am, looking forward to seeing you \non the day of inspection, you have my contact \ninformation on my card if you need anything else.”\n\nContingency \nand Claim \nAuthorization\n\nGroupMe\n▪Be active in the GroupMe!\n▪Post your Sign Ups on GroupMe – this is how they are \ntracked\n▪Always start with “Sign Up:”\n▪Format: Sign up / Storm Damage Item 1 / Storm \nDamage Item 2 / Storm Damage Item etc. / Insurance \nCompany / Customer Last Name\n▪Example: Sign up / Roof / Siding / Gutters / DS / \nAllstate / Francis\n\nAdjuster \nMeeting \nScheduling\n▪The Insurance Company will schedule the Adjuster \nMeeting after you assist the Homeowner in filing the \nclaim\n▪Try to take control of this (Homeowner must be present \nif there is interior damage)\n▪You have the ability to reach out to the Adjuster to try \nand get this rescheduled with the Homeowner’s \nunderstanding\n▪As much as possible, avoid Tuesday mornings for \nAdjuster Meetings, as we have our Weekly Sales \nMeetings\n▪ASK YOUR TRAINER IF THEY HAVE AN ADJUSTER \nMEETING YOU CAN ATTEND WITH THEM \n\nScheduling \nAdjuster \nMeetings in the \nField Portal App\n\nContingency & \nClaim \nAuthorization \nScript\n▪Break into groups\n▪Read through Contingency & Claim Authorization Script \na few times\n\nPhoto Reports\n\nQuiz\n▪You can add an Adjuster Meeting to your Google \nCalendar through the Field Portal App – True or False?\n▪Should you CC the Homeowner when you are \nscheduling an Adjuster Meeting on your calendar?\n▪What time and day is our Weekly Sales Meeting?\n▪What is the Homeowner’s incurred cost outlined in the \nContingency Agreement?\n▪When is that cost paid?\n▪Briefly explain what the Claim Authorization allows?\n\n\n\nSales App:\nOther \nAgreements\n•Try this in your iPad\n•Navigate through each \nagreement\n\nRecap\n▪Please Review Scripts!\n▪Lean on your trainers for understanding of the \ntechnology that we use\n▪Be active on GroupMe\n▪Be in and ready to start tomorrow at 1000am\n\nRoof-ER Sales Training\nWelcome:\n\n\nPut Everything \nTogether\n▪Break into groups\n▪Review as much of the script as you can without having \nto read off of it.\n\nPartials - \nExpectations\n▪Not all of your jobs will be approved the first time\n▪ Do not get discouraged\n▪Remember, insurance companies are looking for ways to \nsave an extra penny at the expense of their policy holders\n▪Work with your trainers on how they turn jobs around\n▪Reach out to me\n▪You will hear a lot from me on your first few claims, I will \ngive you all the steps necessary to find success for the \nones that end up a partial or denial.\n\nField Portal:\nMessage \nBoard\nAfter 2 weeks of not responding to messages, your \njob will be reassigned to someone else.\n\nField Portal:\nTasks\n\nJob Stages & \nOrganization\n▪We will review each job stage\n▪It is easiest to stay organized by using the Field Portal \nwebsite on a computer or laptop\n\nField Portal:\nTrade \nCalendar\n\nAdjuster \nMeeting and \nPhoto Reports\n▪Attend the next 2 or 3 Adjuster Meetings with your Field Trainer\n▪Have your Field Trainer or someone in leadership assist you with your first 2 \nAdjuster Meetings\n▪Adjuster Meeting DO’s:\n▪Show up 15 – 30 minutes early. Let the Homeowner know that you’ll be waiting for \nthe Adjuster/Ladder Assist to arrive before you begin the inspection\n▪Chalk up metals the day before (Not shingles)\n▪Build rapport with the Adjuster/Ladder Assist\n▪Be confident and tactful when interacting with the Adjuster\n▪Always be present when the Adjuster/Ladder Assist is interacting with the \nHomeowner\n▪Adjuster Meeting DO NOT’S:\n▪Do not get on the roof on the day of the AM before the Adjuster gets there\n▪Do not be confrontational or argumentative with the Adjuster\n▪Do not be a push over but instead tactfully explain your position if there happens to \nbe a disagreement\n▪Do not start taking your Photo Report and Hover photos while the Adjuster is \nconducting the inspection – offer assistance in any way. Avoid taking pictures \nduring the inspection unless there is a clear opportunity to (I will give an example \nhere)\n▪Photo reports are always taken with the phone in PORTRAIT ORIENTATION. \nLandscape oriented photos will not populate properly\n\nHover Reports\n▪You will always use the Hover App – but it launches from \nyour Field Portal App. Your trainer will show this to you.\n▪Photos can be taken in Portrait or Landscape orientation \n– Landscape is usually more effective \n\nPhoto Reports\n\nPhoto Reports\n\nPhoto Reports\n\nPhoto Reports\n\nPhoto Reports\n\nPhoto Reports\n\nPhoto Reports\n\nQuiz\n▪You should already be on the roof when the Adjuster \narrives for an Adjuster Meeting – True or False?\n▪Where is Step Flashing typically located?\n▪What is important to find when you find Step Flashing?\n▪Where is Counter/Apron Flashing typically located?\n▪During your Photo Report, you should always hold the \nphone normally (Portrait Orientation) NOT in the \nLandscape orientation -  True or False?\n▪What orientation can your phone be in for the Hover \nReport?\n▪Can you access the Field Portal through a website on a \ncomputer or laptop?\n\nScript Review\n▪More review \n(Practice Makes \nPerfect!)\n▪If you are “Cleared to \nSell” today, you can \nstart signing up \ndeals!\n\nRecap\n▪Continue to review using the Field Portal App and Sales \nApp\n▪Continue to memorize and perfect the entire script\n▪Attend Adjuster Meetings with your Field Trainer\n▪Make sure you inform your Field Trainer of your own \nAdjuster Meetings so that they can be there or have \nsomeone else assist you with your first 2 Adjuster \nMeetings\n▪Please be in and ready to start at 1000am tomorrow\n\nRoof-ER Sales Training\n\n\n\nShingle Quiz\n\nShingle Quiz\n\nShingle Quiz\n\nShingle Quiz\n\nGoogle \nDrive\n\nAdditional \nScripts\n▪We will briefly review the remaining scripts\n▪Continue to review on your own and with your Field \nTrainer\n▪We will dive a little deeper into the Post AM Script and \nFull Approval Estimate Phone Call (not required to \nmemorize)\n\nEmail \nTemplates\n▪We will briefly review these now\n▪Be most comfortable with Post AM Email Template\n\nAverage \nTicket/Trackin\ng Sales\n▪Average ticket as a company is between $23k - $25k\n▪This average varies greatly per sales rep!\n▪Naturally, sales reps who have been here longer have average \ntickets of $30-$40k+!\n▪While, on the other hand, newer reps will sometimes have average \ntickets of $15-20k or less.\n▪Tips to increase average ticket\n▪Take pictures of hail damage to: \n▪DOWNSPOUTS and GUTTERS\n▪WINDOW WRAPS\n▪WINDOW SCREENS\n▪ALL METALS THAT CAN POTENTIALLY BE DAMAGED BY HAIL\n▪METAL ROOFING ESPECIALLY OVER WINDOWS OR PORCHES\n▪Track your sales\n▪Sales Tracker\n\n\n\n\nTechnology\n▪Let’s take some time, if needed, to answer any \ntechnology questions that you may have\n\nCommon \nAbbreviations\n▪HO = Homeowner\n▪FU = Follow Up\n▪AM = Adjuster Meeting\n▪SF = State Farm\n▪PC = Project Coordinator\n▪PM = Project Meeting\n▪Supp = Supplement\n▪RA = Repair Attempt\n▪WND = Work Not Doing\n▪LVM = Left Voicemail\n▪ACV = Actual Cash Value\n▪DP = Downpayment\n▪PA = Public Adjuster\n▪CP = Completion Payment\n▪CF = Completion Form\n▪FP = Final Payment\n▪IWS = Ice Water Shield\n▪PIS = Post Install Supplement\n▪WU = Wrap Up\n▪FT = Field Tech\n▪INS = Insurance\n▪OOT/OOO = Out of Town/Office\n▪AR = Accounts Receivable \n\nReview\n▪We have reviewed a lot\n▪Continue to review and reach out to your Field Trainer \nor anyone else with any questions\n▪BUT – even if you do not remember anything else from \nthis training – CONSISTENCY IS KEY\n▪Knowing the script perfectly will not help if you are not \nout there making it happen\n▪We can GUARANTEE success if you are doing consistently \nwhat you are doing with your Field Trainer this week – five \nor six times a week knocking 60, 70, or 80+ doors a day\n\nQuiz\n▪What resource has templates, additional documents, our \nlicenses/certification, and a lot of other useful \ninformation?\n▪Analyze this sentence: “HO LVM with SF asking about \nACV. HO has not received ACV and cannot pay DP. FU \non 15 March at 4pm.”\n▪HAVE A GOAL\n\n\n\nFinal Script \nReview\n\nMission and \nValues\nOur Mission:\n▪At Roof-ER, our mission is to hold a fiduciary responsibility to our customers - plain and simple. \nIn an industry known for poor workmanship, lack of communication, and at times, outright \ndeceit; we seek to restore the name of exterior remodeling contractors nationwide. By \ncommitting to our core values of Integrity, Quality, and Simplicity, we promise to deliver an \nexperience every homeowner wants when remodeling their home: a simple and straightforward \nquality installation for a fair and honest price.\n\nOur Core Values:\n▪Integrity: At Roof-ER, we set the standard for Integrity in an industry that has lost credibility \namong many consumers. We do not only set the standard of integrity with our clients, but it \nstarts with being honest to ourselves. We have the courage to truly see ourselves, recognize \nwhere we can grow, and implement changes to meet the demands of reality.\n▪Quality: We guarantee the highest Quality in our products and services.  Our confidence in our \ncraft propels us into the elite 2% of all roofing companies in the entire nation. Quality starts with \nthe moment a client interacts with one of our representatives at the door.  The Quality \ndemonstrated in every aspect of what we do continues to make Roof-ER the gold standard of \nthis industry.\n▪Simplicity: We strive to deliver an overwhelmingly positive experience for everyone who \ninteracts with Roof-ER.  By embracing the complexities of our industry, we provide exceptional \nresults to our clients.  Our clients value the Simplicity of partnering with us – we guarantee a \nseamless process from start to finish ensuring satisfaction with the final outcome.\nCheck out this Yelp Review!\n\nLet’s Make it \nHappen!!!!\n▪Please feel free to reach out to me (Reese) any time.  If I \ndo not answer, I will always return your call.  You can \nalso text or email me any time.\n▪Please stay in contact with your Field Trainers and lean \non them for continued success\n▪Ensure you are already aware of your weekend training \ndays with your Field Trainer this weekend.\n▪You can also reach out to Oliver or Ford whenever you \nneed them\n▪Get Sign Ups – Get those bonuses – Close those houses \n– be the next Roof ER success story!",
  "textLength": 28397,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}