{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/RoofER_Master_Documents.pdf",
  "name": "RoofER_Master_Documents.pdf",
  "type": "pdf",
  "size": 138592,
  "relativePath": "RoofER_Master_Documents.pdf",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:00:55.813Z",
  "extractedText": "Claim Filing Information Sheet\nYou should use this information to prep the HO – Use a blank note on your iPad\nHO: “I’d like to file a claim for hail [and wind] damage” (never only wind)\nInsurance: “What was damaged?”\nRoof\nDownspouts\nGutters\nWindow Wraps\nSiding\nEtc.\nDate of loss\nTime of storm (usually around 5pm)\nSize of hail (usually 1 – 1.5 inches)\nType of shingle and/or siding\nAny interior damage?\nIs the house livable?\nWas there any personal property damaged?\nDid they lose power?\nHave you selected a contractor? (yes, we want them to know ASAP that you are working with me)\nDo they have an estimate? (always no)\nIs your roof steeper than an average staircase?\nHow high is the roof/is it difficult to access with most ladders?\nThings they should do on the call:\nAsk for adjuster info, if not available yet, that’s okay too.\nAlways ask for claim number\nIf Claim Rep wants to schedule the inspection now (only Allstate) – have 3 available times listed out\nfor the HO\nSee example on next page\nExample Customer Info Sheet\n\nLet them know you would like to file a claim for hail and wind damage.\nWhat was damaged: Roof and Aluminum siding\nDate of the storm: September 8th 2023\nTime of the storm: Around 5pm\nSize of hail: 1 inch\nType of shingle: Asphalt\nType of siding: Aluminum\nInterior Damage: Yes, 1 bedroom upstairs\nIs the house livable: Yes\nWas there any personal property damaged: No\nDid they lose power: No\nHave you selected a contractor: Yes, Roof ER out of Vienna VA. All my information is on the\nbusiness card\nDid they give you an estimate: No\nIs your roof steeper than a staircase: No\nHow high is your roof/is it difficult to access with most ladders: No, it has 1 story access\nAfter they say the claim is filed, please ask for the Claim Number\nAfter they provide that, ask if an adjuster has been assigned\n\nContingency & Claim Authorization\nAfter the claim: “Okay, perfect! Like they said, an adjuster will be reaching out to you in the next 24\nto 48 hours to schedule the inspection. The absolute most important part of this process is that I am\nat this inspection. Insurance companies don’t want to pay out. They are trying to mitigate their\nlosses after storms. I am there as your representation to make sure you get a fair shake.\nTurn the iPad so you and the homeowner can see. \n“This basic/simple agreement backs you as the homeowner by guaranteeing you that your only cost\nwill be your deductible if we get you fully approved. If it is a partial approval or denial, first we will\nfight and jump through the necessary hoops to turn that into a full approval; but if we are not able to\nget you fully approved, this contract is null and void and you do not owe us a penny.”\n“What’s in it for us, is we just want to get to do the work. This agreement commits you to using us if\nwe hold up our end of the bargain and achieve a full-approval.”\nYou sign\nThey sign\n“This next form is our Claim Authorization form. Very simple, it allows us to communicate with your\ninsurance company. I’ll be here for the inspection and we will also communicate with them through\nemail and phone calls so you don’t have to be a middle-man. Of course, I’ll always keep you looped\nin with our communication by CCing you in all emails and updating you on any conversations we\nhave.\nThey sign\nPress Submit enter password “roofer” if it asks.\n“Alright, we are all set! Again, the most important part of this process is that I am here when the\ninsurance company comes out. Ideally you can have them call me to schedule that directly. If they\ncall me, great! But, regardless, please get the adjuster’s information (name, email, phone number)\nand send that over to me so that I can communicate with them before the inspection. If they insist\non scheduling with you, go ahead and pencil in a time and avoid these times and days [provide your\nschedule]\nAnswer any questions that the HO may have\n“Thank you, sir/ma’am, looking forward to seeing you on the day of inspection, you have my contact\ninformation on my card if you need anything else.\n\nFull Approval Estimate Phone Call\nThis is the call you will make to your HO as soon as you receive the estimate\n“Hello sir/ma’am! It’s [YOUR NAME] with Roof ER. Congratulations, I am glad we were able to\nensure that your insurance company fully approved your roof/siding/gutters/etc replacement!\n“So the next steps are, as I mentioned last time we met:\n“One of our Project Coordinators will be reaching out to you to schedule a Project Meeting to go\nover your full scope of work.\n“Based on the estimate, your insurance company will be sending you [ACV AMOUNT] shortly. This\nwill be used as your down payment. With that, we can start all of your work! When they send you\nthat check, just hold on to it until your meeting with our Project Coordinator who will help with all the\nnext steps.\n“Our estimating team will also be sending in supplements to the insurance company based on items\nthey may have missed. This includes Code Items such as IWS and Drip Edge. And don’t worry!\nEven if for some reason they do not approve these amounts, we will still do all the necessary work\nand never charge you for it. As we talked about earlier, your only cost out of this will be your\ndeductible once we finish all the work.\n“Upon completion of the installation, we will review and inspect all of our work to ensure it is to your\nsatisfaction. Then we will send in a completion form once you sign off on the complete project.\nThat’s when the insurance company will release the remaining funds minus your deductible. So\nyour final payment will only be those funds plus your deductible.\n“Any questions so far, sir/ma’am?”\nAnswer any questions\n“Great! Again, I am glad that we were able to make this happen for you, now you get to experience\nthe quality that Roof ER always delivers, at only the cost of your deductible after your whole project\nis complete!” Potentially mention additional work that they may want to add.\nAnswer any additional questions or engage in any conversation the HO starts.\n“Also, if you know anyone else that I can help, have them reach out to me! You have my card - they\ncan call, text, or email me and I can inspect their property to see if they have the same qualifying\ndamage and I can walk them through the same process I have walked you through!\nEngage in any conversation that this starts\n“Awesome!\nIf you haven’t already put up a yard sign: “Would you mind if I put up a yard sign next time I’m in\nyour area? This will definitely help other companies already know that you’re working with someone\nand hopefully eliminate anyone else from knocking your door asking about your roof/siding.”\n“Look out for the communication from one of our Project Coordinators so you can get that Project\nMeeting scheduled to go over all the next steps and your full scope of work. Congratulations again\nand have a great day!”\n\nInitial Pitch\n5 Non-negotiables with every pitch\nWho you are\nWho we are and what we do (Roof ER)\nMake it relatable\nWhat you’re there to do (an inspection)\nGo for the close (them agreeing to the inspection)\nKnock on door/ring doorbell\nAs they are opening the door, smile and wave.\n“Hi, how are you? My Name is ________ with Roof- ER we’re a local roofing company that\nspecializes in helping homeowners get their roof (and siding) replaced, paid for by their insurance!”\nGeneric:\n“We’ve had a lot of storms here in Northern Virginia/Philadelphia/Maryland over the past few\nmonths that have done a lot of damage!\n“We’re already working with your neighbors. We’ve been able to help them get fully approved\nthrough their insurance company to have their roof and/or siding replaced.”\n(Go to line marked with ^)\n-OR-\nSpecific\n“Were you home for the storm we had in ___. Wait for answer\nIf yes “It was pretty crazy right?! Wait for answer\nIf no: “Oh no worries at all, we get that all the time.\nIf yes move on to next line marked with *\nIf no “That’s good! It was a pretty bad one!”\n*“We’re working with a lot of your neighbors in the area. We’ve been able to help them get fully\napproved through their insurance company to have their roof (and siding) replaced.”\n^“While I’m here, in the neighborhood, I am conducting a completely free inspection to see if you\nhave similar, qualifiable damage. If you do, I’ll take a bunch of photos and walk you through the rest\nof the process. If you don’t, I wouldn’t want to waste your time, I wouldn’t want to waste mine! I will\nat least leave giving you peace of mind that you’re in good shape.”\nOnce they agree to let you do the inspection:, “Alright! It will take me about 10 - 15 minutes. I’m\ngonna take a look around the perimeter of your home, then grab the ladder, and take a look at your\nroof.\n\nGo in for a handshake. What was your name again? [Their name] great to meet you, again I am\n(your name). Oh and by the way do you know who your insurance company is”? Wait for their\nanswer, “Great! We work with those guys all the time.”\n“Here’s my card/flier, look us up while I’m conducting the inspection! I will give you a knock when I\nfinish up and show you what I’ve found.”\nWithout any hesitation, move into inspection. (See Inspection and Post-Inspection Script for\ndetailed next steps.)\n\nInspection and Post-Inspection\nInspection - Ideal photo progression \n§Mailbox/House Number\n§Overview of House\n§Front Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Right Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Rear Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Left Elevation Collateral\n§Damage to screens, gutters, downspouts, siding\n§Roof Overview Collateral\n§Damage to roof metals and other collateral on the roof\n§Circle Hail Hits & Slash Wind Damage (close up of each)\n§Overview of majority of the damage chalked up\n§Pictures of granules in the gutters or at the bottom of downspouts\n§Entire inspection shouldn’t take any longer than 15-20 minutes. How thorough of an inspection\nyou should do is a judgment call. Getting enough photos to sell the homeowner is most important. It\ndoesn’t matter how quickly you are able to complete the inspection if you don’t have enough\ndamage-photos for the homeowner to be on board with filing the claim.\n§Flashlight\n \\\nPost-Inspection Pitch\nKnock on the door \n“Hey _______, so I have a bunch of photos to show you. First I walked around the perimeter of the\nhouse  to look for collateral damage. I’ll also show you the collateral damage we found on the\nroof.”  Say this while going through through house number and overview photos\nStart showing the pictures of damage to screens, gutters, downspouts, and soft metals\n“While this damage functionally isn’t a big deal, it really helps build a story. Think of us like lawyers\nand this collateral damage is the evidence that builds the case which helps us get the roof (and\nsiding) approved.”\n\nContinue to slide through collateral damage photos\n“Here are the photos of the damage to your shingles. Anything I have circled means its hail damage\n(IF there were any wind damaged shingles or missing shingles say:) and  anything I have slashed\nmeans its wind damage. \nRemain on a photo of hail damage as you explain the following\n“This is exactly what we look for when we're looking for hail damage. If you notice, the divot is\ncircular  in nature.   Even if this damage doesn’t look like a big deal, what happens over time, these\nhail divots fill with water, freeze...., when water freezes it expands and breaks apart the shingle\nwhich will eventually lead to leaks.  That is why your insurance company is responsible and your\npolicy covers this type of damage.” \nStart slowly swiping through all the pictures of hail. \n“As you can see there is quite a bit of damage.  \nStart slowly swiping through all the pictures of hail.  \nIf there was wind damage or missing shingles, say the following:\n“Now here are the wind damaged shingles. You have both shingles that are creased from the wind\nlifting them up and shingles that have completely been blown off.”\nShow the pictures of wind damaged and/or missing shingles (if applicable)\nNow show them pictures of the granules in gutters and downspouts\n“As you can see here, granules have filled up your gutters. These granules are supposed to be\nwhat’s protecting your home. When wind and hail hits your roof, it knocks out these granules which\nreduces the lifespan of your roof.”\n“This is very similar to damage to ________’s home and/or the rest of the approvals we’ve gotten in\nthe area”.  \n“With that being said, insurance companies are always looking for ways to mitigate their losses. It’s\nunfortunate but that’s how they make money. The most important part of this process is that when\nyour insurance company comes out to run their inspection, we are here as storm experts to make\nsure you as a homeowner get a fair shake. If they are missing anything we make sure they see all\nthe damage that I  just showed you.” \n“What I’m going to do now is run to my car, grab my iPad and we can get this process started”! Go\nget iPad \nAs you approach back to the house/homeowner ask “Is there a place we could sit down for 5-10\nMinutes”?\nOnce you are in the house, spend some time building rapport as you get settled. \n“Okay, so first I am going to grab some of your basic information for our system. Then we can let\nyour insurance company know about the damagel”. \nGather information from the homeowner:\nFull name\n\nAddress\nPhone Number  \nE-mail\nInsurance Company\n“Do you happen to know your deductible? If not, no big deal at all”! \nAfter you have collected all the information:\nAsk if they have the app or if they have the login to the website.\nIf not, use the Homeowner Information Sheet to prep the HO. As you are writing or typing the\ninformation for the HO to use on the call, explain each part to them.\nAs much as possible, use HO’s phone to make the call\nReference Claim Filing Information Sheet\nMove on to Contingency & Claim Authorization\n\nPartial Estimate/Denial Phone Call\nThis is the call you will make to your HO as soon as you receive the estimate\n“Hello sir/ma’am! It’s [YOUR NAME] with Roof ER. How’s it going?”\n“Great, well we just received the decision from the insurance company. We’re going to have to take\nsome steps to get this turned around. I have already submitted my photo report that demonstrates\nthe damage to your property and the need to replace your whole roof, so hopefully they review and\napprove that. Could you please reach out to the adjuster to see if they were able to review my\nreport?”\nAfter HO answers. “Thank you! During that call, please let them know that you disagree with their\ncurrent decision and would like to have your property reinspected if they are not able to update their\ncurrent decision to a full approval based on the photo report that I sent them.”\nIf there are some approved shingles:\n“So we will also be conducting an iTel and Repair Attempt.\n“An iTel is where we will take a shingle off your roof and send it in to get tested to verify that it is\ndiscontinued. Since it is discontinued, the only effective way to restore your property would be with\na full roof replacement.\n“At that time, I will also take a video of us removing and replacing that shingle. This Repair Attempt\nvideo will demonstrate to the insurance company that your roof is not repairable and therefore\nwould need to be fully replaced.\n“To get those scheduled, I will need you to sign these 2 documents allowing us to do that. When\nyou see the documents, it will have a cost attached, but don’t worry! Read the bold print and you will\nsee that you, as the homeowner, are never responsible for this cost.”\nSchedule a time to meet with the HO to sign or let them know you will be sending it out for eSign.\nTask the proper people for eSign, if necessary.\n“We will definitely be putting in the work to give you the highest chance of getting this turned\naround. I definitely believe your roof has the damage that warrants a full replacement. But, of\ncourse, insurance companies are billion dollar, publicly traded companies that will try to save as\nmuch money as they can on every claim. That is why it is great that you are working with us since\nwe know the proper steps to ensure that you are adequately taken care of by your insurance\ncompany!”\nAnswer any questions or concerns the HO has.\n“Alright, so let me know how the phone call goes with your adjuster and I’ll start working on my end\nto put everything together to get this turned around. Thank you, sir/ma’am, goodbye!”\n\nPost Adjuster Meeting Script\nThis is the conversation you will have with the HO after an adjuster meeting\nIf moving to Estimate Pending:\n“Great! The Adjuster/Ladder Assist identified all the same damage as me. You will be receiving an\nemail from us shortly saying that you’ve been fully approved. Within a few days you should receive\nthe itemized estimate from the Insurance Company. Once you receive that, you can forward that to\nme. This is going to include every line item that the insurance company believes is needed to make\nyou whole again. To you this is going to look like gibberish. But, don’t worry, that’s what we’re here\nfor. If for some weird reason the desk adjuster does not write it for a full approval after this\ninspection, I will take the steps necessary to get it turned around! Any questions on that,\nsir/ma’am?”\nAnswer any questions\n“When the insurance company generates their estimate, it will also typically trigger the release of\nthe first payment. The insurance company refers to this payment as the ACV. Which stands for\nActual Cash Value. That amount will be used as your down payment. The remaining funds are held\nby the insurance company until we complete the work. They refer to these remaining funds as\nDepreciation. Which is not “depreciation” as most would think about it, it’s just their way of holding\non to some of the funds to make sure the work gets done.\n“At the same time our office will be reviewing your entire project along with my photos and the\ninsurance estimate. As I’ve mentioned, insurance companies are always trying to save money. We\nusually find specific line items that are missing. Most commonly, code items like IWS and Drip\nEdge. We will supplement for all the items needed to complete your project to code and our\nmanufacturer’s specifications. Don’t worry, like we have agreed to from the beginning, we\nguarantee you that you would not have to cover any of these costs even if the insurance company\nwere to deny our supplement. [Which does not happen.]\n“Once our office has completed your job review, which takes 2 - 3 business days, your job will be\nassigned to one of our Project Coordinators. They will reach out to schedule a project meeting\nwhere they will walk you through all of the finer details. This is the fun part where you will get to pick\nour products and colors. *Of course if you have anything else you would like us to do beyond the\ninsurance approval, your Project Coordinator could price that out for you.*\n“Your install date will typically be 4 - 6 weeks after your Project Meeting. After you submit that initial\npayment from the insurance company, we’ll reach out to get your project scheduled!\n“I know that was a lot of information. The most important thing from here is forwarding the estimate\nas soon as you get it. Of course if you have any questions in the meantime, please feel free to\nreach out.\nAnswer any questions that they may have.\n“A great way for me to help assist some of your neighbors, would be if I could put up a yard sign!\nWould you mind if I put one up? Thank you, sir/ma’am!”\nSubmit your Photo Report and Claim Authorization to the adjuster with an effective email. Use\nPost-AM-Email-Template if you need to.\nIf moving to Decision Pending:\n“So, we just finished our inspection. The Adjuster/Ladder Assist will be sending their report to a\ndesk adjuster and will be making a final decision. Once they make a decision, they will write up an\n\nitemized estimate and should send that over to you. Once you receive that, please forward that over\nto me. They can be a bit hard to read, so I’ll be able to walk through all of that with you.\n“If it comes back as anything other than a full approval, I’ll take the necessary steps to make sure it\ngets turned around! There are a lot of steps we can take from here, which we can go over once we\nreceive the estimate.\n“I will go over all this information again once we receive the estimate and have a more clear picture\nof what the next steps will be.”\nAnswer any questions they may have\n“Great! So, if you have any questions between now and when you get your estimate, please reach\nout! And, again, once you receive that from the insurance company, forward that over to me so I\ncan review that with you. Thank you sir/ma’am! Have a great day!”\nSubmit your Photo Report and Claim Authorization to the adjuster with an effective email. Use\nPost-AM-Email-Template if you need to.\n\nSales Operations and Tasks\nQuick Tip: Press CTRL + F and type in what you are looking for in the search bar. (for example:\ntype “Appraisal”)\nSending Documents for e-sign iTel / Repair Attempt\nTask Brandon Pernot (operations assistant) during Business Hours\nReach out to and/or Task Danny or Brandon Pernot after Business Hours\nIf sending Itel or Repair Attempt, must have:\nCurrent partial estimate\nPhotos\n(see the section titled: Creating iTel, Repair Attempt, and Tarp Agreements below)\nOnce Customer signs iTel / RA Agreement - Tag Brandon Pernot and he will create Task to get a\nField Technician scheduled\nCustomer needs Tarp\nCreate Tarp Agreement and have customer sign (see the section titled: Creating iTel, Repair\nAttempt, and Tarp Agreements below)\nCollect payment from customer\nIf check/cash - bring it to the office\nIf credit card - Task Ford to send qb link to customer for tarp payment\nTag Reese once customer has signed and you received payment\nWe will create task to get FT scheduled for tarp\nNeed a Repair Estimate\nTask Danny\nRequesting a job to be reviewed or to go to Appraisal or Public Adjuster\nMessage (Not Task) Reese on the job you would like reviewed\nRequesting a job be reviewed to go to TAG Reese on the job you would like reviewed\nIf you believe a job is dead\nTag Reese on the message board for the job\nIf you need a customer job file to be created in the Field Portal\nYou must have the following:\nFull name\n\nEmail\nAddress\nPhone Number\nTH/SFH\nTask Brandon Pernot\nIf you have production/operations related questions\nTask and Tag Ford\nIf you need a job reviewed for Retail/Insurance Conversion\nTAG Reese on the message board and he will create the proper task for Ford\nIf you have general questions about estimates, denials, partials, reinspect, or any job stage before\ninstall\nTag Reese, Danny, and/or Brandon Pernot\nIf you need immediate assistance to answer a customer’s questions about product, warranty,\npricing, etc and you are unsure how to answer\nIn a group text, text Ford, Reese, and Oliver the question, one of them should be able to get to you\nquickly\nIf 1 minute passes and you do not have an answer Call Ford, Reese, Oliver, PC’s, or Trainers\nFull Approvals must have\nPhotos\nHover\nIf you submit estimate to Amber and do not have photos and hover yet, she will not move forward\nwith Project Review\nOnce you upload photos/hover, Tag Amber to let her know\nPinning Homes\nYou should pin every home that you knock\nUnder the Leads page of the Field Portal App on your phone, you will press the arrow at the top\nright of the screen to pull up the map\nHere, you will long press on a home and then fill out the information you have\nStatus is the only required field (it is a drop down menu)\nSee screenshots below\nSigning up a new customer\n\nEnter all required fields on Sales App using the iPad\nAfter HO files claim, enter Claim Number\nPress Proceed to Agreement ONCE ONLY (if nothing happens, wait at least a minute before\nattempting to press it again - simply because nothing happens immediately, it does not mean that\nyou did not press the button, the system is just moving slow)\nYou sign Contingency Agreement\nFor roof and aluminum siding sign up, write “Full replacement value claim = Full approval for roof\nand/or siding”\nHO signs Contingency Agreement and Claim Authorization\nPress Submit\nEnter password roofer if applicable\nSigning up a lead\nWhen a lead is already in your portal under Inspection Pending\nDO NOT type in all the HO’s information again\nPress the red letters at the top of the screen that says LEADS\nThen you select your customer’s name\nAfter HO files claim, enter Claim Number\nPress Proceed to Agreement ONCE ONLY (if nothing happens, wait at least a minute before\nattempting to press it again - a lot of people think they must not have pressed it, which is why it did\nnot go through, but usually it is not the case, the system is just moving slow)\nYou sign Contingency Agreement\nFor roof and aluminum siding sign up, write “Full replacement value claim = Full approval for roof\nand/or siding”\nHO signs Contingency Agreement and Claim Authorization\nPress Submit\nEnter password roofer if applicable\nSee screenshot below\nCreating iTel, Repair Attempt, or Tarp Agreements\nClick the words Switch Agreement at the bottom right of the screen\nSelect needed agreement (Itel, Repair Attempt, or Tarp)\nDO NOT enter in the customer’s information again\nPress Existing Customers at the top right of the screen\n\nFill out additional information at the bottom of the page\nPlease reach out to Reese, Danny, or your trainer if you need additional assistance with this bottom\nsection\nPress Proceed to Agreement\nYou sign Agreement\nCustomer signs Agreement\nFor iTel and Repair Attempt make sure to let HO know that they are never responsible for the cost\nthat appears on the agreement (read the bold section of the agreement)\nFor Tarp make sure to let HO know to submit payment first, but they will be reimbursed by the\ninsurance company\nSee section above titled: “Customer needs Tarp”\nUploading Missing Documents\nIf you notice that the job file for your customer is missing Contingency or Claim Authorization do the\nfollowing:\nOpen the Sales App\nClick the documents button (folder) at the bottom left of the screen\nScroll until you see your customer\nPress the upload button next to each of the forms that you need uploaded (button looks like a cloud\nwith an up arrow inside of it)\nFilming Repair Attempt Video\nBefore you begin filming, ask the Field Tech (Francisco or Ishmael) to point out which of the\nsurrounding shingles will be affected by the extraction. Mark the damaged tab (if applicable) and\nmark the bottom right corner with chalk of every shingle the Field Tech points out.\nBefore you begin filming; take a before shot of the area where you will be extracting the shingle.\nStart recording, “...Here we are at [HOMEOWNER’S HOUSE] performing a repair attempt on this\nstorm damaged shingle. As you can see I have pre-marked every tab that will sustain unavoidable\ncreasing due to the brittleness of the roof. Go ahead and get started Francisco/Ishmael”\nFilm the entire area where repair is going to occur, then go from the Wide camera shot to a low\ndown side view camera angle, to show how the shingles get bent back/pried up during the process.\nMake sure to show on camera or explicitly mention the high amount of granule loss running down\nthe roof.\nOnce the new shingle has been installed, hover the camera over the shingles and wipe your hand\nback and forth gently over the top of each tab that was pried up. Trace your finger along the crease\nand show it on camera, explain how each tab has now been mechanically creased and confirms the\nroof failed a “brittle test”.\nOnce you have finished recording your video. Take close-up after pictures of the browns above the\nreplaced shingle. Draw an arrow to where the crease is on the shingle or point to it for the picture.\n\nChecklist for Post-Adjuster Meeting\nPhoto Report Complete\nUpload photo report from photos tab when you have good reception\nHover Complete\nMove Job File\nMost jobs should go to Estimate Pending (make sure to look at next item on this check list - very\nimportant when moving a job to Estimate Pending)\nJobs that you think are partial or denial will be moved to Decision Pending\nNote: This is the ONLY time you move a job\nPost-Adjuster Meeting Script\nRead it to your customer if you have to - much better than missing something\nMain emphasis should be for them to send you the estimate once they receive it\nPost-Adjuster Meeting Email\nPlease send Claim Authorization (and photo report when needed) to the adjuster after the AM. Start\nwith the Post AM Email Template\nPlease make sure all of these things are complete before the end of the day of an Adjuster Meeting\nPartials/Reinspects/Moving jobs\nSee above for when you should move a job to Decision Pending or Estimate Pending\nA job will be automatically moved for you after you submit the full approval, partial estimate, or\ndenial letter (Do not move the job yourself to another stage here!)\nFor your jobs that are partial or denials - they will automatically be moved to one of two stages:\nPartial - Approval\nReinspection - Request Pending\nOnce your job is moved and you have a clear plan, make sure to execute\niTel\nRA\nReinspect\nCustomer Complaint Form\nEtc\nOnce you complete one of the above tasks:\n\nIf your job was in Partial - Approval, move job to Partial Pending - which will let the customer know\nthat you have sent in your arguments and are awaiting additional communication or potentially an\nupdated estimate to full approval\nIf your job was in Reinspection-Request Pending and the adjuster has confirmed they will be\nscheduling a reinspect, move job to Reinspection Pending\nOnce the reinspection has happened, ensure the same tasks that are listed under the Checklist for\nPost-Adjuster Meeting are completed\nIn most cases, the only item not completed there yet would be moving the job back to Decision or\nEstimate Pending\n\nMGM Insurance\nAssurant\nFarmers of Salem\nAmerican Bankers Insurance Co. of Florida\nUniversal Property\nEvolution Risk Advisors\nUtica\n\nOur Culture & Your Commitment\nOur Mission:\nAt Roof-ER, our mission is to hold a fiduciary responsibility to our customers - plain and simple. In\nan industry known for poor workmanship, lack of communication, and at times, outright deceit; we\nseek to restore the name of exterior remodeling contractors nationwide. By committing to our core\nvalues of Integrity, Quality, and Simplicity, we promise to deliver an experience every homeowner\nwants when remodeling their home: a simple and straightforward quality installation for a fair and\nhonest price.\nOur Core Values:\nIntegrity: At Roof-ER, we set the standard for Integrity in an industry that has lost credibility among\nmany consumers. We do not only set the standard of integrity with our clients, but it starts with\nbeing honest to ourselves. We have the courage to truly see ourselves, recognize where we can\ngrow, and implement changes to meet the demands of reality.\nQuality: We guarantee the highest Quality in our products and services. Our confidence in our craft\npropels us into the elite 1% of all roofing companies in the entire nation. Quality starts with the\nmoment a client interacts with one of our representatives at the door. The Quality demonstrated in\nevery aspect of what we do continues to make Roof-ER the gold standard of this industry.\nSimplicity: We strive to deliver an overwhelmingly positive experience for everyone who interacts\nwith Roof-ER. By embracing the complexities of our industry, we provide exceptional results to our\nclients. Our clients value the Simplicity of partnering with us – we guarantee a seamless process\nfrom start to finish ensuring satisfaction with the final outcome.\nYour Commitment:\nI will conduct myself in alignment with the Mission and Core Values.\nI will dedicate myself to Roof-ER’s successful sales process.\nI will always show an exceptional level of integrity when interacting with clients, co-workers, and\n(especially) myself.\nI will listen to and grow from receiving constructive feedback.\nI will not be afraid to communicate with the correct individual(s) when I have an issue or grievance.\nI will not be involved in gossip or “company drama.”\nI will be an effective and contributing member of the Roof-ER team.\nI will show an intense level of discipline in the work that I conduct.\nI will not let negativity or “bad days” have a detrimental impact on my work ethic and the quality of\nwhat I do.\nI will have pride in my work.\nI will do what it takes to commit to this. I will achieve tremendous levels of success. I have seen the\nsuccess that others achieved by committing to this process - I WILL be part of that.\n\nTOWNSHIP AND DENIED PERMIT FOR APPROVALS\n\n2021 Virginia ICC Building Codes\n\nNotes: Per Virginia Residential Building Code R905.2.2 - Slope: \"Asphalt shingles shall be used\nonly on roof slopes of two units vertical in 12 units horizontal (17-percent slope) or greater.\"\nThe Rear slope approved for replacement has Steepness Pitch of 1/12; Therefore Flat/Rubber/TPO\nroofing must be installed to be compliant with State Building Code\nYou can just copy and paste what is above (and edit the pitch of course) and send that to your\nadjuster, or have your customer send that to the adjuster\n\nThe 2018 IRC\nChapter 7 Wall Covering\nR703.1 General. Exterior walls shall provide the building with a weather-resistant exterior wall\nenvelope. The exterior wall envelope shall include flashing as described in Section R703.4.\nR703.1.1 Water resistance. The exterior wall envelope shall be designed and constructed in a\nmanner that prevents the accumulation of water within the wall assembly by providing a\nwater-resistant barrier behind the exterior veneer as required by Section R703.2 and a means of\ndraining to the exterior water that enters the assembly.\nImportance of Moisture Management\nR703.2 Water-resistive barrier. One layer of No. 15 asphalt felt, free from holes and breaks,\ncomplying with ASTM D226 for Type I felt or other approved water-resistive barrier shall be applied\nover studs or sheathing of all exterior walls. Such felt or material shall be applied horizontally, with\nthe upper layer lapped over the lower layer not less than 2 inches (51mm). Where joints occur, felt\nshall be lapped not less than 6 inches (152mm). The felt or other approved material shall be\ncontinuous to the top of walls and terminated at penetrations and building appendages in a manner\nto meet the requirements of the exterior wall envelope as described in Section R703.1.\nR703.4 Flashing. Approved corrosion-resistant flashing shall be applied shingle-fashion in a\nmanner to prevent the entry of water into the wall cavity or penetration of water to the building\nstructural framing components. Self-adhered membranes used as flashing shall comply with AAMA\n(Ameri-can Architectural Manufacturers Association) 711. Fluid-applied membranes used as\nflashing in exterior walls shall comply with AAMA 714. The flashing shall extend to the surface of\nthe exterior wall finish. Approved corrosion-resistant flashings shall be installed at:\nExterior window and door openings. Flashing at exterior window and door openings shall extend to\nthe surface of the exterior wall finish or to the water-resistive barrier complying with Section R703.2\nfor subsequent drainage. Mechanically attached flexible flashings shall comply with AAMA 712.\nR703.7.3 Water-resistive barriers. Water-resistive barriers shall be installed as required in Section\nR703.2 and, where applied over wood-based sheathing, shall include a water-resistive\nvapor-permeable barrier with a performance at least equivalent to two layers of Grade D paper. The\nindividual layers shall be installed independently such that each layer provides a separate\ncontinuous plane and any flashing (installed in accordance with Section R703.4) intended to drain\nto the water-resistive barrier is directed between the layers.\nExceptions:\nWhere the water-resistive barrier that is applied over wood-based sheathing has a water resistance\nequal to or greater than that of 60-minute Grade D paper and is separated from the stucco by an\nintervening, substantially non-water-absorbing layer or designed drainage space.\n\nArbitration Information\nBinding Arbitration\nLegally enforceable like a court decision.\nBoth parties agree in advance to accept the arbitrator’s decision as final.\nNo appeal is typically allowed (except in rare cases like fraud or misconduct).\nOnce the arbitrator rules, the losing party must comply — often enforced in court if needed.\nExample: An insurance company and a homeowner agree to resolve a roof damage dispute via\nbinding arbitration. The arbitrator awards $12,000 to the homeowner. The carrier must pay that\namount, with no second opinion or further negotiation.\nNon-Binding Arbitration\nThe arbitrator’s decision is essentially a recommendation.\nEither party can reject the outcome and proceed to litigation or appraisal.\nOften used as a step before filing a lawsuit, especially when parties are still open to negotiating.\nExample: The arbitrator awards the homeowner $10,000. The insurance company disagrees and\ndecides to proceed with litigation. The homeowner is not bound to accept the award either.\nImportant for Insurance Claims:\nBinding arbitration clauses are rare in standard homeowners policies.\nMost policies prefer appraisal (for valuation disputes) or litigation.\nVirginia and Maryland allow arbitration, but carriers must clearly disclose and mutually agree to it —\nit can’t be forced unilaterally in most claim scenarios.\n\nComplaint Forms\nHave HO use these websites to submit a complaint\nAllstate:\nNationwide:\nUnder “What is your Email About” Select “General Inquiries”\nUnder “What is the Subject of your Email” Select “Feedback & Complaints”\nState Farm:\nSelect “Other” on drop down menu, and then click the link that says “this form”\nErie:\nTravelers:\nIf you/HO already sent email(s) to\nUse this link to file a complaint:\nSelect “Give complaint or Share a concern” on the first drop down menu\nThen select “Your Experience” on the second drop down menu\nUnder the “relationship” drop down menu, HO should select “customer”\n(You shouldn’t fill this form out often, but if you do there is an option to select “3rd party)”\nFarmers Insurance:\nGrange:\nSelect “Your Claim/Claim Status” on drop down menu\nHomsite:\nEmail\nLiberty Mutual:\nMercury:\nProgressive:\nClick “Send Email” and then select “Your Claim/Claims Process” on drop down menu\nThe Philadelphia Contributionship:\nUniversal Property Complaint Form:\nSelect “Feedback” on the drop down menu\nUniversal Property Document Sharing:\n\nUse this link when you need to send information/documents to the assigned adjuster at Universal\nProperty\nYou can even write emails in a google docs, download the file, and upload it to ClaimPath as a\n“correspondence letter”\nThe Hartford:\nMake sure HO includes the Claim Number when filling out the complaint\nVirginia Farm Bureau:\nCumberland Mutual\nFill out contact form and make request by using the link\nNorthern Neck\nScroll to the bottom of the page and fill out form there\nAlso has generic email claimreport@nnins.com\nAssurant\nUnfortunately there is no complaint form online. But they have a complaint phone number:\n1.800.358.0600. Open 8am - 8pm\nDonegal\nSelect “Claim Customer Service” under the drop down menu\n\nEngineers\nGood Engineering Companies/Engineers:\nPatrick Wellein - Integrity Engineering\n\nFlashing Codes\n104.9. 1 Used materials and equipment. The use of used materials which meet the requirements of\nthe Construction Code for new materials is permitted.\n908.5 Existing slate, clay or cement tile shall be permitted for reinstallation, except that damaged,\ncracked or broken slate or tile shall not be reinstalled. Any existing flashings, edgings, outlets, vents\nor similar devices that are a part of the assembly shall be replaced where rusted, damaged or\ndeteriorated. Aggregate surfacing materials shall not be reinstalled.\n\nUse this template to Send to the Adjuster/Insurance when sending in your Repair Attempt Videos\nPLEASE REVIEW AND MAKE EDITS TO MAKE SURE THIS EMAIL FITS YOUR SPECIFIC\nSITUATION BEFORE YOU SEND IT\nPLEASE ATTACH CLAIM AUTHORIZATION AND MAKE SURE TO INCLUDE CLAIM # IN\nSUBJECT LINE\nEDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern,\nPlease see the attached video link and photo report of the attempted repair for the claim number\n[#_____]. As can be clearly seen in the video and pictures, the homeowner's roof sustained\nadditional damage during the attempted repairs. This confirms a failed brittle test for the shingles,\nindicating irreparability.\nWith this fact established, your estimate as it currently stands would not actually fix the damages,\nbut would in fact further compromise the integrity of the roof as a whole. Therefore I have gone\nahead and attached an estimate below that accurately reflects the full scope of work necessary to\nmake our mutual client whole again.\nYouTube Link:\n↓[USE THIS PARAGRAPH ONLY IF YOU HAVE BEFORE AND AFTER PICTURES]↓\nI also ask that you take note of the before and after pictures of the attempted repair. Due to the\nbrittleness of the roof in general, during the repair the two rows of shingles above the one we were\nattempting to replace sustained unavoidable mechanical creasing. These photos clearly\ndemonstrate the brittleness of this roof, and moving forward with further patch repairs will inevitably\ndo further damage to surrounding shingles.\n1. These can be seen in the updated photo report under the \"Brittle Test\" section, and best shown\nin Photos:(___)\nOR\n2. Please find these photos attached below.\nI kindly ask that you review these findings and revise your estimate/scope of work accordingly, so\nwe can begin to move forward with the necessary full [Roof AND/OR Siding] replacement to restore\nour mutual client's property to pre-storm condition.\nIf we can provide any additional information, please don't hesitate to reach out.\nThank you for your time and for working with us to assist [HOMEOWNER’S NAME] in restoring their\nproperty effectively after the loss they have experienced.\n[YOUR SIGNATURE]\n\nUse this template to Send to the Adjuster/Insurance when requesting a copy of an estimate\nPLEASE REVIEW AND MAKE EDITS TO MAKE SURE THIS EMAIL FITS YOUR SPECIFIC\nSITUATION BEFORE YOU SEND IT\nPLEASE ATTACH CLAIM AUTHORIZATION AND MAKE SURE TO INCLUDE CLAIM # IN\nSUBJECT LINE\nEDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nHello!\nThis is [REP NAME] with Roof-ER. We are assisting [CUSTOMER’S NAME] with the claim\nreferenced above. Attached you will find a signed Claim Authorization and our Photo Report [IF\nYOU’VE ATTACHED IT, IF NOT PLEASE DELETE THAT LINE]\nI am reaching out in regards to an estimate for the scope of repairs that should have been created\nafter an inspection of [CUSTOMER NAME]’S property that happened on [DATE OF INSPECTION\nIF APPLICABLE].\nIf you are still working on the estimate, no problem at all! However, once you have a finalized\nestimate, please send a copy to both [CUSTOMER’S NAME] and to me as soon as possible.\nWe at Roof-ER want to quickly and effectively restore our mutual client’s property back to pre-storm\ncondition as soon as possible. Please let me know if you need anything else from me.\nThank you for working with us to assist [CUSTOMER’S NAME] with this project.\n[YOUR SIGNATURE]\n\nGAF Guidelines Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance company with customer CC’d\nMake sure to attach the document called GAF Storm Damage Recommendation\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern:\nThis is [REP NAME] with Roof ER. I am assisting [CUSTOMER’s NAME]. Attached is our Photo\nReport, Claim Authorization, and GAF Storm Damage Guidelines.\nGAF's guideline to not repair any more than 2 or 3 shingles. A repair at the level that is in your\ncurrent decision would cause significantly more damage to [CUSTOMER NAMES]’s roof, and\nwould not be an effective solution to restore his property after the hail storm that impacted his\nhouse.\nPlease update your current estimate to take this into consideration.\nWe sincerely appreciate your time and assistance.\nYour Signature with your contact information\n\nPartial Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance company with customer CC’d\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern:\nThis is [REP NAME] with Roof ER. I am assisting [CUSTOMER’s NAME]. We have attached our\n[repair estimate and/or accompanying documentation] for your review.\n[insert rep argument here]\nPlease let us know if you have any questions/concerns regarding our estimate and provide us with\na revised estimate accounting for the additional damages found during our inspection at your\nearliest convenience. If you would like to perform an additional inspection of the property, please let\nus know when you would like to do so by contacting me at the information below. We appreciate\nyour time and assistance in reviewing this information and look forward to reaching a timely\nresolution on the scope of repairs.\nYour Signature with your contact information\n\niTel Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nThis is [REP NAME] with Roof ER. I am the contractor assisting [CUSTOMER’S NAME]. Attached\nyou will find an iTel report [AND any additional documents if you attach them.]\n[Use the following APPLICABLE arguments]\nPer the attached iTel report, there are no similar matches available which makes a patch repair\nimpossible\nPer the attached iTel report, the existing shingle is discontinued. We have attempted to contact the\nsuppliers listed on the report to secure the suggested samples, however each supplier noted [they\ndo not carry the suggested product/the suggested product would need to be special-ordered by the\npallet, meaning the costs to do so would be more exorbitant than simply replacing the roof]. As a\nresult, the approved scope of work cannot be completed as currently written.\n(Homeowner's) shingles are the English-dimension architectural shingles which are no longer in\nproduction. The new metric-dimension shingles have a larger exposure size and for that reason,\ncannot be mixed with the existing shingles via a repair. If we try to repair with the new shingles, the\nsealant on the shingle above would not secure to the correct portion of the new underlying shingle.\nThe sealant would be secured to the granules on the underlying shingle - any reputable contractor\nknows a proper repair cannot be completed in this fashion.\nPlease review these findings and revise your estimate accordingly so we can begin to move forward\nwith the full replacement for [HOMEOWNER’S NAME]. If we can provide additional information,\nplease let us know. Thank you for your time and for working with us to assist [HOMEOWNER’S\nNAME] in restoring their property effectively after the loss they have experienced.\nYour signature with your contact information\n\nPhoto Report Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nYou will find our photo report attached to this email citing additional damage not accounted for in\nyour initial decision. [IF A PARTIAL THAT HAS ROOF DAMAGE, USE THE FOLLOWING\nSENTENCE] This damage is consistent with what has already been approved which leaves us and\nthe homeowner unsure why these findings were left off of the estimate. [IF A FULL DENIAL, USE\nTHE FOLLOWING SENTENCE INSTEAD] The extent of the wind AND/OR hail damage can be\nseen in the photo report.\n[Other things you can mention before closing out the email]\nNoting damage to the soft metals, gutter, downspouts, etc.\nWould be more expensive to replace in patch form\nClear areas that may be causing interior leaks\nPlease review these findings and revise your estimate/scope of work accordingly so we can begin\nto move forward with the full replacement for [HOMEOWNER’S NAME]. If we can provide additional\ninformation, please let us know. Thank you for your time and for working with us to assist\n[HOMEOWNER’S NAME] in restoring their property effectively after the loss they have\nexperienced.\nYour signature with your contact information\n\nPost Adjuster Meeting Email Template\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nThis is [REP NAME] with Roof ER, the contractor assisting [CUSTOMER’S NAME.]\nAttached you will find our Photo Report and Claim Authorization. Please use this to assist in\nfinalizing your decision. Please take note of the significant storm damage throughout our client’s\nproperty that is evident in the Photo Report.\n[Use this area to highlight specific photo numbers if applicable]\nOnce you finalize your estimate, please send that to [CUSTOMER’S NAME] and me. We want to\nquickly and effectively restore their property after the loss they have experienced from the storm.\nPlease let me know if you may need anything else from me.\nThank you for working with us to assist [CUSTOMER’S NAME] with this project.\n[Your signature with contact information]\n\nRepair Attempt Argument to Send to Adjuster/Insurance\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern\nPlease see [THE ATTACHED PHOTO AND/OR VIDEO – OR THE VIDEO LINKED BELOW] of the\nattempted repair for the claim number referenced in the subject line. As can be clearly seen in the\nphotos AND/OR video, the homeowner's roof sustained additional damage during the attempted\nrepairs. This confirms a failed brittle test indicating irreparability.\nPlease review these findings and revise your estimate/scope of work accordingly so we can begin\nto move forward with the full replacement for (homeowner). If we can provide additional information,\nplease let us know. Thank you for your time and for working with us to assist [HOMEOWNER’S\nNAME] in restoring their property effectively after the loss they have experienced.\n[Here is the link to the Repair Attempt Video: youtube.com/ ]\nYour signature with your contact information\n\nSiding Argument to send to Insurance/Adjuster\nSend to Adjuster/Insurance and CC the customer\nCC or BCC Reese if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo Whom it May Concern\nThis is [REP NAME] with Roof ER. I am the contractor assisting [CUSTOMER’S NAME]. Attached\nyou will find [MAKE SURE TO EDIT THIS SECTION FOR WHAT DOCUMENTS YOU ARE\nACTUALLY ATTACHING] my photo report [AND/OR], an iTel Report, [AND/OR] a repair estimate\nthat includes the siding.\n[INCLUDING THE FOLLOWING ARGUMENTS THAT ARE APPLICABLE TO YOUR EMAIL]\nDamage\nYou will find our photo report in the list of attachments citing additional damage not accounted for in\n(insurance)'s original estimate. This damage is consistent with what has already been approved\nwhich leaves us and the homeowner unsure why these findings were left off of the estimate.\n[Additional details as needed]\nDiscontinued\nThis estimate is for a full siding replacement due to the existing siding being discontinued. Per the\nattached iTel report, there are no similar matches available and so our estimate accounts for all\nelevations of siding.\nThe current siding is discontinued. The similar siding that is available would have to be special\nordered and paint matched. Because of those things, it would not be a cost-effective solution to\nrestore [HOMEOWNER’s] siding. The only way to effectively make them whole again would be with\nfull siding replacement.\nCode/Housewrap\nPer building code, we are required to install a house wrap on exterior wall sheathing to prevent\nmoisture from getting to the building envelope. Further, we are required to follow the manufacturer's\ninstallation instructions while applying the weather barrier. These instructions state we must overlap\nHousewrap 6\" over any outside corners. This would require us to remove the existing aluminum\noutside corner and detach the aluminum panels on the adjacent run that meet at that corner post.\nThis is not only impractical, but also impossible without causing further damage to metal siding\npanels, as they will inevitably sustain damage during the removal process. Due to this\nconsequential damage, we have submitted our estimate for a full siding replacement\nPlease review these findings and revise your estimate/scope of work accordingly so we can begin\nto move forward with the full replacement for [HOMEOWNER’S NAME]. If we can provide additional\ninformation, please let us know. Thank you for your time and for working with us to assist\n[HOMEOWNER’S NAME] in restoring their property effectively after the loss they have\nexperienced.\n\nYour signature with your contact information\n\nCustomer Perspective Template for Customer to Send to Adjuster/Insurance\nSend this to the customer and instruct them to COPY and PASTE your email and for them to send it\nthemselves (Make sure they do not just forward the email.)\nYou can also have the customer make edits as necessary\nAsk them to CC you as well\nPLEASE REVIEW AND MAKE EDITS TO MAKE SURE THIS EMAIL FITS YOUR SPECIFIC\nSITUATION BEFORE YOU SEND IT TO THE CUSTOMER\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nTo whom it may concern,\nI, a loyal customer of [INSURANCE COMPANY], find your current decision for my home\nunacceptable. I have chosen [INSURANCE COMPANY] to protect my home in the event that I find\nmyself in this situation. Your current decision will not effectively address the needs of my home after\nthe loss we have suffered from the storm.\nMy contractor, who is CC’d in this email, has provided documentation that outlines the most\neffective way to make my property whole again [AND/OR] while your current decision would be an\nineffective solution for my roof [AND/OR] siding.\nPlease update your decision/estimate to reflect a full roof [AND/OR] siding approval. If necessary,\nplease have someone else come back to inspect the property.\nPlease let my contractor or myself know if you need anything else from us.\nWe look forward to hearing from you soon,\n\nUse email template to Adjuster/Insurance and\nCC or BCC Reese and/or Danny if needed\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED,\nREMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\nPlease refer to Sales Operations and Tasks Document for more detailed explanation of how to\nsuccessfully conduct an RA.\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL\nINSTRUCTIONS BEFORE SENDING THIS TO YOUR THE INSURANCE. EVERYTHING IN THE\nBRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\nMAKE SURE TO ATTACH CLAIM AUTHORIZATION AND INCLUDE CLAIM # IN SUBJECT\nPLEASE ALSO INCLUDE BEFORE/AFTER PHOTOS!!!\nCreating iTel, Repair Attempt, or Tarp Agreements\nClick the words Switch Agreement at the bottom right of the screen\nSelect needed agreement (Itel, Repair Attempt, or Tarp)\nDO NOT enter in the customer’s information again\nPress Existing Customers at the top right of the screen\nFill out additional information at the bottom of the page\nPlease reach out to Reese, Danny, or your trainer if you need additional assistance with this bottom\nsection\nPress Proceed to Agreement\nYou sign Agreement\nCustomer signs Agreement\nFor iTel and Repair Attempt make sure to let HO know that they are never responsible for the cost\nthat appears on the agreement (read the bold section of the agreement)\nFor Tarp make sure to let HO know to submit payment first, but they will be reimbursed by the\ninsurance company\nSee section above titled: “Customer needs Tarp”\nUploading Missing Documents\nIf you notice that the job file for your customer is missing Contingency or Claim Authorization do the\nfollowing:\nOpen the Sales App\nClick the documents button (folder) at the bottom left of the screen\nScroll until you see your customer\n\nPress the upload button next to each of the forms that you need uploaded (button looks like a cloud\nwith an up arrow inside of it)\n\\\nFilming Repair Attempt Video\nBefore you begin filming, ask the Field Tech (Francisco or Ishmael) to point out which of the\nsurrounding shingles will be affected by the extraction. Mark the damaged tab (if applicable) and\nmark the bottom right corner with chalk of every shingle the Field Tech points out.\nBefore you begin filming; take a before shot of the area where you will be extracting the shingle.\nStart recording, state the Homeowners name and house number. “...Here we are at\n[HOMEOWNER’S HOUSE at 1234 (street name)] performing a repair attempt on this storm\ndamaged shingle. As you can see I have pre-marked every tab that will sustain unavoidable\ncreasing due to the brittleness of the roof. Go ahead and get started Francisco/Ishmael”\nFilm the entire area where repair is going to occur, then go from the Wide camera shot to a low\ndown side view camera angle, to show how the shingles get bent back/pried up during the process.\nMake sure to show on camera or explicitly mention the high amount of granule loss running down\nthe roof.\nOnce the new shingle has been installed, hover the camera over the shingles and wipe your hand\nback and forth gently or blow over the top of each tab that was pried up. Trace your finger along the\ncrease and show it on camera, explain how each tab has now been mechanically creased and\nconfirms the roof failed a “brittle test”. (picture below)\nOnce you have finished recording your video. Take close-up after pictures of the rows above the\nreplaced shingle. Draw an arrow to where the crease is on the shingle or point to it for the picture.\n(see good examples of after pics below email template)\nTo whom it may concern,\nPlease see the attached video link and photos of the attempted repair for the claim number\n(#__________).\nAs can be clearly seen in the evidence provided, the homeowner's roof sustained additional\ndamage during the attempted repairs. Thus confirming a failed brittle test for the shingles, indicating\nirreparability for the roof as a whole.\nWith this fact established, your current estimate does not adequately address the needs of this roof.\nPerforming further patch repairs as [INSURANCE COMPANY NAME] has suggested will\nunintentionally, yet unavoidably, cause further extensive damage to surrounding shingles.\nTherefore I have gone ahead and attached an estimate that accurately reflects the full scope of\nwork necessary to make our mutual client whole again.\nYouTube Link: (watch this for a good example)\nI also ask that you take note of the attached before and after pictures of the attempted repair. These\nphotos clearly demonstrate the brittleness of this roof, and moving forward with further patch repairs\nwill inevitably do further unavoidable damage to surrounding shingles.\nPlease review these findings and revise your estimate/scope of work accordingly, so we can begin\nto move forward with the full roof replacement for [HOMEOWNER NAME]. If we can provide any\nadditional information, please don't hesitate to reach out.\n\nThank you for your time and for working with us to assist [HOMEOWNER] in restoring their property\neffectively after the loss they have experienced.\n(your signature)\nBefore\nBefore\nBefore\nAfter\n(continue below)\nAfter\nAfter\n\nWhen you need a Hover ESX, XML, or PDF to send to your adjuster, please task Brandon, Danny,\nFord, or Reese to approve your Hover. Please state in your task if it is roof only or roof and siding.\nAfter the Hover is approved, you will receive an email from Hover with the PDF. Once you receive\nthat, it means your Hover is ready (if it is roof and siding, it will take a little bit longer to have the\nsiding added as well.)\nOnce the Hover is complete, you will be able to download your own ESX, XML, or PDF. You will\nalso be able to see if your Hover is still processing and not ready for download yet.\nYou will do this through your internet browser; this can be done on a computer, ipad, or on your\nphone. Go to the website: Hover.to\nOnce you go there, search your customer’s Job ID to find your customer. See the screenshot\nbelow. The Job ID is 6902\nIf you manually created the hover (which you should not be doing) you will have to just search for\nthe customer’s hover that you manually created.\nOnce you open the file, you will click “export”. See screenshot below\nYou will then download the ESX. See screenshot below\nESX is at the very bottom. Once you click that checkbox next to it, press download.\nThe most effective way to get this to your adjuster is to:\nEmail this file to yourself.\nDownload the document(s) on your computer, phone or iPad.\nCompose a new email and send it to your adjuster. (This way you can write the subject, write the\nnote, and it should have your signature at the bottom of the email.)\n\nSlide 1\n\nSlide 2\nThe GAF Lifetime Roofing System\n\nSlide 3\n2020\nTimberline HDZ® History\n\nSlide 4\nProprietary color blends and enhanced shadow effects create eye-catching dimensionality on a thick shingle, while GAF Time-Release Algae-Fighting Technology helps prevent blue-green algae stains. \n\nSlide 5\nTimberline® UHDZ™ Available Colors\nPewter Gray \nCharcoal\nShakewood\nSlate\nBarkwood\nWeathered Wood\n\nSlide 6\nSide by Side with Competition\nGround Level\nEye Level\n\nSlide 7\nBeautiful. Reliable. Affordable.\nThe perfect choice for first-time buyers, these shingles add beauty and performance to any roof.\nCharcoal\nAutumn \nBrown\nGolden \nCedar\nNickel \nGray\nSilver \nLining\nWeathered \nGray\nDimensions: 12” x 36”\nExposure: 5”\nBundles/Square: 3\nNails/Square: 316\nRidge Cap: Royal Sovereign® Shingle\nStarter Strip Shingle: Pro-Start® &\nWeatherBlocker™\nAvailable Colors\n\nSlide 8\n*Cobra Attic Vents & Master Flow Attic Exhaust Vents qualify for Attic Ventilation category\nWindProven™ Warranty Requirements\n\nSlide 9\nAnd Homeowners don’t know what it is. 4% of homeowners answered Algae/Mold as the cause of the discoloration.\nApproximately \n8\nout of 10\nhomeowners rate the appearance of the roof as very important 8 or more, on a scale of 10.\nWhy care about algae?\n\nSlide 10\n  \n10 year warranty\n25 year warranty \n\nSlide 11\nGAF Warranties\n†Lifetime refers to the length of warranty coverage provided and means as long as the original individual owner(s) of a single-family detached residence [or eligible second owner(s)] owns the property where the qualifying GAF products are installed. For other owners/structures, Lifetime coverage is not applicable. Lifetime coverage on shingles requires the use of GAF Lifetime Shingles only. See the GAF Shingle & Accessory Limited Warranty for complete coverage and restrictions. Visit gaf.com/LRS for qualifying GAF products. Lifetime coverage on shingles and accessories requires the use of any GAF Lifetime Shingle and at least 3 qualifying GAF Accessories. See the GAF Roofing System Limited Warranty for complete coverage and restrictions. For installations not eligible for the GAF Roofing System Limited Warranty, see the GAF Shingle & Accessory Limited Warranty. Visit gaf.com/LRS for qualifying GAF products.\n* GAF roofing systems in which Royal Sovereign® or Marquis WeatherMax® Shingles are installed in the field of the roof are not eligible for Lifetime warranty term. For complete coverage and restrictions, see GAF Shingle & Accessory Limited Warranty.\n10\n20\n50yr\n30\n40\nShingles\n+\nLabor\n100%\n20%\nShingles Only\n\nSlide 12\nLimited Lifetime Warranty\nGAF Lifetime Roofing Shingles\nSingle-Family Properties\n0\n10\n20\n30\n40\n50+\n20%\n40%\n60%\n80%\n100%\nReplacement Materials\n+\nInstallation labor\n+\nCost of tear off\n(if necessary)\nYears\nCoverage\nMaterials\nDefinition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred during the Smart Choice Protection Period], own the property where the shingles and/or accessories are installed. The Lifetime warranty is applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, governmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years.\nTypical shingle warranty\nInternal use only. Not for distribution.\nGAF Product\nTypical competitor warranty\n\nSlide 13\nLimited Lifetime Warranty\nGAF Lifetime Roofing Shingles\nSingle-Family Properties\n0\n10\n20\n30\n40\n50+\n20%\n40%\n60%\n80%\n100%\nYears\nCoverage\nMaterials\nDefinition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred during the Smart Choice Protection Period], own the property where the shingles and/or accessories are installed. The Lifetime warranty is applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, governmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years.\nReplacement Materials\n+\nInstallation labor\n+\nCost of tear off\n(if necessary)\n+\nDisposal\nTypical shingle warranty\nWorkmanship\nInternal use only. Not for distribution.\nGAF Product\nGAF Workmanship\nTypical competitor warranty\n\nSlide 14\nLimited Lifetime Warranty\nGAF Lifetime Roofing Shingles\nSingle-Family Properties\n0\n10\n20\n30\n40\n50+\n20%\n40%\n60%\n80%\n100%\nYears\nCoverage\nMaterials\nDefinition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred during the Smart Choice Protection Period], own the property where the shingles and/or accessories are installed. The Lifetime warranty is applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, governmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years.\nReplacement Materials\n+\nInstallation labor\n+\nCost of tear off\n(if necessary)\n+\nDisposal\nWorkmanship\n(30 yrs for Designer shingles,\n25 yrs for all other shingles)\nTypical shingle warranty\nInternal use only. Not for distribution.\nGAF Product\nGAF Workmanship\nTypical competitor warranty\n\nAll the below are standard products we offer to customers at no additional cost:\nROOFING:\nShingles:\nGAF Timberline HDZ\n-architectural\n-lifetime warranty (for as long as they own the home, prorated)\nUnderlayment:\n15# Felt Paper\nSIDING:\nVinyl siding:\nCertainteed Mainstreet\nGUTTERS:\nSeamless (no exposed nails)\nK-style gutters\nAluminum\n\nInsurance Process Steps & Timeline\n*** Please note that every insurance company/ individual adjuster has slightly different timeline\nbased on multiple variables. Below is what we can typically expect:\nStep 1: Schedule Adjuster Meeting\nAssigned insurance adjuster will reach out within 1-3 business days to schedule their inspection of\nyour property\nIf you have interior or would like to make sure you are home for the inspection, please schedule and\nlet me know so I can fit it into my calendar\nOtherwise, please have the adjuster call me directly to schedule\nTHE most important part to me helping you get fully approved... is that I am here for the insurance\ncompany’s inspection.\nStep 2: Adjuster Meeting\nThis meeting will typically be scheduled within 1-2 weeks of filing the claim varying based on the\nadjuster’s current work load.\nI will arrive 30 minutes prior to the scheduled adjuster meeting time to set up my ladder.\nAfter the inspection, we will knock on your door to recap our inspection and to communicate the\nnext steps. If you are not home, I will call you to let you know how things went.\nStep 3: Approved Scope of Work\nWithin 5 business days, the insurance company will provide an itemized estimate of the approved\nscope of work.\nIf we have not received anything within a week of the adjuster meeting, we will begin following up\nwith you and the insurance company directly\nOnce you have received their written documentation please email that directly to myself and\n\nSlide 1\n\nSlide 2\n2020\nTimberline HDZ® History\n\nSlide 3\nThe Industry’s Largest Nailing Zone\nThe StrikeZone™ Nailing Area provides up to a \n600% larger nailing target\n\nSlide 4\nThe Winning Combination \nAlignment Guide\nStrikeZone™ Nailing Area\nDura Grip™ Adhesive\nLayerLock™ Technology\nSmooth microgranule surface\n\nSlide 5\nProduct \nOverview\n\nSlide 6\nThe GAF Lifetime Roofing System\n\nSlide 7\nAmerica’s #1-selling Shingle just got better — again!\nNow with GAF Time-Release Algae-Fighting Technology and LayerLock™ Technology, Timberline HDZ® offers everything you can expect from an architectural shingle roof, and more.- All Colors Back In Production\nProduct/System Specifications\nDimensions: 13 ¼” x 39 n”\nExposure: 5 n”\nBundles/Square: 3 (63 pieces)\nNails/Square: 256\nRidge Cap: TimberTex®; TimberCrest™;  Seal-A-Ridge®; Z®Ridge; Ridglass®\nStarter Strip:  Pro-Start®; QuickStart®;  WeatherBlocker™\nHarvest Blend Colors\nCharcoal\nWeathered Wood\nPewter Gray\nHickory\nShakewood\nBarkwood\nNantucket Morning\nAppalachian Sky\nCedar Falls\nGolden Harvest\nMost Popular Colors\n\nSlide 8\nRepositioning Timberline® AH \nHarvest Blend\nProduct/System Specifications\nDimensions: 13 ¼” x 39 n”\nExposure: 5 n”\nBundles/Square: 3 (63 pieces)\nNails/Square: 256\nRidge Cap: TimberTex®; TimberCrest™;  Seal-A-Ridge®; Z®Ridge; Ridglass®\nStarter Strip:  Pro-Start®; QuickStart®;  WeatherBlocker™\nALL 4 COLORS BACK IN REGULAR PRODUCTION\n\nSlide 9\nProprietary color blends and enhanced shadow effects create eye-catching dimensionality on a thick shingle, while GAF Time-Release Algae-Fighting Technology helps prevent blue-green algae stains. \nDimensions: 13 ¼” x 39 n”\nExposure: 5 n”\nBundles/Square: 4 (64 pieces)\nNails/Square: 256\nRidge Cap: Timbertex®;  Seal-A-Ridge®;  Z®  Ridge;  Ridglass®  8”;  Ridglass®  10”  \nStarter Strip Shingle: ProStart®  &  WeatherBlocker™ \n\nSlide 10\nTimberline® UHDZ™ Available Colors\nPewter Gray \nCharcoal\nShakewood\nSlate\nBarkwood\nWeathered Wood\n\nSlide 11\nSide by Side with Competition\nGround Level\nEye Level\n\nSlide 12\nBeautiful. Reliable. Affordable.\nThe perfect choice for first-time buyers, these shingles add beauty and performance to any roof.\nCharcoal\nAutumn \nBrown\nGolden \nCedar\nNickel \nGray\nSilver \nLining\nWeathered \nGray\nDimensions: 12” x 36”\nExposure: 5”\nBundles/Square: 3\nNails/Square: 316\nRidge Cap: Royal Sovereign® Shingle\nStarter Strip Shingle: Pro-Start® &\nWeatherBlocker™\nAvailable Colors\n\nSlide 13\nDesigned to complement your home’s exterior color scheme, these shingles give your home the luxury look you want without breaking your budget. Now with GAF Time-Release Algae Protection and a 25-Year StainGuard Plus ™ Algae Protection Limited Warranty against blue-green algae discoloration.\nCharcoal\nAvailable Colors\nRoyal Slate\nAntique Slate\nWeathered \nTimber\n\nSlide 14\nBold shadow lines and tapered cut-outs to create the appearance of depth and dimension of slate at only a fraction of the cost of traditional slate. Now with GAF Time-Release Algae Protection and a 25-Year StainGuard Plus ™ Algae Protection Limited Warranty against blue-green algae discoloration.\nRoyal Slate\nWeathered \nSlate\nEnglish Gray\nAntique\nSlate\nAvailable Colors\nRoyal Slate\nEnglish Gray\nWeathered \nSlate\nAntique Slate\n\nSlide 15\n\nSlide 16\nAccessory Overview\nAccessories\n\nSlide 17\nPeel & stick underlayment with blue, synthetic patterned surface for asphalt shingles and metal roof systems\n2.0 Sq. roll (excludes laps); 36” x 66.7’\nSelf-seals around fasteners and at vulnerable areas of the roof to protect against ice dams and wind-driven rain\nPatterned surfacing provides great installer traction \n250oF high-temp rating is compatible with most metal roofing\nFiberglass-reinforced construction\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty \n\nSlide 18\nPhase 2 - Dual\nPhase 1 - Single \nSingle-Sided Integrated Selvedge\nEliminates current separate selvedge tape - easier to work with for contractors, eliminates risk of loose tape/trip hazard\nTargeting rolling commercialization first half of 2023\nDual-Sided Integrated Selvedge\nAllows for multidirectional installation - increased efficiency for installers, especially on full-deck applications or complex roof designs\nIn-development, will be field tested with contractors in various markets\nIP protected\nCurrent \nConversion to \nIntegrated Selvedge  \n\nSlide 19\nPeel & stick underlayment with mineral surfacing for asphalt shingle roof systems\n2.0 Sq. roll (excludes laps), 36” x 66.7’\n1.5 Sq. roll (excludes laps), 36” x 50’\nSelf-seals around fasteners and at vulnerable areas of the roof to protect against ice dams and wind-driven rain\nFiberglass-reinforced construction\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 20\nPremium breathable synthetic underlayment for asphalt shingle and other roof systems\n10 square roll (excludes laps); 48” x 250’\nBreathable technology allows trapped moisture to escape from the roofing systems (16 perms)\nPremium, spunbond polypropylene construction for long-lasting performance, excellent tear-resistance and nail pull-through\nExcellent traction for installers\nLight-blue surfacing is cooler to work on versus typical black felts\nCustom logo surface printing available\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 21\nPremium synthetic underlayment for asphalt shingles and other roof systems\n10 square roll (excludes laps); 48” x 250’\nSpunbond polypropylene construction for long-lasting performance, excellent tear-resistance and nail pull-through\nMoisture control feature on deck-side helps reduce moisture on the roof deck (unlike typical non-breathable synthetic underlayments)\nExcellent traction for installers, includes deck-side anti-slip coating\nCustom logo surface printing available\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 22\nCost-effective synthetic underlayment for asphalt shingles\n10 square roll (excludes laps); 48” x 250’\nCompetitively priced with typical #30 asphalt felts (pricing varies by market)\nDurable, polypropylene construction avoids tearing underfoot or in high-winds (unlike typical asphalt felt underlayments)\nExcellent traction for installers, includes deck-side anti-slip coating\nMedium-gray surfacing is cooler to work on versus typical black felts\nCustom logo surface printing available\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 23\nPremium eave/rake starter strip for all asphalt shingles\n50 Ln. Ft./Bdl. (Full Sheet); 100 Ln. Ft./Bdl. (Half Sheet)\n8.5” x 40” (Half Sheet); 17” x 40” (Full Sheet)\nCost-effective solution vs. using cut-up 3-tabs \n42% more coverage per bundle (vs. cut-up 3 tabs)\nPre-perforated design eliminates cutting\nProperly-positioned DuraGrip™ Adhesive locks down shingles at eaves/rakes\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 24\nStandard eave/rake starter strip for GAF Timberline® and Royal Sovereign® shingles\n120 Ln. Ft./Bdl.\n13” x 38” (Full Sheet); 6.5” x 38” (Half Sheet)\nCost-effective solution vs. using cut-up 3-tabs \n50% more coverage per bundle (vs. cut-up 3 tabs)\nPre-perforated design eliminates cutting\nProperly-positioned DuraGrip™ Adhesive locks down shingles at eaves/rakes\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 25\nPremium 4’ plastic filtered ridge vent for colder climates\nSizes:  11.5” x4’,  9” x 4’\nHand nailable installation with included 3” ring shank nails\nNFA:  18 in2 /lin.ft.\n3” ring shank nails included on the baffle of each vent \n3” increment EasyTear® Sizing Feature allows for hand-sizing\nSnow Guard™ filter helps resist snow infiltration in harsh winter climates\nEngineered for durability with UV-resistant, high-impact polymers\nEligible component of GAF WindProven & enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 26\nRoll intake vent for all climates. For homes with little/no soffits or those with clogged soffit vents\nSize: 11” x 20’\nNail gunnable with included 1-3/4” coil nails\nNFA:  9 in2 /lin.ft. \nRooftop installation eliminates the need for expensive/time-consuming alterations at the soffits/fascia\nShingle-over, tapered design helps blend into finished roof\nWeather-resistant design helps protect against rain, snow and ice \nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 27\nPremium double-layer ridge cap for GAF Timberline® & Designer Shingles\n20 Ln. Ft./Bdl.; 8” exposure\n36” x 12” (Full shingle); splits into (3) - 12” x 12” ridge caps\nLarge 8” exposure for less pieces to install and dramatic look\nDistinct finishing touch for GAF roofs\nComplementary match to GAF shingles (unlike cut-up 3-tabs)\nPre-perforated design eliminates cutting\nFactory-applied DuraGrip™ Adhesive\nEligible component of GAF WindProven and residential enhanced warranties\nEligible for Lifetime Limited Warranty\n\nSlide 28\nTraditional-look ridge cap for GAF Timberline® shingles\n25 Ln. Ft./Bdl.; 6-n” exposure\n36” x 12” (Full shingle); splits into (3) - 12” x 12” ridge caps\nComplementary match to GAF shingles (unlike cut-up 3-tabs)\nPre-perforated design eliminates cutting\nFactory-applied DuraGrip™ Adhesive\nEligible component of GAF WindProven and residential enhanced warranties\n\nSlide 29\n\nSlide 30\n\nSlide 31\nOverview & Key Benefits:\nPremium upgrade for low-end pipe boots/collars which often fail before the service life of shingles\nUnlike “typical” pipe boots/collars that flash the pipe from the outside, the Pivot completely encapsulates the pipe\nAll-metal, galvanized steel construction \nNo exposed seals, gaskets, or caulk \nIntegrated rooftop pitch adjustment - 3:12 - 12:12\nColors - Black, Weathered Wood, Brown, & Gray\nSizes -  1-½”, 2”, 3” & 4” to work with standard Schedule 40 PVC, ABS, and Steel pipe inside diameters\nWarranted for the life of the roof covering - up to 50 years\nEligible for enhanced warranty coverage when installed on GAF enhanced warranty jobs\n  Coming Later in 2023 - Gen. 2 Design Enhancements\nSelf-adapting insert for non-standard pipe I.D.s - typical on old cast iron plumbing pipes etc.\nExtender accessory for pipe heights greater than 15”\n\nSlide 32\nOverview & Key Benefits:\nAdjustable design for convenient installation.\nAluminum construction for rust & corrosion resistance.\nFor rooftop flues, hot stacks and B-vent installations\nVersa Caps\nModel/Spec Chart\n\nSlide 33\n\nSlide 34\nRebranding/Support for the Residential Business\nCompletely rebranded packaging for system\nRedesigned System Sell Sheets, Cap & Base Samples, Color Chip Sample, Installation Instructions, and new Distributor Counter Mat\nComing in Early 2023\nQ1 - Launching new 1-gallon LIBERTY Asphalt Primer and SBS Flashing Cement accessories in support of Liberty system sell\nRevamped Limited Product Warranty\n10, 15, and 20-Year Warranty (depending on system configuration)\nIncrease max squares - previously 20 sq, now 25 sq\nProduct Knowledge Sessions to introduce each of the new LIBERTY accessories and further details of product enhancements\nExploring options for system distributor display\n\nSlide 35\n4.3M\nHomes per year\nTear Off\nHeadlap, Granules, Asphalt, Other (Nails, Underlayment, etc.)\nBased on 25 sq home avg.\n\nSlide 36\n*Cobra Attic Vents & Master Flow Attic Exhaust Vents qualify for Attic Ventilation category\nWindProven™ Warranty Requirements\n\nSlide 37\nAnd Homeowners don’t know what it is. 4% of homeowners answered Algae/Mold as the cause of the discoloration.\nApproximately \n8\nout of 10\nhomeowners rate the appearance of the roof as very important 8 or more, on a scale of 10.\nWhy care about algae?\n\nSlide 38\nWhy GAF Time-Release Algae-Fighting Technology?\nGAF Time-Release Algae-Fighting\ntechnology uses specially engineered capsules* that are infused throughout with thousands of copper microsites.\nThis infusion throughout the capsule allows the copper to release steadily over time, providing protection to the shingles for longer.\nhttps://us.gaf.com/sgsample\n*25-year StainGuard Plus™ Algae Protection Limited Warranty against blue-green algae discoloration is available only on products sold in packages bearing the StainGuard Plus™ logo. See GAF Shingle & Accessory Limited Warranty for complete coverage and restrictions.\n\nSlide 39\nGAF Time-Release Algae-Fighting Technology Advantages\n\nSlide 40\n\nSlide 41\nGAF Warranties- Typical\n†Lifetime refers to the length of warranty coverage provided and means as long as the original individual owner(s) of a single-family detached residence [or eligible second owner(s)] owns the property where the qualifying GAF products are installed. For other owners/structures, Lifetime coverage is not applicable. Lifetime coverage on shingles requires the use of GAF Lifetime Shingles only. See the GAF Shingle & Accessory Limited Warranty for complete coverage and restrictions. Visit gaf.com/LRS for qualifying GAF products. Lifetime coverage on shingles and accessories requires the use of any GAF Lifetime Shingle and at least 3 qualifying GAF Accessories. See the GAF Roofing System Limited Warranty for complete coverage and restrictions. For installations not eligible for the GAF Roofing System Limited Warranty, see the GAF Shingle & Accessory Limited Warranty. Visit gaf.com/LRS for qualifying GAF products.\n* GAF roofing systems in which Royal Sovereign® or Marquis WeatherMax® Shingles are installed in the field of the roof are not eligible for Lifetime warranty term. For complete coverage and restrictions, see GAF Shingle & Accessory Limited Warranty.\n10\n20\n50yr\n30\n40\nShingles\n+\nLabor\n100%\n20%\nShingles Only\n\nSlide 42\nLimited Lifetime Warranty\nGAF Lifetime Roofing Shingles\nSingle-Family Properties\n0\n10\n20\n30\n40\n50+\n20%\n40%\n60%\n80%\n100%\nReplacement Materials\n+\nInstallation labor\n+\nCost of tear off\n(if necessary)\nYears\nCoverage\nMaterials\nDefinition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred during the Smart Choice Protection Period], own the property where the shingles and/or accessories are installed. The Lifetime warranty is applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, governmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years.\nTypical shingle warranty\nInternal use only. Not for distribution.\nGAF Product\nTypical competitor warranty\n\nSlide 43\nLimited Lifetime Warranty\nGAF Lifetime Roofing Shingles\nSingle-Family Properties\n0\n10\n20\n30\n40\n50+\n20%\n40%\n60%\n80%\n100%\nYears\nCoverage\nMaterials\nDefinition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred during the Smart Choice Protection Period], own the property where the shingles and/or accessories are installed. The Lifetime warranty is applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, governmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years.\nReplacement Materials\n+\nInstallation labor\n+\nCost of tear off\n(if necessary)\n+\nDisposal\nTypical shingle warranty\nWorkmanship\nInternal use only. Not for distribution.\nGAF Product\nGAF Workmanship\nTypical competitor warranty\n\nSlide 44\n\nSlide 45\nLimited Lifetime Warranty\nGAF Lifetime Roofing Shingles\nSingle-Family Properties\n0\n10\n20\n30\n40\n50+\n20%\n40%\n60%\n80%\n100%\nYears\nCoverage\nMaterials\nDefinition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred during the Smart Choice Protection Period], own the property where the shingles and/or accessories are installed. The Lifetime warranty is applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a corporation, governmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years.\nReplacement Materials\n+\nInstallation labor\n+\nCost of tear off\n(if necessary)\n+\nDisposal\nWorkmanship\n(30 yrs for Designer shingles,\n25 yrs for all other shingles)\nTypical shingle warranty\nInternal use only. Not for distribution.\nGAF Product\nGAF Workmanship\nTypical competitor warranty\n\nSlide 46\nShingle Wrapper Updates\n\nSlide 47\nScope Connect Pilot\n$75\n\nSlide 48\nGAF SmartMoney Powered by Payzer is a complete paperless payment solution that securely accepts virtually any form of payment and helps close more sales. \nPaperless financing available through multiple lenders.\nUnified dashboard view for Tracking receivable and managing billing.\nImportant Links\nVideo: Link  \nGAF Promo Video  \nEnrollment: Link\nEligible Certifications: Contractors with at least $1MM in total sales volume and in most cases, 1 year in business.\n\nSlide 49\n\nSlide 50\nLearning Portal\nSign up: gaf.com/learning\nLive Events: Join us in person or through a webinar\n \nOn Demand: Learn at your own pace\nQuarterly Promotions:\nEarn merch for learning\nOver 30,000 classes taken last year by contractors  just like you!\n\nSlide 51\n\nSlide 52\nIn 2021, we processed 50K rebates to our military customers\nOffer your US Military Troops customers the value of a $250 rebate* when they install a qualifying GAF Roofing System on their home and purchase an Enhanced Warranty.  \n*Terms and Conditions apply \nSell Sheet SKU #s: \nEnglish - RESGN452  \nSpanish - RESGN452S\n\nSlide 53\n\nSlide 54\n\nSlide 55\n\nSlide 56\n\nSlide 57\n\nSlide 58\n\nSlide 59\n\nSlide 60\n\nSlide 61\n\nSlide 62\n\nSlide 63\n\nSlide 64\n\nSlide 65\n\nSlide 66\n\nSlide 67\n\nSlide 68\nGAF Contacts\nPHONE\n877-GAF-ROOF \n(877-423-7663)\n \nFor Orders\nSelect Option 1\ncustomercareresidential@gaf.com\nContractor Support\nSelect Option 2\nccp@gaf.com\nWarranties, Guarantees, and Claims\nSelect Option 3\nwarrantyclaims@gaf.com\nTechnical Assistance\nSelect Option 4\ntechnicalquestions@gaf.com\nMaster Flow® Ventilation\nSelect Option 5\nDirect: 800-755-9392\nFor Master Flow® Warranty Questions:  CLICK HERE \n   nFor Master Flow® Technical Questions:  CLICK HERE  \nOther Support Departments\nSelect Option 6",
  "textLength": 89476,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}