{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Sales Operations and Tasks.docx",
  "name": "Sales Operations and Tasks.docx",
  "type": "docx",
  "size": 4875063,
  "relativePath": "Sales Operations and Tasks.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:00:59.219Z",
  "extractedText": "Sales Operations and Tasks\n\n\n\nQuick Tip: Press CTRL + F and type in what you are looking for in the search bar. (for example: type “Appraisal”)\n\n\n\nSending Documents for e-sign iTel / Repair Attempt\n\nTask Brandon Pernot (operations assistant) during Business Hours\n\nReach out to and/or Task Danny or Brandon Pernot after Business Hours\n\nIf sending Itel or Repair Attempt, must have:\n\nCurrent partial estimate\n\nPhotos\n\n (see the section titled: Creating iTel, Repair Attempt, and Tarp Agreements below)  \n\n Once Customer signs iTel / RA Agreement - Tag Brandon Pernot and he will create Task to get a Field Technician scheduled\n\nCustomer needs Tarp\n\nCreate Tarp Agreement and have customer sign (see the section titled: Creating iTel, Repair Attempt, and Tarp Agreements below)  \n\nCollect payment from customer\n\nIf check/cash - bring it to the office\n\nIf credit card - Task Ford to send qb link to customer for tarp payment\n\nTag Reese once customer has signed and you received payment\n\nWe will create task to get FT scheduled for tarp\n\nNeed a Repair Estimate\n\nTask Danny\n\n\n\nRequesting a job to be reviewed or to go to Appraisal or Public Adjuster\n\nMessage (Not Task) Reese on the job you would like reviewed\n\nRequesting a job be reviewed to go to TAG Reese on the job you would like reviewed\n\nIf you believe a job is dead\n\nTag Reese on the message board for the job\n\nIf you need a customer job file to be created in the Field Portal\n\nYou must have the following:\n\nFull name\n\nEmail\n\nAddress\n\nPhone Number\n\nTH/SFH\n\nTask Brandon Pernot\n\nIf you have production/operations related questions\n\nTask and Tag Ford\n\nIf you need a job reviewed for Retail/Insurance Conversion\n\nTAG Reese on the message board and he will create the proper task for Ford\n\nIf you have general questions about estimates, denials, partials, reinspect, or any job stage before install\n\nTag Reese, Danny, and/or Brandon Pernot\n\nIf you need immediate assistance to answer a customer’s questions about product, warranty, pricing, etc and you are unsure how to answer\n\nIn a group text, text Ford, Reese, and Oliver the question, one of them should be able to get to you quickly\n\nIf 1 minute passes and you do not have an answer Call Ford, Reese, Oliver, PC’s, or Trainers\n\nFull Approvals must have\n\nPhotos\n\nHover\n\nIf you submit estimate to Amber and do not have photos and hover yet, she will not move forward with Project Review\n\nOnce you upload photos/hover, Tag Amber to let her know\n\n\n\n\n\n\n\nPinning Homes\n\nYou should pin every home that you knock\n\nUnder the Leads page of the Field Portal App on your phone, you will press the arrow at the top right of the screen to pull up the map\n\nHere, you will long press on a home and then fill out the information you have\n\nStatus is the only required field (it is a drop down menu)\n\nSee screenshots below\n\n\n\n\n\n\n\nSigning up a new customer\n\nEnter all required fields on Sales App using the iPad\n\nAfter HO files claim, enter Claim Number\n\nPress Proceed to Agreement  ONCE ONLY (if nothing happens, wait at least a minute before attempting to press it again - simply because nothing happens immediately, it does not mean that you did not press the button, the system is just moving slow)\n\nYou sign Contingency Agreement\n\nFor roof and aluminum siding sign up, write “Full replacement value claim = Full approval for roof and/or siding”\n\nHO signs Contingency Agreement and Claim Authorization\n\nPress Submit\n\nEnter password roofer if applicable\n\nSigning up a lead\n\nWhen a lead is already in your portal under Inspection Pending\n\nDO NOT type in all the HO’s information again\n\nPress the red letters at the top of the screen that says LEADS\n\nThen you select your customer’s name\n\nAfter HO files claim, enter Claim Number\n\nPress Proceed to Agreement  ONCE ONLY (if nothing happens, wait at least a minute before attempting to press it again - a lot of people think they must not have pressed it, which is why it did not go through, but usually it is not the case, the system is just moving slow)\n\nYou sign Contingency Agreement\n\nFor roof and aluminum siding sign up, write “Full replacement value claim = Full approval for roof and/or siding”\n\nHO signs Contingency Agreement and Claim Authorization\n\nPress Submit\n\nEnter password roofer if applicable\n\nSee screenshot below \n\n\n\n\n\nCreating iTel, Repair Attempt, or Tarp Agreements\n\nClick the words Switch Agreement at the bottom right of the screen\n\nSelect needed agreement (Itel, Repair Attempt, or Tarp)\n\nDO NOT enter in the customer’s information again\n\nPress Existing Customers at the top right of the screen\n\nFill out additional information at the bottom of the page\n\nPlease reach out to Reese, Danny, or your trainer if you need additional assistance with this bottom section\n\nPress Proceed to Agreement\n\nYou sign Agreement\n\nCustomer signs Agreement\n\nFor iTel and Repair Attempt make sure to let HO know that they are never responsible for the cost that appears on the agreement (read the bold section of the agreement)\n\nFor Tarp make sure to let HO know to submit payment first, but they will be reimbursed by the insurance company\n\nSee section above titled: “Customer needs Tarp”\n\nUploading Missing Documents\n\nIf you notice that the job file for your customer is missing Contingency or Claim Authorization do the following:\n\nOpen the Sales App\n\nClick the documents button (folder) at the bottom left of the screen\n\nScroll until you see your customer\n\nPress the upload button next to each of the forms that you need uploaded (button looks like a cloud with an up arrow inside of it)\n\n\n\n\n\nFilming Repair Attempt Video\n\nBefore you begin filming, ask the Field Tech (Francisco or Ishmael) to point out which of the surrounding shingles will be affected by the extraction. Mark the damaged tab (if applicable) and mark the bottom right corner with chalk of every shingle the Field Tech points out.\n\n\n\n\n\n\n\n Before you begin filming; take a before shot of the area where you will be extracting the shingle. Start recording,  “...Here we are at [HOMEOWNER’S HOUSE] performing a repair attempt on this storm damaged shingle. As you can see I have pre-marked every tab that will sustain unavoidable creasing due to the brittleness of the roof. Go ahead and get started Francisco/Ishmael”\n\n\n\n\n\nFilm the entire area where repair is going to occur, then go from the Wide camera shot to a low down side view camera angle, to show how the shingles get bent back/pried up during the process. Make sure to show on camera or explicitly mention the high amount of granule loss running down the roof.\n\n\n\n\n\nOnce the new shingle has been installed, hover the camera over the shingles and wipe your hand back and forth gently over the top of each tab that was pried up. Trace your finger along the crease and show it on camera, explain how each tab has now been mechanically creased and confirms the roof failed a “brittle test”.\n\n\n\n\n\n\n\nOnce you have finished recording your video. Take close-up after pictures of the browns above the replaced shingle. Draw an arrow to where the crease is on the shingle or point to it for the picture.\n\n\n\nChecklist for Post-Adjuster Meeting\n\nPhoto Report Complete\n\nUpload photo report from photos tab when you have good reception\n\nHover Complete\n\nMove Job File\n\nMost jobs should go to Estimate Pending (make sure to look at next item on this check list - very important when moving a job to Estimate Pending)\n\nJobs that you think are partial or denial will be moved to Decision Pending\n\nNote: This is the ONLY time you move a job\n\nPost-Adjuster Meeting Script\n\nRead it to your customer if you have to - much better than missing something\n\nMain emphasis should be for them to send you the estimate once they receive it\n\nPost-Adjuster Meeting Email\n\nPlease send Claim Authorization (and photo report when needed) to the adjuster after the AM.  Start with the Post AM Email Template\n\nPlease make sure all of these things are complete before the end of the day of an Adjuster Meeting\n\n\n\nPartials/Reinspects/Moving jobs\n\nSee above for when you should move a job to Decision Pending or Estimate Pending\n\nA job will be automatically moved for you after you submit the full approval, partial estimate, or denial letter (Do not move the job yourself to another stage here!)\n\nFor your jobs that are partial or denials - they will automatically be moved to one of two stages:\n\nPartial - Approval\n\nReinspection - Request Pending\n\nOnce your job is moved and you have a clear plan, make sure to execute\n\niTel\n\nRA\n\nReinspect\n\nCustomer Complaint Form\n\nEtc\n\nOnce you complete one of the above tasks:\n\nIf your job was in Partial - Approval, move job to Partial Pending - which will let the customer know that you have sent in your arguments and are awaiting additional communication or potentially an updated estimate to full approval\n\nIf your job was in Reinspection-Request Pending and the adjuster has confirmed they will be scheduling a reinspect, move job to Reinspection Pending\n\nOnce the reinspection has happened, ensure the same tasks that are listed under the Checklist for Post-Adjuster Meeting are completed\n\nIn most cases, the only item not completed there yet would be moving the job back to Decision or Estimate Pending\n\n\n\n",
  "textLength": 9181,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}