{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Email Templates/Siding Argument.docx",
  "name": "Siding Argument.docx",
  "type": "docx",
  "size": 10285,
  "relativePath": "Email Templates/Siding Argument.docx",
  "category": "email_templates",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:33.820Z",
  "extractedText": "Siding Argument to send to Insurance/Adjuster\n\nSend to Adjuster/Insurance and CC the customer\n\nCC or BCC Reese if needed\n\nPLEASE DO NOT JUST COPY AND PASTE, PLEASE REVIEW SECTIONS TO BE CHANGED, REMOVED, OR ADDED (i.e., THE USE OF ‘AND/OR’)\n\nPLEASE EDIT THE INFO TO ALIGN WITH YOUR SPECIFIC JOB!!!! PLEASE DELETE ALL INSTRUCTIONS BEFORE SENDING THIS TO YOUR HOMEOWNER.  EVERYTHING IN THE BRACKETS [ ] SHOULD BE DELETED BEFORE SENDING\n\n\n\n\n\n\n\n\n\nTo Whom it May Concern\n\n\n\nThis is [REP NAME] with Roof ER.  I am the contractor assisting [CUSTOMER’S NAME].  Attached you will find [MAKE SURE TO EDIT THIS SECTION FOR WHAT DOCUMENTS YOU ARE ACTUALLY ATTACHING] my photo report [AND/OR], an iTel Report, [AND/OR] a repair estimate that includes the siding.\n\n\n\n[INCLUDING THE FOLLOWING ARGUMENTS THAT ARE APPLICABLE TO YOUR EMAIL]\n\n\n\n\n\nDamage\n\nYou will find our photo report in the list of attachments citing additional damage not accounted for in (insurance)'s original estimate. This damage is consistent with what has already been approved which leaves us and the homeowner unsure why these findings were left off of the estimate. [Additional details as needed]\n\nDiscontinued\n\nThis estimate is for a full siding replacement due to the existing siding being discontinued. Per the attached iTel report, there are no similar matches available and so our estimate accounts for all elevations of siding.\n\nThe current siding is discontinued.  The similar siding that is available would have to be special ordered and paint matched.  Because of those things, it would not be a cost-effective solution to restore [HOMEOWNER’s] siding.  The only way to effectively make them whole again would be with full siding replacement.\n\nCode/Housewrap\n\nPer building code, we are required to install a house wrap on exterior wall sheathing to prevent moisture from getting to the building envelope. Further, we are required to follow the manufacturer's installation instructions while applying the weather barrier. These instructions state we must overlap Housewrap 6\" over any outside corners. This would require us to remove the existing aluminum outside corner and detach the aluminum panels on the adjacent run that meet at that corner post. This is not only impractical, but also impossible without causing further damage to metal siding panels, as they will inevitably sustain damage during the removal process. Due to this consequential damage, we have submitted our estimate for a full siding replacement\n\n\n\n\n\nPlease review these findings and revise your estimate/scope of work accordingly so we can begin to move forward with the full replacement for [HOMEOWNER’S NAME]. If we can provide additional information, please let us know. Thank you for your time and for working with us to assist [HOMEOWNER’S NAME] in restoring their property effectively after the loss they have experienced.\n\n\n\nYour signature with your contact information\n\n\n\n",
  "textLength": 2923,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}