{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Customer Resources(Products, Warranties, etc.)/Silver Pledge Legalese.pdf",
  "name": "Silver Pledge Legalese.pdf",
  "type": "pdf",
  "size": 385210,
  "relativePath": "Customer Resources(Products, Warranties, etc.)/Silver Pledge Legalese.pdf",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T03:58:10.401Z",
  "extractedText": "The Legal Stuff \nWhat Is   Covered/Excluded. This Silver Pledge\n™\n Limited Warranty covers certain GAF roofing products installed on your roof (the “GAF Products”) including GAF Asphaltic Shingles,  \nGAF Ridge Cap Shingles, GAF Starter Strip Shingles, GAF Leak Barrier Products, GAF Roof Deck Protection Products, GAF Cobra\n®\n Attic Ventilation Products, and GAF-labeled Ultimate  \nPipe Flashing\n®\n with EasySleeve\n®\n (manufactured by Lifetime Tool\n®\n & Building Products LLC) in the unlikely event that they contain a manufacturing defect. Misapplication of your GAF  \nProducts and flashings at valleys, dormers, chimneys, and plumbing vents (the “Covered Flashings”) is also covered. Note: This limited warranty does not cover low-slope membranes,  \nMaster Flow\n®\n Ventilation Products, or GAF ThermaCal\n®\n Ventilated Nail Base Roof Insulation. Please go to gaf.com for a copy of the limited warranties covering these products.\nHow Long Your Warranty Lasts\nGAF Shingles\nManufacturing Defect CoverageWind Warranty CoverageAlgae Warranty Coverage\nMisapplication \nCoverage\nLimited \nWarranty Term\nSmart Choice\n®\n \nProtection  \nPeriod**\nLimited \nWarranty Term\nWind Speed Coverage \n(mph / km/h)\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection \nPeriod**\nLayerLock-labeled Shingles\nLifetime*50 Years15 Ye a r sWindProven\n™\n Limited  \nWind Warranty***:   \nNo maximum wind speed.\nFor all other installations:\nWith Special Installation****:  \n13 0 / 20 9\nWithout Special Installation****: \n110 / 175\nStainGuard \nPlus\n™\n:   \n25 Years\nStainGuard\n®\n:   \n10 Years\nStainGuard  \nPlus\n™\n: \n10 Years\nStainGuard\n®\n:   \n1 Year\n10 Years\nLifetime\n*\n Shingles\nLifetime*50 Years15 Ye a r sWith Special Installation****:  \n13 0 / 20 9\nWithout Special Installation****: \n110 / 175\nStainGuard \nPlus\n™\n:   \n25 Years\nStainGuard\n®\n:   \n10 Years\nStainGuard  \nPlus\n™\n: \n10 Years\nStainGuard\n®\n:   \n1 Year\n10 Years\nMarquis WeatherMax\n®\n30 Years20 Years15 Ye a r s80/130StainGuard\n®\n:   \n10 Years\nStainGuard\n®\n:   \n1 Year\n10 Years\nRoyal Sovereign\n®\n25 Years20 Years15 Ye a r s60/96StainGuard\n®\n:   \n10 Years\nStainGuard\n®\n:   \n1 Year\n10 Years\nGAF Ridge Cap Shingles\nManufacturing Defect \nCoverage\nWind Warranty CoverageAlgae Warranty Coverage\nMisapplication \nCoverage\nLimited \nWarranty Term\nWind Speed Coverage \n(mph / km/h)\nLimited  \nWarranty Term\nSmart Choice\n®\n \nProtection \nPeriod**\nTimberTex\n®\n, \nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the type of shingle installed  \nin the field of the roof.\n15 Ye a r sWith Special Installation****:  \n13 0 / 20 9\nWithout Special Installation****: \n110 / 175\nStainGuard\n®\n:   \n10 Years\nStainGuard\n®\n:   \n1 Year\n10 Years\nRidglass\n®\n, TimberCrest\n®\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the type of shingle installed  \nin the field of the roof.\n15 Ye a r sWith Special Installation****:  \n13 0 / 20 9\nWithout Special Installation****: \n110 / 175\nNo coverage.No coverage.10 Years\nSeal-A-Ridge\n®\n,   \nSeal-A-Ridge\n®\n AS\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the\n type of shingle installed  \nin the field of the roof.\n15 Ye a r s9 0 / 14 4StainGuard\n®\n:   \n10 Years\nStainGuard\n®\n:   \n1 Year\n10 Years\nZ\n® \nRidge\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the type of shingle installed  \nin the field of the roof.\n15 Ye a r sWith Special Installation****:  \n9 0 / 14 4\nWithout Special Installation****: \n7 0 / 112\nNo coverage.No coverage.10 Years\nOther GAF Accessories\nManufacturing Defect CoverageWind Warranty CoverageAlgae Warranty Coverage\nMisapplication \nCoverage\nGAF Starter Strip Shingles\nGAF Leak Barrier\n Products\nGAF Roof Deck Protection \nProducts\nGAF Cobra\n®\n Attic  \nVentilation Products\nLimited Warranty Term and Smart \nChoice\n®\n Protection Period** lasts as \nlong as the warranty for manufacturing \ndefects for the type of shingle installed  \nin the field of the roof.\nNo coverage.No coverage.10 Years\n      * Definition of Lifetime: The word “Lifetime” means as long as you, the original owner(s) [or the second owner(s) if coverage was properly transferred within the first 20 years], own the property where the shingles and/or accessories are \ninstalled. The Lifetime warranty term and 50-year non-prorated period are applicable only to shingles and accessories installed on a single-family detached residence owned by individuals. For any other type of owner or building, such as a \ncorporation, governmental entity, religious entity, condominium or homeowner association, school, apartment building, office building, or multi-use structure, the length of the warranty is 40 years and the non-prorated period is 20 years.\n    ** Smart  Choice\n®\n Protection Period: refers to the crucial period of time following installation of the GAF Products during which the coverage provided for in this limited warranty is non-prorated. After the Smart Choice\n®\n Protection Period \nspecified above, the remedy provided for in this warranty may be different than that provided for during the Smart Choice\n®\n Protection Period, and any remedy will be reduced to reflect the use you have received from your GAF Products. The \namount of use will be calculated by dividing the number of months which have elapsed since installation to the date of claim by the number of months in the warranty term. For a Lifetime warranty, GAF’s contribution in years 51 and beyond is \n20%. After the non-prorated period, GAF’s maximum liability for any roof shall NOT exceed three times the reasonable cost of replacement GAF Products before any reduction for use.\n  *** WindProven\n™\n Limited Wind Warranty requires installation of LayerLock-labeled shingles using 4 nails per shingle, and at least four (4) qualifying accessories.\n**** Special  Installation: Your GAF LayerLock-labeled shingles will be covered up to the maximum wind speed above ONLY if installed using 4 nails per shingle and you have GAF Starter Strip Products installed at the eaves and rakes. Special \nInstallation for all other GAF Shingles requires use of 6 nails per shingle and GAF Starter Strip Products installed at the eaves and rakes. Your GAF Ridge Cap Shingles will be covered up to the maximum wind speed above ONLY if your ridge \ncap shingles are installed in strict accordance with the “Maximum Wind Speed Coverage Under Limited Warranty” section of the applicable ridge cap shingle application instructions.\nWho Is   Covered By This Limited Warranty; Transferability \nYou are covered by this limited warranty if you live in the United States or Canada and are the original property owner (i.e., not a builder or installer) or the first subsequent owner if this \nwarranty was properly transferred. \nThis limited warranty may be transferred only once. The second owner must notify GAF in writing within one year after the property transfer for warranty coverage to be transferred. (Other \nthan this one transfer, this warranty may not be transferred or assigned, directly or indirectly.) If the transfer takes place within the first 20 years after installation, the second owner is \nentitled to the same coverage as the original owner. If the transfer takes place afterwards, the length of this warranty shall be reduced to the two-year period after the ownership changes. \nDuring this two-year period, GAF’s reimbursement to the second owner will be based only on the reasonable cost of replacement GAF Products, reduced by the amount of use that has been \nreceived from the GAF Products from date of installation through the date of claim.\nManufacturing Defects: What Is Covered/Sole And Exclusive Remedy \nGAF Warranty Company, LLC, a subsidiary of GAF, warrants that your GAF Products will remain free from manufacturing defects that adversely affect their performance during the applicable \nwarranty term listed above. Note: Wind Warranty and Algae Warranty are covered separately below.\n(1) During the Smart Choice\n®\n Protection Period: GAF will pay you the full reasonable cost of labor to repair or re-cover any defective GAF Product(s) (excluding non-GAF accessories, \nmetal work, or flashings other than Covered Flashings), and will provide replacement GAF Products or the reasonable cost of obtaining replacement GAF Products, at GAF’s option. The costs \nof labor to tear off some or all of your GAF Products and disposal are included if necessary to repair your roof.\n(2) After the Smart Choice\n®\n Protection Period: The repair or re-cover cost, replacement GAF Products, or reimbursement provided to you will be reduced to reflect the use you have \nreceived from your GAF Products. The amount of use will be calculated by dividing the number of months which have elapsed since installation to the date of claim by the number of months \nin the warranty term. For a Lifetime warranty, GAF’s contribution in years 51 and beyond is 20%. After the non-prorated period, GAF’s maximum liability for any roof shall NOT exceed three \ntimes the reasonable cost of replacement GAF Products before any reduction for use.\nSilver Pledge\n™\n \nLimited Warranty\ncontinued on next page\nSAMPLE\n385693_890_RESWT210-LEGAL_GAF Silver Pledge Limited Warranty SAMPLE 12-20.indd   11/13/21   11:38 PM\n\n \n  We protect what matters most\n™\n \nVisit gaf.com\nWindProven\n™\n L imited Wind Warranty: What I  s Covered/Sole and Exc  lusive Remedy \nThis l   imited warranty i   s specifically c ond  itioned o n your meeting all e  ligibility r   equirements, including i   nstallation of Layer  Lock-l abeled s hingles, GAF Ridge Cap Shingles, GAF Starter \nStrip Shingles, and a GAF Roof Deck Protection Product, plus your choice of e  ither a GAF Leak Barrier Product or GAF Attic Ventilation Product, and your Layer  Lock-l abeled s hingles b eing \nfastened and i   nstalled stri ctly i n accordance with GAF’s application i   nstructions. F  or i  nstallations which do not meet t  hese eligibility r   equirements, see Wind W arranty s ection b elo w. T he \nlimited warranty applies only t   o your Layer  Lock-l abeled s hingles and does not apply t   o any GAF Accessory Products. GAF warrants t   o you that y  our Layer  Lock-l abeled s hingles will n  ot f  ail \nto seal, blow off, or s  ustain damage from winds (including gusts) after t  hey should have sealed but did not due t   o a manufacturing defect. I  f y  our Layer  Lock-l abeled s hingles do fail t  o seal, \nblow off, or s  uffer wind damage, GAF will r  eimburse you for t  he reasonable costs of r  eplacing the blown-off or damaged shingles and hand-sealing any unsealed shingles. Costs r   elated \nto underlayment, metal work, and flashings are not i  ncluded. GAF’s maxim um l iability under t  his paragraph i   s t   o reimburse you for t  he cost of hand-sealing all o  f t  he Layer  Lock-l abeled \nshingles on your r  oof.\nWind Warranty: What I  s Covered/Sole And Exc  lusive Remedy \nGAF warrants t   o you that y  our GAF shingles and ridge cap shingles will n  ot f  ail t  o seal, blow off, or s  ustain damage from winds (including gusts) up to the applicable wind speed l   isted above \nafter t  hey should have sealed but did not due t   o a manufacturing defect or t  heir misapplication. I  f y  our s  hingles or r  idge cap shingles do fail t  o seal, blow off, or s  uffer wind damage, GAF \nwill r  eimburse you for t  he reasonable costs of r  eplacing the blown-off s  hingles or damaged shingles or r  idge cap shingles and hand-sealing any unsealed shingles or r  idge cap shingles. \nCosts r   elating to metal work and flashings (  other t  han Covered Flashings) are not i  ncluded. GAF’s maxim um l iability under t  his paragraph i   s t   o reimburse you for t  he cost of hand-sealing all \nof t  he shingles and ridge cap shingles on your r  oof.\nAlgae Warranty: What I  s Covered/Sole And Exc  lusive Remedy \nThis l   imited warranty applies only t   o shingles and ridge cap shingles sold i   n packages bearing the StainGuard P lus\n™\n o r S  tainGuard\n®\n l ogos. GAF warrants t   o you that blue-green algae (also \nknown as cyanobacteria) will n  ot c  ause a pronounced discoloration of y  our S  tainGuard P lus\n™\n- or StainGuard\n®\n-l abeled s hingles or r  idge cap shingles f   or t  he warranty t   erm listed above. \nIf y  our S  tainGuard P lus\n™\n-l abeled s hingles or y  our S  tainGuard\n®\n-l abeled s hingles or r  idge cap shingles exhibit a pronounced discoloration caused by blue-green algae during the Smart \nChoice\n®\n P rotection Period l   isted above, GAF’s contribution will b  e either t  he reasonable cost of c  ommercially cleaning your s  hingles or r  idge cap shingles or, at GAF’s sole option, replacing \ndiscolored shingles or r  idge cap shingles. T  he maxim um c ost t  o GAF shall b  e the l   esser of t  he original c  ost of t  he affected shingles or r  idge cap shingles or t  he cost t  o clean the affected \nshingles or r  idge cap shingles. During the r   emain der o f t  he l   imited warranty period, GAF’s contribution to you will b  e reduced to reflect t  he amount of use you have received from your \nshingles or r  idge cap shingles since they were i   nstalled. T  he amount of use will b  e calculated by dividing the number of months which have elapse\nd since i   nstallation to the date of c  laim by \nthe number of months i   n the Algae Warranty t   erm.\nNote: Prev  enti ng p ro nounced a lgae-rela ted d iscoloration o f y our   s hingles o r r id ge c ap s hingles i s a chiev  ed t hro ugh f ormula tions o r t hrough uniq ue b lends o f granules.\nMisappli cation: What I  s Covered/Sole And Exc  lusive Remedy \nIf any of y  our GAF Products or Covered Flashings i   s f   ound to have an application error t  hat adversely affects performance, GAF will a  rrange t   o have your r  oof r  epaired or r  e-covered or, at i  ts \nsole option, will p  rovide you with replacement GAF product(s) and reimburse you for t  he full r  easonable cost of l  abor and other materials t   o repair or r  e-cover y  our r  oof, i  ncluding Covered \nFlashings. T  he costs of l  abor t  o tear off s  ome or all o  f y  our GAF Products and Covered Flashings and disposal a  re i   ncluded i   f necessary t   o repair y  our r  oof.\nIf y  our c  laim arises out of an application error i  n your GAF Products or Covered Flashings, which i   s discovered or discoverable within the first t  wo years after i  nstallation, it i  s t   he obligation of \nyour M as  ter   E lite\n®\n R oofing Contractor t  o make all n  ecessary r   epairs. I  n the event t  hat GAF determines your Master Elite\n®\n R oofing Contractor i  s unable or unwilling to perform these repairs,   \nGAF will a  rrange t   o have your r  oof r  epaired i   f t  he i   ssues were caused by application errors within the scope of GAF l   iability under t  his l   imited warranty.\nNote: Failure t   o i   nstall a  dequate ventilation i   s NOT a n application error of y  our GAF Products and i   s not c  overed under t  his Limited Warranty. Due t   o the design of c  ertain buildings, the \nreplacement of e  xisting flashings may be difficult, c  ostly, or i  mpractical. Please be sure t   o review these i   tems with your r  oofing contractor.\nWhat I  s Not Covered \nEven i   f y  our GAF products were not properly i   nstalled according to GAF’s application i   nstructions or t  o standard good roofing practices, this l   imited warranty r   emains i   n effect. However, GAF \nwill   NOT b e l   iable for and this warranty does NOT a pply  t o:\n(1)   Damage resulting from anything other t  han an i   nherent manufacturing defect i  n the GAF Products, their misapplication, or t  he misapplication of Covered Flashings, such as:\n (a)   settlement, movement, s  tructural d  amage, or defects i   n the building, walls, foundation, or t  he roof base over which the shingles or accessories were applied.\n (b) i nadequate v entilat  ion.\n(2) Damage resulting from causes beyond normal wear and tear, s  uch as:\n (a)   acts of nature, s  uch as hail, fi  re, or winds (including gusts) over t  he applicable wind speed l   isted above except t  here i   s no maximum wind speed restriction for s  hingles covered by \nthe WindProven\n™\n Li   mited Wind War  ranty.\n (b) i  mpact of t  raffic on the roof or f  oreign objects, including damage caused by objects blown onto the roof by wind.\n      (c) i  mproper s  torage or handling of t  he GAF Products\n.\n(3) I  ce damming, except f  or l  eaks i   n the area of y  our r  oof c  overed by a GAF Leak Barrier which are caused by a manufacturing defect i  n your GAF Leak Barrier, i  ts misapplication, or t  he \nmisapplic ation o f C overed F la shings.\n(4) Shading or v  ariations i   n the color of y  our GAF Products or discoloration or contamination caused by f   ungus, mold, l  ichen, algae (except f  or blue-green algae i   f y  our s  hingles or r  idge cap \nshingles were l   abeled with the StainGuard Plus\n™\n o r StainGuard\n®\n l ogos), or other contaminants, including that c  aused by organic materials on the roof.\n(5) Damage caused by, or t  he cost t  o repair or r  eplace, products not s  old by GAF, i  ncluding but not l  imited to metal work and counterflashing.\n(6) I mpr  operly   d esigned or i nstalled g ut  ter or downspout   s ystems.\n(7) Damage t   o the i   nterior or exterior of t  he building, i  ncluding, but not l  imited to, mold growth.\n(8) Damage t   o or caused by r   ooftop air conditioning units (  and their fl  ashing), pipe works, brace works, skylights, rooftop satellite dishes or other r  adio/TV devices, counterflashing, or \nflas  hings   o ther than those   s pecifically i ncluded a bove.\nOther   L imitations Concer  ning Cover  age \nDecisions as t   o the extent of r  epair, r  e-cover, or c  leaning required, and the reasonable cost of s  uch work, will b  e made solely by GAF. GAF r   eserves t   he right t  o arrange directly f   or y  our \nGAF Products t   o be repaired, r  e-covered, or c  leaned i   nstead of r  eimbursing you for s  uch work. T  he remedy under t  his warranty i   s available only f   or t  hose GAF Products actually exhibiting \nmanufacturing defects, application errors (including misapplication of Covered Flashings), or algae discoloration at t  he time your c  laim is settled. Any r   eplacement GAF Products will b  e \nwarranted only f   or t  he remainder of t  he original warranty period. GAF r   eserves t   he right t  o discontinue or modify i   ts shingles or accessories, including the colors available, s  o any r   eplace-\nment GAF Products may not be an exact match for t  he GAF Products on your r  oof. Even i   f GAF does not modify a color, r  eplacement GAF Products may not match your original GAF Products \ndue t o normal w eat  heri ng, manufacturi ng v ari at  ions, or o ther f actor  s.\nClaims: What Y  ou Must Do \nYou must notify GAF about any claim within 30 days after y  ou notice a problem. Y  ou may r   eport a claim online at gaf.com/contact, by calling GAF at 1  -800-458-1860, s  ending an email \nto warrantyclaims@gaf.com, or by sending a notice i   n writing to: GAF, Warranty Claims Department, 1 Campus Drive, Parsippany, NJ 07054, USA. Y  ou will t  hen be provided with complete \ndetails about s  ubmitting your c  laim. Y  ou may be required to send to GAF, at y  our expense, photographs and sample products f   or t  esting. Within a reasonable time after proper notification,   \nGAF will e  valuate your c  laim and resolve i   t i  n accordance with the t   erms of t  his l   imited warranty. I  f y  ou repair or r  eplace your GAF Products before you notify GAF about y  our c  laim or b efore \nGAF has completed i   ts evaluation of\n y our c  laim, your c  laim may be denied. I  f y  ou need to repair or r  eplace your GAF Products before your c  laim is r   esolved, y  ou MUST p rovide GAF with \nreasonable notice. N OTE: Notice t   o your c  ontractor, d  ealer, o  r h  ome buil der i  s NOT notice t   o GAF. Y  ou should retain this document f  or y  our r  ecords i   n the unlikely event t  hat y  ou need \nto file a claim.\nSole And Exc  lusive Warranty \nTHIS  L IM ITED WARRANTY IS   E XCLUSIVE A ND REPLACES A LL   O THER WARRANTIES, C ONDITI  ONS, REPRESENTATI  ONS, A ND G UARANTEES, WHETHER E XPRESS O R IMPLIE D, WHETHER B Y S TATUTE, \nAT LAW OR IN EQUITY, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. This limited warranty is your exclusive warranty from GAF \nand represents the SOLE REMEDY available to any owner of GAF Products. GAF makes NO OTHER REPRESENTATIONS, CONDITIONS, GUARANTEES, OR WARRANTIES of any kind other than \nthat stated herein. GAF WILL NOT BE LIABLE IN ANY EVENT FOR CONSEQUENTIAL, PUNITIVE, SPECIAL, INCIDENTAL, OR OTHER SIMILAR DAMAGES OF ANY KIND, including DAMAGE TO THE \nINTERIOR OR EXTERIOR OF ANY BUILDING, whether any claim against it is based upon breach of this warranty, negligence, strict liability in tort, or for any other cause. This limited warranty \ngives you specific legal rights, and you may also have other rights which vary from jurisdiction to jurisdiction. Some jurisdictions do not allow limitations on or the exclusion of incidental or \nconsequential damages, so the above limitations or exclusions may not apply to you. New Jersey state residents are encouraged to review their rights under the agreement, as provided \nunder the New Jersey Truth-In-Consumer Contract Warranty and Notice Act (“TCCWNA”).\nThe United Nations Convention on Contracts for the International Sale of Goods shall NOT apply either to the sale of the GAF Products or to this limited warranty.\nModification Of Warranty \nThis limited warranty may not be changed or modified except in writing, signed by an officer of GAF. No one (other than an officer of GAF) has the authority to assume any additional or other \nliability or responsibility for GAF in connection with your GAF Products and Covered Flashings except as described in this limited warranty.\nEffectiveness \nThis limited warranty will not take effect unless all eligibility requirements have been satisfied, this warranty is registered to you, and your roofing contractor has been paid in full. \nImportant Notice:  \nTHIS IS A SAMPLE SILVER PLEDGE\n™\n LIMITED WARRANTY. IT IS YOUR CONTRACTOR’S RESPONSIBILITY TO REGISTER YOUR WARRANTY WITHIN 45 DAYS OF INSTALLATION. IF YOU HAVE NOT \nRECEIVED YOUR WARRANTY FROM GAF WITHIN 60 DAYS, YOU SHOULD CALL GAF AT: 1-888-532-5767, OPTION 5.\nSilver Pledge\n™\n \nLimited Warranty\ncontinued from previous page\nSAMPLE\n©2021 GAF 2/21 • #890 • RESWT210L                    385693-0121\n385693_890_RESWT210-LEGAL_GAF Silver Pledge Limited Warranty SAMPLE 12-20.indd   21/13/21   11:38 PM",
  "textLength": 22873,
  "qualityScore": 0,
  "confidence": 0,
  "checkpoints": [],
  "qualityMetrics": {
    "overallScore": 0,
    "textCompleteness": 0,
    "structurePreservation": 0,
    "technicalAccuracy": 0,
    "readability": 0,
    "confidenceLevel": "low",
    "recommendedAction": "Processing failed - manual review required"
  },
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}