{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Questions/Training.docx",
  "name": "Training.docx",
  "type": "docx",
  "size": 19551,
  "relativePath": "Questions/Training.docx",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:00:14.696Z",
  "extractedText": "Q501–Q550 – Guidance & Training Scenarios\n\nQ501 – When should I involve my Team Leader?\n\nGuidance: Involve your Team Leader when you’ve documented properly, tried a rebuttal, and the adjuster still won’t move. They step in before escalation to management.\n\nQ502 – What’s the escalation order at Roof-ER?\n\nGuidance: Start with teammates → Team Leader → Sales Manager.\n\nAction Coaching: If stuck after Sales Manager review, move to arbitration or complaint filing.\n\nQ503 – How do I prep a Photo Report correctly?\n\nGuidance: Always include slope overviews, close-ups of each damage type, and overall house context.\n\nKnowledge: Use the Photo Report Template.docx as the structure.\n\nQ504 – When do I use the Repair Attempt Template?\n\nGuidance: When the carrier insists shingles are repairable.\n\nAction Coaching: Perform a documented repair attempt → use photos + form → escalate with evidence if repair fails.\n\nQ505 – When do I use the iTel Template?\n\nGuidance: When shingles are discontinued or unavailable.\n\nKnowledge: The iTel report confirms unavailability and is strong evidence for full slope replacement.\n\nQ506 – When should I cite manufacturer guidelines?\n\nGuidance: Anytime the carrier suggests repair instead of replacement.\n\nKnowledge: Use GAF Storm Damage Guidelines.pdf or GAF Slope Replacement.pdf to show repair voids warranty.\n\nQ507 – Why is documentation critical before escalation?\n\nGuidance: Documentation shows you followed process. Without it, escalation has no weight.\n\nAction Coaching: Never escalate without a complete photo set + template use.\n\nQ508 – How do I explain matching law to a homeowner?\n\nGuidance: Explain that state laws (like Maryland’s) require repairs to be reasonably uniform in color/quality.\n\nKnowledge: Use Maryland Insurance Administration Matching Requirement.pdf as the reference.\n\nQ509 – When do I file a complaint vs. arbitration?\n\nGuidance: File a complaint when the carrier ignores law or drags feet. Use arbitration when there’s dispute over policy interpretation.\n\nQ510 – What’s Roof-ER’s #1 rule in the field?\n\nGuidance: Document everything. Photos + notes protect both you and the homeowner.\n\n\n\nQ511 – How many photos per slope should I take?\n\nGuidance: Minimum: 1 overview + 4–6 close-ups per slope.\n\nAction Coaching: If damage is disputed, add chalked damage photos for clarity.\n\nQ512 – How do I prepare for an adjuster inspection?\n\nGuidance: Walk slopes in advance, chalk damages clearly, prep documentation, and be respectful but assertive.\n\nQ513 – What’s the best way to present code requirements?\n\nGuidance: Always bring a copy of the relevant code section.\n\nKnowledge: Use Virginia Building Codes.docx or Maryland Exterior Wrap Code.docx directly.\n\nQ514 – When should I use the Estimate Request Template?\n\nGuidance: When the carrier refuses to provide a full, detailed estimate.\n\nAction Coaching: Submit formally and document the request.\n\nQ515 – How do I explain why patching isn’t acceptable?\n\nGuidance: Show that removing one shingle breaks surrounding seals.\n\nKnowledge: GAF guidelines say patches void warranty.\n\nQ516 – How should I address homeowner concerns about deductible?\n\nGuidance: Be clear and upfront: the deductible is required by law.\n\nAction Coaching: Position it as their investment in restoring their home.\n\nQ517 – What do I do if an adjuster won’t look at my evidence?\n\nGuidance: Stay professional, document the refusal.\n\nAction Coaching: Escalate to Team Leader with your full photo set.\n\nQ518 – How do I handle siding mismatch issues?\n\nGuidance: Use Siding Argument.docx to show why siding cannot be pieced.\n\nKnowledge: Color, texture, and lock-style mismatches fail uniformity.\n\nQ519 – When do I mention arbitration to an adjuster?\n\nGuidance: Only after escalation paths are exhausted.\n\nAction Coaching: Use Arbitration Information.docx as backup.\n\nQ520 – What’s the right tone with adjusters?\n\nGuidance: Respectful, factual, and firm. Never argumentative.\n\n\n\nQ521 – How do I explain warranty voiding to a carrier?\n\nGuidance: Point out GAF’s written requirements.\n\nKnowledge: GAF Storm Damage Guidelines.pdf clearly states repair voids warranty.\n\nQ522 – When should I bring in a repair attempt crew?\n\nGuidance: When required to prove shingles cannot be repaired.\n\nAction Coaching: Use photos and Repair Attempt Template to close the loop.\n\nQ523 – How do I prevent delays in claims?\n\nGuidance: Submit complete documentation early. Follow up weekly with carrier.\n\nQ524 – How should I document a low slope/flat roof?\n\nGuidance: Capture drainage, ponding, and seam failures.\n\nKnowledge: Reference Low Roof_Flat Roof Code.docx.\n\nQ525 – What do I do if the homeowner doesn’t understand matching law?\n\nGuidance: Break it down: “Law says repairs must match. If new and old don’t match, insurance must replace the whole slope/siding.”\n\nQ526 – How do I handle discontinued shingles on site?\n\nGuidance: Take clear photos of manufacturer marks, confirm unavailability with supply houses.\n\nKnowledge: Attach Discontinued-Shingle-List.pdf or iTel report.\n\nQ527 – When do I use the Complaint Form?\n\nGuidance: After adjuster + supervisor refuse reasonable resolution.\n\nKnowledge: Use Complaint Forms.docx and file with state regulator.\n\nQ528 – How do I explain flashing requirements?\n\nGuidance: Show code sections requiring step and counter-flashing replacement.\n\nKnowledge: Use Flashing Codes.docx.\n\nQ529 – How do I prepare for a hostile adjuster?\n\nGuidance: Stay calm, stick to facts, don’t argue.\n\nAction Coaching: Document everything and escalate later.\n\nQ530 – How do I explain underlayment rules to a carrier?\n\nGuidance: Reference code requiring full underlayment replacement on reroof.\n\nKnowledge: Virginia building codes Re-roofing Chapters.docx.\n\n\n\nQ531 – When do I bring up siding codes?\n\nGuidance: Anytime siding is damaged, reference local codes on water barrier and siding overlap.\n\nQ532 – What’s the role of the Photo Report Template?\n\nGuidance: It standardizes documentation so carriers can’t dismiss evidence.\n\nQ533 – How do I show functional hail damage?\n\nGuidance: Highlight fractures, loss of granules, bruising.\n\nKnowledge: Use GAF guidelines.\n\nQ534 – How do I explain “like kind and quality” to a homeowner?\n\nGuidance: It means repairs/replacements must match in function, quality, and appearance.\n\nQ535 – When do I mention arbitration to a homeowner?\n\nGuidance: When explaining last-resort options if claim disputes remain.\n\nQ536 – What do I do if an adjuster won’t climb the roof?\n\nGuidance: Document refusal, take slope photos yourself, escalate.\n\nQ537 – How do I present discontinued shingles evidence?\n\nGuidance: Use iTel report + supply house letters.\n\nKnowledge: Attach Discontinued-Shingle-List.pdf.\n\nQ538 – When do I reference exterior wrap code?\n\nGuidance: When siding is removed or replaced.\n\nKnowledge: Maryland Exterior Wrap Code R703.docx.\n\nQ539 – How do I handle partial approvals?\n\nGuidance: Review what was approved, compare to evidence.\n\nAction Coaching: Use Estimate Request Template to request missing line items.\n\nQ540 – What’s the purpose of the Estimate Request Template?\n\nGuidance: Forces the carrier to give a clear, itemized breakdown.\n\n\n\nQ541 – How do I explain code upgrades to a homeowner?\n\nGuidance: Insurance must cover upgrades required by code, not just existing structure.\n\nQ542 – What should I do before filing arbitration?\n\nGuidance: Ensure you’ve exhausted complaint + supervisor escalation.\n\nKnowledge: Reference Arbitration Information.docx.\n\nQ543 – How do I talk about warranties with homeowners?\n\nGuidance: Explain manufacturer warranty requires proper install + matching materials.\n\nQ544 – How do I avoid claim denials?\n\nGuidance: Proper documentation, follow templates, escalate only with evidence.\n\nQ545 – When do I bring in Sales Manager?\n\nGuidance: Only after Team Leader review fails to resolve.\n\nQ546 – What’s the best way to document repair attempts?\n\nGuidance: Take before, during, and after photos.\n\nKnowledge: Fill out Repair Attempt Template.docx.\n\nQ547 – How do I explain flashing replacement to homeowners?\n\nGuidance: Show how old flashing can’t be reused without leaks.\n\nQ548 – What if the carrier refuses code upgrades?\n\nGuidance: Show code language directly.\n\nAction Coaching: File complaint with regulator if denied.\n\nQ549 – What’s the right way to close an inspection with an adjuster?\n\nGuidance: Summarize findings, confirm what was noted, document their statements.\n\nQ550 – What’s the main thing that separates Roof-ER reps from competitors?\n\nGuidance: Consistency — every rep uses the same templates, codes, and process.\n\nQ551–Q600 – Guidance & Training with Next Steps\n\nQ551 – How do I explain why we take so many photos?\n\nGuidance: Photos are your proof. They protect you, Roof-ER, and the homeowner. Without them, insurance can deny.\n\nNext Step: If adjuster or homeowner questions volume, explain that thorough photos are required to build a bulletproof file.\n\nQ552 – When should I introduce myself to the adjuster?\n\nGuidance: Always greet them immediately, be professional, and state you represent the homeowner.\n\nNext Step: If they try to dismiss you, calmly explain you are there to document and protect the homeowner’s interests.\n\nQ553 – How do I explain iTel to a homeowner?\n\nGuidance: It’s a lab test that proves if shingles are discontinued/unavailable.\n\nNext Step: If homeowner hesitates, show them the iTel Template and explain it strengthens their case.\n\nQ554 – How do I handle homeowners nervous about complaints?\n\nGuidance: Explain complaints are a standard, legal process — not “suing.”\n\nNext Step: If they resist, reassure them Roof-ER handles the heavy lifting with the state complaint form.\n\nQ555 – When do I bring up building code upgrades?\n\nGuidance: Always when explaining why replacement is necessary.\n\nNext Step: If adjuster resists, provide the code section and escalate to Team Leader.\n\nQ556 – How do I maintain professionalism with hostile adjusters?\n\nGuidance: Stay calm, never argue, stick to facts.\n\nNext Step: Document hostility and report it to Team Leader with photos and notes.\n\nQ557 – What’s the rule on roof access safety?\n\nGuidance: Always use ladder safety, harness if required, and never climb unsafe roofs.\n\nNext Step: If unsafe, document from ground and escalate to Team Leader for direction.\n\nQ558 – How do I explain siding mismatches to carriers?\n\nGuidance: Show differences in color, texture, lock profile.\n\nNext Step: If denied, escalate with Siding Argument.docx attached.\n\nQ559 – When do I use Estimate Request Template?\n\nGuidance: If carrier doesn’t provide full estimate.\n\nNext Step: Submit formally; if ignored, escalate with Sales Manager.\n\nQ560 – What should I do after every inspection?\n\nGuidance: Document everything in CRM immediately.\n\nNext Step: If missing pieces, return to property same day to finish documentation.\n\n\n\nQ561 – How do I explain deductible legally?\n\nGuidance: It’s the homeowner’s legal responsibility by state insurance law.\n\nNext Step: If homeowner resists, frame it as their investment in protecting the value of their home.\n\nQ562 – When do I prepare a repair attempt?\n\nGuidance: Only when carrier insists shingles are repairable.\n\nNext Step: Document attempt, photos before/after, and use Repair Attempt Template.docx.\n\nQ563 – How do I explain flashing replacement?\n\nGuidance: Old flashing bends/holes can’t be resealed properly.\n\nNext Step: If adjuster resists, cite Flashing Codes.docx.\n\nQ564 – What should I do before arbitration?\n\nGuidance: Ensure complaint has already been filed.\n\nNext Step: Use Arbitration Information.docx and consult Sales Manager.\n\nQ565 – How do I talk about matching law in Maryland?\n\nGuidance: Law requires repairs to be uniform in color/quality.\n\nNext Step: If adjuster argues, attach Maryland Matching Requirement.pdf.\n\nQ566 – When do I escalate to Sales Manager?\n\nGuidance: After Team Leader review fails.\n\nNext Step: Provide full documentation package so Sales Manager can escalate efficiently.\n\nQ567 – How do I explain granule loss?\n\nGuidance: Granules protect asphalt; loss exposes roof to leaks.\n\nNext Step: If adjuster calls it cosmetic, use GAF guidelines to show it’s functional.\n\nQ568 – When do I use the Photo Report Template?\n\nGuidance: Always, for every claim file.\n\nNext Step: If carrier pushes back, attach the Photo Report to show standard documentation.\n\nQ569 – How do I prepare homeowners for adjuster visits?\n\nGuidance: Tell them to expect you to walk roof with adjuster and present evidence.\n\nNext Step: If homeowner is nervous, remind them Roof-ER handles the technical parts.\n\nQ570 – What if carrier delays for months?\n\nGuidance: Log every follow-up attempt.\n\nNext Step: Escalate with Complaint Form if carrier exceeds regulatory timelines.\n\n\n\nQ571 – How do I explain slope replacement?\n\nGuidance: You can’t replace only part of a slope without leaks.\n\nNext Step: Cite GAF Requirement – Slope Replacement.pdf.\n\nQ572 – What do I do if adjuster ignores chimney flashing?\n\nGuidance: Document with close-up photos.\n\nNext Step: Escalate using Flashing Codes.docx.\n\nQ573 – How do I explain “like kind and quality”?\n\nGuidance: Repairs must match function, quality, and appearance.\n\nNext Step: If disputed, reference policy language directly.\n\nQ574 – What if shingles aren’t available locally?\n\nGuidance: Use iTel report + supplier statements.\n\nNext Step: Escalate with Discontinued-Shingle-List.pdf.\n\nQ575 – How do I respond to “hail is cosmetic”?\n\nGuidance: Show fractures, bruising, and granule loss.\n\nNext Step: Provide GAF guidelines showing functional damage.\n\nQ576 – When do I bring in Team Leader for inspection?\n\nGuidance: If adjuster is combative or dismissive.\n\nNext Step: Call Team Leader during inspection if necessary.\n\nQ577 – How do I explain why underlayment matters?\n\nGuidance: It’s the waterproof layer; old underlayment cracks and fails.\n\nNext Step: Cite Virginia building codes Re-roofing Chapters.docx.\n\nQ578 – What do I do if homeowner doesn’t understand complaint process?\n\nGuidance: Explain it’s like filing with DMV — simple, legal, and effective.\n\nNext Step: Show them Complaint Forms.docx.\n\nQ579 – How do I prove siding is discontinued?\n\nGuidance: Contact supply houses + use iTel.\n\nNext Step: File mismatch claim with photos + Siding Argument.docx.\n\nQ580 – What if carrier ignores flashing requirements?\n\nGuidance: Point directly to code.\n\nNext Step: Escalate with Sales Manager + Flashing Codes.docx.\n\n\n\nQ581 – How do I explain to homeowners why Roof-ER documents so much?\n\nGuidance: Documentation wins claims and protects them.\n\nNext Step: If overwhelmed, reassure them it’s standard practice.\n\nQ582 – What’s the best way to close out an adjuster meeting?\n\nGuidance: Summarize what was seen and agreed.\n\nNext Step: Document their statements in CRM immediately.\n\nQ583 – How do I present iTel to a carrier?\n\nGuidance: Provide report copy + supply house verification.\n\nNext Step: Escalate with Discontinued Shingle List if denied.\n\nQ584 – What if adjuster won’t let me speak?\n\nGuidance: Stay respectful, don’t interrupt.\n\nNext Step: Document refusal and escalate later.\n\nQ585 – How do I talk about siding underlayment?\n\nGuidance: Required by code for weather barrier.\n\nNext Step: Reference Maryland Exterior Wrap Code R703.docx.\n\nQ586 – When do I use arbitration vs complaint?\n\nGuidance: Complaint = process failure, Arbitration = policy dispute.\n\nNext Step: Confirm with Sales Manager before filing.\n\nQ587 – How do I respond if adjuster won’t chalk damage?\n\nGuidance: Chalk yourself and photograph.\n\nNext Step: Escalate refusal to Team Leader.\n\nQ588 – What if homeowner doesn’t want to escalate?\n\nGuidance: Respect choice, but explain limits.\n\nNext Step: Offer to at least file complaint for record.\n\nQ589 – How do I talk about ventilation codes?\n\nGuidance: Code requires proper intake/exhaust ventilation.\n\nNext Step: Reference code section and explain warranty void without compliance.\n\nQ590 – When do I recommend arbitration to homeowner?\n\nGuidance: Last resort when carrier won’t move.\n\nNext Step: Review Arbitration Information.docx with them.\n\n\n\nQ591 – How do I prep for flat roof inspection?\n\nGuidance: Document seams, ponding, and flashing.\n\nNext Step: Reference Low Roof_Flat Roof Code.docx.\n\nQ592 – What if adjuster denies obvious damage?\n\nGuidance: Stay professional, don’t argue.\n\nNext Step: Document denial and escalate with photo set.\n\nQ593 – How do I explain “functional vs cosmetic” damage?\n\nGuidance: Cosmetic = looks only; Functional = impacts performance.\n\nNext Step: Use GAF guidelines to show hail/wind is functional.\n\nQ594 – What do I do if I miss photos?\n\nGuidance: Return same day if possible.\n\nNext Step: Never submit incomplete file — escalate delay if needed.\n\nQ595 – How do I explain slope overview photos?\n\nGuidance: They show context and prove consistency of damage.\n\nNext Step: If adjuster questions, explain it avoids cherry-picking.\n\nQ596 – When do I provide written arguments?\n\nGuidance: When verbal rebuttals fail.\n\nNext Step: Use Roof-ER templates for consistency.\n\nQ597 – How do I talk about warranty void to homeowners?\n\nGuidance: Mixing old/new voids coverage.\n\nNext Step: Provide GAF requirement docs.\n\nQ598 – What if carrier delays estimate?\n\nGuidance: Log requests, ask weekly.\n\nNext Step: File complaint if delay exceeds regulatory timeline.\n\nQ599 – How do I talk about repair attempts to homeowners?\n\nGuidance: It proves shingles can’t be fixed.\n\nNext Step: Show Repair Attempt Template.\n\nQ600 – What’s the single most important rep habit?\n\nGuidance: Consistency — always use templates, codes, and full documentation.\n\nNext Step: If in doubt, check CRM and ask Team Leader before proceeding.\n\n\n\n",
  "textLength": 17636,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}