{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Training Manual.docx",
  "name": "Training Manual.docx",
  "type": "docx",
  "size": 45591324,
  "relativePath": "Training Manual.docx",
  "category": "training_materials",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:06.407Z",
  "extractedText": "2024 Training Guide\n\n\n\n\n\n\n\n\n\n\n\nIntegrity . Simplicity . Quality\n\nTable of Contents\n\n\n\n3. Meet the Owner & Company History\n\n4. Introduction to Training and Director of Sales\n\n5. Mission and Values\n\n6. Your Commitment\n\n7. Initial Sales Pitch\n\n8. Inspection and Post Inspection Pitch\n\n\t11. Claim FIling Information Sheet\n\n\t12. Example of Claim Filing Information Sheet\n\n13. Contingency and Claim Authorization Pitch\n\n14. Shingle Types\n\n\t14. 3-Tab\n\n\t15. Architectural\n\n\t16. Discontinued\n\n17. Damage Photos\n\n\t17. Storm Damage\n\n\t18. Non-Storm Damage\n\n\n\n\n\n\n\n\n\nWelcome to Roof-ER!\n\nMeet the Owner:\n\n\n\nMy name is Oliver Brown. I founded this company in 2019, not because I have a passion for roofing or because I was born into a family of contractors, but because I saw an opportunity. An opportunity to change the reputation of roofing companies and contractors as a whole. This is an industry that is known for lack of communication, poor workmanship, used car sales techniques and straight up deceit by companies who still write up quotes with a pen and paper. With a little bit of modern thinking, integrity and hard work we’ve been able to build a strong brand and reputation in a relatively short amount of time. From $2.5m in year one, as a one man sales team to $20m in 2023, we are one of the fastest growing roofing companies in the DMV. That growth has only been possible by attracting like minded people who are looking to change their lives and those around them… And we are just getting started! \n\n\n\nWe have ambitions of growing up and down the east coast and eventually becoming a national brand. To accomplish this we need to continue to add and develop hungry, competitive team members who are dedicated to the big picture but disciplined to execute on a day to day basis. \n\n\n\n\n\n\n\nWelcome to your new career!\n\n\n\nMy name is Reese Samala, Director of Sales, here at Roof-ER! I will be spending your first week here with you.  I am excited to see what you accomplish here with us.\n\nA quick introduction of who I am:\n\nI am a medically retired Infantryman in the Army.  I have held previous positions as an automotive technician, various sales roles, and also had my own government contracting business.\n\nI am excited about the opportunities we are creating here.  We are dynamically growing this business and need people like you who want to be part of that growth.  I will always be a resource that you can lean on.  You will hear me say this many times throughout your time here with us: My marker of success is being able to see other people achieve things that they have not been able to achieve previously. \n\nThank you and I am excited to see what you accomplish here!\n\n\n\nReese Samala\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMission and Values\n\nOur Mission:\n\nAt Roof-ER, our mission is to hold a fiduciary responsibility to our customers - plain and simple. In an industry known for poor workmanship, lack of communication, and at times, outright deceit; we seek to restore the name of exterior remodeling contractors nationwide. By committing to our core values of Integrity, Quality, and Simplicity, we promise to deliver an experience every homeowner wants when remodeling their home: a simple and straightforward quality installation for a fair and honest price.\n\n\n\nOur Core Values:\n\nIntegrity: At Roof-ER, we set the standard for Integrity in an industry that has lost credibility among many consumers. We do not only set the standard of integrity with our clients, but it starts with being honest to ourselves. We have the courage to truly see ourselves, recognize where we can grow, and implement changes to meet the demands of reality.\n\nQuality: We guarantee the highest Quality in our products and services.  Our confidence in our craft propels us into the elite 1% of all roofing companies in the entire nation. Quality starts with the moment a client interacts with one of our representatives at the door.  The Quality demonstrated in every aspect of what we do continues to make Roof-ER the gold standard of this industry.\n\nSimplicity: We strive to deliver an overwhelmingly positive experience for everyone who interacts with Roof-ER.  By embracing the complexities of our industry, we provide exceptional results to our clients.  Our clients value the Simplicity of partnering with us – we guarantee a seamless process from start to finish ensuring satisfaction with the final outcome.\n\n\n\n\n\n\n\n\n\nYour Commitment:\n\n\n\nI will conduct myself in alignment with the Mission and Core Values.\n\nI will dedicate myself to Roof-ER’s successful sales process.\n\nI will always show an exceptional level of integrity when interacting with clients, co-workers, and (especially) myself.\n\nI will listen to and grow from receiving constructive feedback.\n\nI will not be afraid to communicate with the correct individual(s) when I have an issue or grievance.\n\nI will not be involved in gossip or “office drama.”\n\nI will be an effective and contributing member of the Roof-ER team.\n\nI will show an intense level of discipline in the work that I conduct.\n\nI will not let negativity or “bad days” have a detrimental impact on my work ethic and the quality of what I do.\n\nI will have pride in my work.\n\nI will do what it takes to commit to this. I will achieve tremendous levels of success. I have seen the success that others achieved by committing to this process - I WILL be part of that.\n\n\n\n\n\nInitial Pitch\n\n\n\n5 Non-negotiables with every pitch\n\nWho you are\n\nWho we are and what we do (Roof ER)\n\nMake it relatable\n\nWhat you’re there to do (an inspection)\n\nGo for the close (them agreeing to the inspection)\n\nKnock on door/ring doorbell \n\nAs they are opening the door, smile and wave. \n\n“Hi, how are you? My Name is ________ with Roof- ER we’re a local roofing company that specializes in helping homeowners get their roof and/or siding replaced, paid for by their insurance!”  \n\n\n\nGeneric\n\n“We’ve had a lot of storms here in Northern Virginia/Maryland over the past few months that have done a lot of damage! \n\n“We’re working with a lot of your neighbors in the area. We’ve been able to help them get fully approved through their insurance company to have their roof (and/or siding) replaced.”\n\nOR\n\nSpecific\n\n“Were you home for the storm we had in ___. Wait for answer\n\nIf yes “It was pretty crazy right?! Wait for answer \n\nIf no: “Oh no worries at all, we get that all the time.\n\nIf yes move on to next line\n\n“We’re working with a lot of your neighbors in the area. We’ve been able to help them get fully approved through their insurance company to have their roof (and/or siding) replaced.”\n\n\n\n“While I’m here, in the neighborhood, I am conducting a completely free inspection to see if you have similar, qualifiable damage. If you do,  I’ll take a bunch of photos and walk you through the rest of the process. If you don’t, I wouldn’t want to waste your time, I wouldn’t want to waste mine! I will at least leave giving you peace of mind that you’re in good shape.”\n\nOnce they agree to let you do the inspection:, “Alright! It will take me about 10 - 15 minutes. I’m gonna take a look around the perimeter of your home, then grab the ladder, and take a look at your roof.\n\nGo in for a handshake. What was your name again? [Their name] great to meet you, again I am (your name).  Oh and by the way do you know who your insurance company is”? Wait for their answer, “Great! We work with those guys all the time.”\n\n“I will give you a knock when I finish up and show you what I’ve found.”\n\nWithout any hesitation, move into inspection. (See Inspection and Post-Inspection Script for detailed next steps.)\n\nInspection - Ideal photo progression \n\n§Mailbox/House Number/§Overview of House\n\n§Front Elevation Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Right Elevation  Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Rear Elevation Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Left Elevation Collateral\n\n§Damage to screens, gutters, downspouts, siding\n\n§Roof Overview Collateral\n\n§Damage to roof metals and other collateral on the roof\n\n§Circle Hail Hits & Slash Wind Damage (close up of each)\n\n§Overview of majority of the damage chalked up\n\n§Pictures of granules in the gutters or at the bottom of downspouts \n\n§Entire inspection shouldn’t take any longer than 15-20 minutes. How thorough of an inspection you  should do is a judgment call. Getting enough photos to sell the homeowner is most important. It doesn’t  matter how quickly you are able to complete the inspection if you don’t have enough damage-photos for  the homeowner to be on board with filing the claim.\n\n§Flashlight\n\n\n\n\n\n\n\nPost-Inspection Pitch\n\n\n\nKnock on the door \n\n\n\n“Hey _______, so I have a bunch of photos to show you. First I walked around the perimeter of the house  to look for collateral damage. I’ll also show you the collateral damage we found on the roof.”  \n\n\n\nStart showing the pictures of damage to screens, gutters, downspouts, and soft metals\n\n\n\n“While this damage functionally isn’t a big deal, it really helps build a story.  Think of us like lawyers and this collateral damage is the evidence that builds the case which helps us get the roof and/or siding approved.”\n\nContinue to slide through collateral damage photos\n\n\n\n“Here are the photos of the damage to your shingles. Anything I have circled means its hail damage (IF there were any wind damaged shingles or missing shingles say:) and  anything I have slashed means its wind damage. \n\n\n\nRemain on a photo of hail damage as you explain the following\n\n\n\n“This is exactly what we look for when we're looking for hail damage. If you notice, the divot is circular  in nature.   Even if this  damage doesn’t look like a big deal, what happens over time, these hail divots fill with water, freeze….,  when water freezes it expands and breaks apart the shingle which will eventually lead to leaks.  That is why your insurance company is responsible and your policy covers this type of damage.” \n\n\n\nStart slowly swiping through all the pictures of hail. \n\n\n\n“As you can see there is quite a bit of damage.  \n\n\n\nStart slowly swiping through all the pictures of hail.  \n\n\n\nIf there was wind damage or missing shingles, say the following:\n\n“Now here are the wind damaged shingles. You have both shingles that are creased from the wind lifting them up and shingles that have completely been blown off.”\n\n\n\nShow the pictures of wind damaged and/or missing shingles (if applicable)\n\n\n\n“This is very similar to damage to ________ home and/or the rest of the approvals we’ve gotten in the area”.  \n\n\n\n“With that being said, insurance companies are always looking for ways to mitigate their losses. It’s unfortunate but that’s how they make money. The most important part of this process is that when your insurance company comes out to run their inspection, we are here as storm experts to make sure you as a homeowner get a fair shake. If they are missing anything we make sure they see all the damage that I  just showed you.” \n\n\n\n“What I’m going to do now is run to my car, grab my iPad and we can get this process started”! Go get iPad \n\n\n\nAs you approach back to the house/homeowner ask “Is there a place we could sit down for 5-10  Minutes”?\n\nOnce you are in the house, spend some time building rapport as you get settled. \n\n\n\n“Okay, so first I am going to grab some of your basic information for our system. Then we can give your  insurance company a call”. \n\n\n\nGather information from the homeowner:\n\nFull name\n\nAddress\n\nPhone Number  \n\nE-mail\n\nInsurance Company\n\n\n\n“Do you happen to know your deductible? If not, no big deal at all”! \n\n\n\nAfter you have collected all the information:\n\nAsk if they have the app or if they have the login to the website. \n\nIf not, use the Homeowner Information Sheet to prep the HO.  As you are writing or typing the information for the HO to use on the call, explain each part to them.\n\nAs much as possible, use HO’s phone to make the call \n\nReference Claim Filing Information Sheet\n\nMove on to Contingency & Claim Authorization\n\n\n\nClaim Filing Information Sheet  \n\nYou should use this information to prep the HO – Use a blank note on your iPad\n\nHO: “I’d like to file a claim for hail [and wind] damage” (never only wind)\n\nInsurance: “What was damaged?”\n\nRoof\n\nDownspouts\n\nGutters\n\nWindow Wraps\n\nSiding\n\nEtc.\n\nDate of loss\n\nTime of storm (usually around 5pm)\n\nSize of hail (usually 1 – 1.5 inches)\n\nType of shingle and/or siding\n\nAny interior damage?\n\nIs the house livable?\n\nWas there any personal property damaged?\n\nDid they lose power?\n\nHave you selected a contractor? (yes, we want them to know ASAP that you are working with me)\n\nDo they have an estimate? (always no)\n\nIs your roof steeper than an average staircase?\n\nHow high is the roof/is it difficult to access with most ladders?\n\n\n\nThings they should do on the call:\n\nAsk for adjuster info, if not available yet, that’s okay too.\n\nAlways ask for claim number\n\nIf Claim Rep wants to schedule the inspection now (only Allstate) – have 3 available times listed out for the HO\n\nSee example on next page\n\n\n\n\n\n\n\n\n\nExample Claim Filing Information Sheet\n\nLet them know you would like to file a claim for hail and wind damage.\n\nWhat was damaged: Roof and Aluminum siding\n\nDate of the storm: September 8th 2023\n\nTime of the storm: Around 5pm\n\nSize of hail: 1 inch\n\nType of shingle: Asphalt\n\nType of siding: Aluminum\n\nInterior Damage: Yes, 1 bedroom upstairs\n\nIs the house livable: Yes\n\nWas there any personal property damaged: No\n\nDid they lose power: No\n\nHave you selected a contractor: Yes, Roof ER out of Vienna VA. All my information is on the business card\n\nDid they give you an estimate: No\n\nIs your roof steeper than a staircase: No\n\nHow high is your roof/is it difficult to access with most ladders: No, it has 1 story access\n\n\n\nAfter they say the claim is filed, please ask for the Claim Number\n\nAfter they provide that, ask if an adjuster has been assigned\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContingency & Claim Authorization\n\nAfter the call: “Okay, perfect! (Like they said,) an adjuster will be reaching out to you in the next 24 to 48 hours to schedule the inspection. The absolute most important part of this process is that I am at this inspection. Insurance companies don’t want to pay out. They are trying to mitigate their losses after storms. I am there as your representation to make sure you get a fair shake. \n\n\n\nTurn the iPad so you and the homeowner can see. \n\n\n\n\n\n“This basic/simple agreement backs you as the homeowner by guaranteeing you that your only cost will be your deductible if we get you fully approved. If it is a partial approval or denial, first we will fight and jump through the necessary hoops to turn that into a full approval; but if we are not able to get you fully approved, this contract is null and void and you do not owe us a penny.”\n\n\n\n“What’s in it for us, is we just want to get to do the work. This agreement commits you to using us if we hold up our end of the bargain and achieve a full-approval.”\n\n\n\nYou sign\n\n\n\nThey sign\n\n\n\n“This next form is our Claim Authorization form.  Very simple, it allows us to communicate with your insurance company.  I’ll be here for the inspection and  we will also communicate with them through email and phone calls so you don’t have to be a middle-man.  Of course, I’ll always keep you looped in with our communication by CCing you in all emails and updating you on any conversations we have.\n\n\n\nThey sign\n\n\n\nPress Submit enter password “roofer” if it asks.\n\n\n\n“Alright, we are all set! Again, the most important part of this process is that I am here when the insurance company comes out.  Ideally you can have them call me to schedule that directly. If they call me, great! But, regardless, please get the adjuster’s information (name, email, phone number) and send that over to me so that I can communicate with them before the inspection. If they insist on scheduling with you, go ahead and pencil in a time and avoid these times and days [provide your schedule]\n\n\n\nAnswer any questions that the HO may have\n\n“Thank you, sir/ma’am, looking forward to seeing you on the day of inspection, you have my contact information on my card if you need anything else\n\n\n\n\n\n\n\n\n\nShingle Types\n\n\n\n3-Tab: \n\n\n\n\n\n\n\n\n\nArchitectural: \n\n\n\n\n\n\n\n\n\nDiscontinued Shingles\n\n\n\n Horizon\n\n\n\n Tiger Stripe\n\n\n\nIndependence\n\nDamage Photos\n\nStorm Damage: \n\n\n\n\n\nNot Storm Damage: \n\n\n\n\n\n\n\n",
  "textLength": 16371,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}