{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/Untitled document.docx",
  "name": "Untitled document.docx",
  "type": "docx",
  "size": 1009370,
  "relativePath": "Untitled document.docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:08.426Z",
  "extractedText": "Q- How are you handy?\n\nI’m handy because I’m built around your world at Roof-ER.\n\nHere’s why:\n\nEverything is preloaded with YOUR docs – I’m not guessing or giving generic answers. I’ve got all your Roof-ER templates, codes, GAF requirements, iTel reports, discontinued lists, and even your sales training. When you ask for help, I can instantly grab the right piece.\n\nI speak insurance & roofing – Whether it’s brittle tests, siding mismatch, slope code, or storm damage arguments, I know how to frame it in adjuster language and back it with codes and manufacturer guidelines .\n\nI save you time in the field – Instead of digging through folders or trying to remember which template fits, I can hand you the exact one in seconds, already tailored.\n\nI’ve got your escalation paths covered – From homeowner complaint forms to arbitration info , I know the next step when insurance stonewalls you.\n\nI keep it Roof-ER focused – My mission isn’t general roofing advice. It’s helping you close claims, hit bonuses, and protect homeowners — the same goals laid out in your sales training .\n\n👉 Basically: I’m like your pocket project manager + claim coach + code book + sales trainer rolled into one.\n\nWant me to show you a sample workflow — like how I’d walk you through a partial denial siding claim step by step, with the right doc, code, and pushback language?\n\nyes\n\n Let’s run a sample workflow for a Partial Denial Siding Claim.\n\nHere’s exactly how I’d guide you step by step in the field:\n\nScenario\n\nInsurance approved 1 elevation of siding, but denied full replacement.\n\n\n\n1️⃣ Immediate Response – Pick the Right Template\n\n➡ Use the Siding Argument Template .\n\nThis doc has prebuilt arguments for:\n\nAdditional damage photos\n\nDiscontinued siding (via iTel & Discontinued List)\n\nCode/Housewrap requirements (MD R703 or VA building code)\n\n\n\n2️⃣ Supporting Evidence\n\n📌 Discontinued Product\n\nCheck iTel report → If siding is discontinued, attach report.\n\nCross-reference with Discontinued Shingle/Siding list .\n\nArgument: “Patch repair is impossible — only full replacement makes homeowner whole.”\n\n📌 Code Requirement\n\nMaryland: R703.2 requires continuous water-resistant barrier & housewrap, plus overlapping at corners .\n\nThis means siding removal inevitably damages adjacent panels, forcing full replacement.\n\nVirginia: Code also supports no reinstallation of damaged siding panels .\n\n\n\n3️⃣ Write the Pushback Email\n\nHere’s a ready-to-use version (edit job details first):\n\n\n\nSubject: Claim # [Insert] – Siding Scope Revision Request\n\nTo Whom It May Concern,\n\nThis is [REP NAME] with Roof-ER. I am assisting [CUSTOMER NAME].\n\nAttached are:\n\nOur photo report documenting additional siding damage,\n\nAn iTel report confirming the siding is discontinued,\n\nReference to building code R703, which requires full siding replacement for compliance.\n\nBecause the siding is discontinued and repairs would cause consequential damage, patch repair is not a cost-effective or code-compliant solution. The only way to restore [CUSTOMER NAME]’s property is full siding replacement on all elevations.\n\nPlease review these findings and provide a revised estimate accordingly. If additional inspection is required, I will gladly meet your adjuster on-site.\n\nThank you for your time and cooperation in restoring [CUSTOMER NAME]’s home.\n\n[Signature & Contact Info]\n\n\n\n4️⃣ Escalation if Denied Again\n\nHave homeowner send the “Customer to Insurance” template .\n\nIf still stuck, file complaint with Maryland Insurance Administration (MIA) citing Bulletin 18-23 on mismatch claims .\n\nLast resort: consider arbitration .\n\n\n\n✅ End Result: You’ve hit them with\n\nPhoto evidence,\n\nManufacturer & iTel data,\n\nCode citations,\n\nHomeowner involvement,\n\nState insurance rules.\n\nThat’s the 5-layer defense that usually forces a scope revision.\n\n\n\nDo you want me to build you a ready-to-fill packet (Word doc) that bundles together the Siding Argument + iTel insert + Code citations, so all you do is drop in photos and customer info?\n\n\n\n",
  "textLength": 4002,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}