{
  "path": "/Users/a21/Desktop/Sales Rep Resources 2 copy/📧 Email Generator .docx",
  "name": "📧 Email Generator .docx",
  "type": "docx",
  "size": 566666,
  "relativePath": "📧 Email Generator .docx",
  "category": "reference",
  "status": "pending",
  "processed": true,
  "processedAt": "2025-10-31T04:01:53.387Z",
  "extractedText": "\n\n📧 Email Generator button could work in practice if it were built into the Roof-ER field app:\n\n\n\n⸻\n\n\n\n1. User Flow\n\n\t•\tClick Button: Rep taps 📧 Email Generator.\n\n\t•\tPrompt Screen: A simple form opens asking:\n\n\t•\tWho’s the email for? (Homeowner, Adjuster, Insurance Desk, Escalation/Complaint)\n\n\t•\tClaim number (auto-fill if already in job file)\n\n\t•\tAttachments? (Photo Report, iTel, Repair Attempt, Discontinued Shingle List, COI, etc.)\n\n\t•\tKey notes / custom message.\n\n\n\n⸻\n\n\n\n2. Template Selection\n\n\n\nThe system pulls from Roof-ER’s preloaded Word templates (e.g., Repair Attempt, Partial, Estimate Request, Siding Argument, Customer-to-Insurance) and auto-formats them into email text.\n\n\n\n⸻\n\n\n\n3. Auto-Population\n\n\t•\tHomeowner Emails: Friendly updates in plain language, like confirming inspection or next steps.\n\n\t•\tAdjuster Emails: Professional tone with supporting docs (Photo Report, Code references, GAF guidelines).\n\n\t•\tCarrier/Insurance Emails: Formal, using compliance language and escalation if needed (matching laws, arbitration rights, complaint forms).\n\n\n\nEach email would auto-fill:\n\n\t•\tHomeowner name & address\n\n\t•\tClaim number & carrier\n\n\t•\tRep’s signature (name, phone, email, Roof-ER info)\n\n\n\n⸻\n\n\n\n4. Smart Attachments\n\n\n\nSystem recommends what to attach:\n\n\t•\tRepair Attempt → attach Repair Attempt Template + Photo Report.\n\n\t•\tPartial Denial → attach Generic Partial Template + GAF Guidelines.\n\n\t•\tSiding → attach Siding Argument + Code reference.\n\n\t•\tEscalation → attach Complaint Form + Arbitration doc.\n\n\n\n⸻\n\n\n\n5. Final Step\n\n\t•\tPreview email before sending.\n\n\t•\tOption to send direct from app or copy text into Gmail/Outlook.\n\n\t•\tConfirmation saved to job file for tracking.\n\n\n\n⸻\n\n\n\n👉 Essentially, the Email Generator would turn your templates + claim data into ready-to-send, professional emails in seconds — so reps don’t waste time rewriting the same points.\n\n\n\nEmail Generator — Example Flow\n\n\n\nStep 1: Rep Chooses Options\n\nRecipient: Adjuster\n\nSituation: Partial Denial (only slope approved, others denied)\n\nClaim #: 12345678\n\nHomeowner: John & Mary Smith\n\nCarrier: State Farm\n\nAttachments: Photo Report, GAF Guidelines, Discontinued Shingle List\n\n\n\nStep 2: Email Output (Auto-Generated)\n\nSubject: Claim #12345678 — Full Roof Replacement Required (Smith Residence)\n\nBody:\n\nHello [Adjuster Name],\n\n\n\nI am writing regarding the above-referenced claim for John & Mary Smith at [address]. We appreciate your approval of the [approved slope], but respectfully must point out why full replacement is required for this roof system.\n\nManufacturer Requirements: Per GAF Storm Damage Guidelines, partial replacements compromise roof integrity and void manufacturer warranty.\n\nBuilding Code Compliance: [If applicable, system inserts state code reference — e.g., VA slope requirement, MD matching law.]\n\nMaterial Availability: The insured’s shingles are discontinued (see attached Discontinued Shingle List). Mixing product lines is prohibited per manufacturer.\n\nUniform Appearance: Industry standards (HAAG, NAIC) require uniformity — patching or partial replacement would result in a mismatched roof system.\n\n\n\nFor these reasons, we request full approval of all slopes. Supporting documentation and photos are attached for review.\n\n\n\nPlease confirm receipt and next steps.\n\n\n\nBest regards,\n\n[Rep Name]\n\nRoof-ER\n\n[Phone] | [Email]\n\nAttachments Auto-Added:\n\nPhoto Report (generated from app photos)\n\nGAF Storm Damage Guidelines.pdf\n\nDiscontinued Shingle List.pdf\n\n\n\nStep 3: Rep Actions\n\n✅ Quick preview/edit if needed.\n\n📤 Send directly from the app (or copy into Outlook/Gmail).\n\n🗂️ Email automatically saved in customer’s claim file.\n\n\n\n🔥 This means reps can go from “Adjuster denied partial” → ready-to-send professional rebuttal email in under 1 minute.\n\n\n\n",
  "textLength": 3785,
  "qualityScore": 0,
  "confidence": 0,
  "technicalTerms": [],
  "processingMethod": "tesseract",
  "cached": false,
  "cost": 0
}